package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_52Activity extends AppCompatActivity {

    ArrayList<AltorEx> altorExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_52_adapter quran_explanation_52_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_52);

        altorExes.add(new AltorEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"));
        altorExes.add(new AltorEx("وَالطُّورِ (1)"));
        altorExes.add(new AltorEx("أقسم الله بالطور، وهو الجبل الذي كلَّم الله سبحانه وتعالى موسى عليه."));
        altorExes.add(new AltorEx("وَكِتَابٍ مَسْطُورٍ (2)"));
        altorExes.add(new AltorEx("كتاب مكتوب، وهو القرآن."));
        altorExes.add(new AltorEx("فِي رَقٍّ مَنْشُورٍ (3)"));
        altorExes.add(new AltorEx("في صحف منشورة."));
        altorExes.add(new AltorEx("وَالْبَيْتِ الْمَعْمُورِ (4)"));
        altorExes.add(new AltorEx("وبالبيت المعمور في السماء بالملائكة الكرام الذين يطوفون به دائمًا."));
        altorExes.add(new AltorEx("وَالسَّقْفِ الْمَرْفُوعِ (5)"));
        altorExes.add(new AltorEx("وبالسقف المرفوع وهو السماء الدنيا."));
        altorExes.add(new AltorEx("وَالْبَحْرِ الْمَسْجُورِ (6)"));
        altorExes.add(new AltorEx("وبالبحر المسجور المملوء بالمياه."));
        altorExes.add(new AltorEx("إِنَّ عَذَابَ رَبِّكَ لَوَاقِعٌ (7)"));
        altorExes.add(new AltorEx("إن عذاب ربك -أيها الرسول- بالكفار لَواقع."));
        altorExes.add(new AltorEx("مَا لَهُ مِنْ دَافِعٍ (8)"));
        altorExes.add(new AltorEx("ليس له مِن مانع يمنعه حين وقوعه."));
        altorExes.add(new AltorEx("يَوْمَ تَمُورُ السَّمَاءُ مَوْرًا (9)"));
        altorExes.add(new AltorEx("يوم تتحرك السماء فيختلُّ نظامها وتضطرب أجزاؤها، وذلك عند نهاية الحياة الدنيا."));
        altorExes.add(new AltorEx("وَتَسِيرُ الْجِبَالُ سَيْرًا (10)"));
        altorExes.add(new AltorEx("وتزول الجبال عن أماكنها، وتسير كسير السحاب."));
        altorExes.add(new AltorEx("فَوَيْلٌ يَوْمَئِذٍ لِلْمُكَذِّبِينَ (11)"));
        altorExes.add(new AltorEx("فهلاك في هذا اليوم واقع بالمكذبين."));
        altorExes.add(new AltorEx("الَّذِينَ هُمْ فِي خَوْضٍ يَلْعَبُونَ (12)"));
        altorExes.add(new AltorEx("الذين هم في خوض بالباطل يلعبون به، ويتخذون دينهم هزوًا ولعبًا."));
        altorExes.add(new AltorEx("يَوْمَ يُدَعُّونَ إِلَى نَارِ جَهَنَّمَ دَعًّا (13)"));
        altorExes.add(new AltorEx("يوم يُدْفَع هؤلاء المكذبون دفعًا بعنف ومَهانة إلى نار جهنم."));
        altorExes.add(new AltorEx("هَذِهِ النَّارُ الَّتِي كُنْتُمْ بِهَا تُكَذِّبُونَ (14)"));
        altorExes.add(new AltorEx("ويقال توبيخًا لهم: هذه هي النار التي كنتم بها تكذِّبون."));
        altorExes.add(new AltorEx("أَفَسِحْرٌ هَذَا أَمْ أَنْتُمْ لَا تُبْصِرُونَ (15)"));
        altorExes.add(new AltorEx("أفسحر ما تشاهدونه من العذاب أم أنتم لا تنظرون؟"));
        altorExes.add(new AltorEx("اصْلَوْهَا فَاصْبِرُوا أَوْ لَا تَصْبِرُوا سَوَاءٌ عَلَيْكُمْ إِنَّمَا تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ (16)"));
        altorExes.add(new AltorEx("ذوقوا حرَّ هذه النار، فاصبروا على ألمها وشدتها، أو لا تصبروا على ذلك، فلن يُخَفَّف عنكم العذاب، ولن تخرجوا منها، سواء عليكم صبرتم أم لم تصبروا، إنما تُجزون ما كنتم تعملون في الدنيا."));
        altorExes.add(new AltorEx("إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَعِيمٍ (17)"));
        altorExes.add(new AltorEx("إن المتقين في جنات ونعيم عظيم."));
        altorExes.add(new AltorEx("فَاكِهِينَ بِمَا آتَاهُمْ رَبُّهُمْ وَوَقَاهُمْ رَبُّهُمْ عَذَابَ الْجَحِيمِ (18)"));
        altorExes.add(new AltorEx("يتفكهون بما آتاهم الله من النعيم من أصناف الملاذِّ المختلفة، ونجَّاهم الله من عذاب النار."));
        altorExes.add(new AltorEx("كُلُوا وَاشْرَبُوا هَنِيئًا بِمَا كُنْتُمْ تَعْمَلُونَ (19)"));
        altorExes.add(new AltorEx("كلوا طعامًا هنيئًا، واشربوا شرابًا سائغًا؛ جزاء بما عملتم من أعمال صالحة في الدنيا."));
        altorExes.add(new AltorEx("مُتَّكِئِينَ عَلَى سُرُرٍ مَصْفُوفَةٍ وَزَوَّجْنَاهُمْ بِحُورٍ عِينٍ (20)"));
        altorExes.add(new AltorEx("وهم متكئون على سرر متقابلة، وزوَّجناهم بنساء بيض واسعات العيون حسانهنَّ."));
        altorExes.add(new AltorEx("وَالَّذِينَ آمَنُوا وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِإِيمَانٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَا أَلَتْنَاهُمْ مِنْ عَمَلِهِمْ مِنْ شَيْءٍ كُلُّ امْرِئٍ بِمَا كَسَبَ رَهِينٌ (21)"));
        altorExes.add(new AltorEx("والذين آمنوا واتبعتهم ذريتهم في الإيمان، وألحقنا بهم ذريتهم في منزلتهم في الجنة، وإن لم يبلغوا عمل آبائهم; لتَقَرَّ أعين الآباء بالأبناء عندهم في منازلهم، فيُجْمَع بينهم على أحسن الأحوال، وما نقصناهم شيئًا من ثواب أعمالهم. كل إنسان مرهون بعمله، لا يحمل ذنب غيره من الناس."));
        altorExes.add(new AltorEx("وَأَمْدَدْنَاهُمْ بِفَاكِهَةٍ وَلَحْمٍ مِمَّا يَشْتَهُونَ (22)"));
        altorExes.add(new AltorEx("وزدناهم على ما ذُكر من النعيم فواكه ولحومًا مما يستطاب ويُشتهى."));
        altorExes.add(new AltorEx("يَتَنَازَعُونَ فِيهَا كَأْسًا لَا لَغْوٌ فِيهَا وَلَا تَأْثِيمٌ (23)"));
        altorExes.add(new AltorEx("ومن هذا النعيم أنهم يتعاطَوْن في الجنة كأسًا من الخمر، يناول أحدهم صاحبه؛ ليتم بذلك سرورهم، وهذا الشراب مخالف لخمر الدنيا، فلا يزول به عقل صاحبه، ولا يحصل بسببه لغو، ولا كلام فيه إثم أو معصية."));
        altorExes.add(new AltorEx("وَيَطُوفُ عَلَيْهِمْ غِلْمَانٌ لَهُمْ كَأَنَّهُمْ لُؤْلُؤٌ مَكْنُونٌ (24)"));
        altorExes.add(new AltorEx("ويطوف عليهم غلمان مُعَدُّون لخدمتهم، كأنهم في الصفاء والبياض والتناسق لؤلؤ مصون في أصدافه."));
        altorExes.add(new AltorEx("وَأَقْبَلَ بَعْضُهُمْ عَلَى بَعْضٍ يَتَسَاءَلُونَ (25)"));
        altorExes.add(new AltorEx("وأقبل أهل الجنة، يسأل بعضهم بعضًا عن عظيم ما هم فيه وسببه."));
        altorExes.add(new AltorEx("قَالُوا إِنَّا كُنَّا قَبْلُ فِي أَهْلِنَا مُشْفِقِينَ (26)"));
        altorExes.add(new AltorEx("قالوا: إنا كنا قبل في الدنيا -ونحن بين أهلينا- خائفين ربنا، مشفقين من عذابه وعقابه يوم القيامة."));
        altorExes.add(new AltorEx("فَمَنَّ اللَّهُ عَلَيْنَا وَوَقَانَا عَذَابَ السَّمُومِ (27)"));
        altorExes.add(new AltorEx("فمنَّ الله علينا بالهداية والتوفيق، ووقانا عذاب سموم جهنم، وهو نارها وحرارتها."));
        altorExes.add(new AltorEx("إِنَّا كُنَّا مِنْ قَبْلُ نَدْعُوهُ إِنَّهُ هُوَ الْبَرُّ الرَّحِيمُ (28)"));
        altorExes.add(new AltorEx("إنا كنا من قبلُ نضرع إليه وحده لا نشرك معه غيره أن يقينا عذاب السَّموم ويوصلنا إلى النعيم، فاستجاب لنا وأعطانا سؤالنا، إنه هو البَرُّ الرحيم. فمن بِره ورحمته إيانا أنالنا رضاه والجنة، ووقانا مِن سخطه والنار."));
        altorExes.add(new AltorEx("فَذَكِّرْ فَمَا أَنْتَ بِنِعْمَتِ رَبِّكَ بِكَاهِنٍ وَلَا مَجْنُونٍ (29)"));
        altorExes.add(new AltorEx("فذكِّر -أيها الرسول- مَن أُرسلت إليهم بالقرآن، فما أنت بإنعام الله عليك بالنبوة ورجاحة العقل بكاهن يخبر بالغيب دون علم، ولا مجنون لا يعقل ما يقول كما يَدَّعون."));
        altorExes.add(new AltorEx("أَمْ يَقُولُونَ شَاعِرٌ نَتَرَبَّصُ بِهِ رَيْبَ الْمَنُونِ (30)"));
        altorExes.add(new AltorEx("أم يقول المشركون لك -أيها الرسول-: هو شاعر ننتظر به نزول الموت؟"));
        altorExes.add(new AltorEx("قُلْ تَرَبَّصُوا فَإِنِّي مَعَكُمْ مِنَ الْمُتَرَبِّصِينَ (31)"));
        altorExes.add(new AltorEx("قل لهم: انتظروا موتي فإني معكم من المنتظرين بكم العذاب، وسترون لمن تكون العاقبة."));
        altorExes.add(new AltorEx("أَمْ تَأْمُرُهُمْ أَحْلَامُهُمْ بِهَذَا أَمْ هُمْ قَوْمٌ طَاغُونَ (32)"));
        altorExes.add(new AltorEx("بل أتأمر هؤلاء المكذبين عقولهم بهذا القول المتناقض؟ ذلك أن صفات الكهانة والشعر والجنون لا يمكن اجتماعها في آن واحد، بل هم قوم متجاوزون الحدَّ في الطغيان."));
        altorExes.add(new AltorEx("أَمْ يَقُولُونَ تَقَوَّلَهُ بَلْ لَا يُؤْمِنُونَ (33)"));
        altorExes.add(new AltorEx("بل أيقول هؤلاء المشركون، اختلق محمد القرآن من تلقاء نفسه؟ بل هم لا يؤمنون، فلو آمنوا لم يقولوا ما قالوه."));
        altorExes.add(new AltorEx("فَلْيَأْتُوا بِحَدِيثٍ مِثْلِهِ إِنْ كَانُوا صَادِقِينَ (34)"));
        altorExes.add(new AltorEx("فليأتوا بكلام مثل القرآن، إن كانوا صادقين -في زعمهم- أن محمدًا اختلقه."));
        altorExes.add(new AltorEx("أَمْ خُلِقُوا مِنْ غَيْرِ شَيْءٍ أَمْ هُمُ الْخَالِقُونَ (35)"));
        altorExes.add(new AltorEx("أخُلِق هؤلاء المشركون من غير خالق لهم وموجد، أم هم الخالقون لأنفسهم؟ وكلا الأمرين باطل ومستحيل. وبهذا يتعيَّن أن الله سبحانه هو الذي خلقهم، وهو وحده الذي لا تنبغي العبادة ولا تصلح إلا له."));
        altorExes.add(new AltorEx("أَمْ خَلَقُوا السَّمَاوَاتِ وَالْأَرْضَ بَلْ لَا يُوقِنُونَ (36)"));
        altorExes.add(new AltorEx("أم خَلَقوا السموات والأرض على هذا الصنع البديع؟ بل هم لا يوقنون بعذاب الله، فهم مشركون."));
        altorExes.add(new AltorEx("أَمْ عِنْدَهُمْ خَزَائِنُ رَبِّكَ أَمْ هُمُ الْمُصَيْطِرُونَ (37)"));
        altorExes.add(new AltorEx("أم عندهم خزائن ربك يتصرفون فيها، أم هم الجبارون المتسلطون على خلق الله بالقهر والغلبة؟ ليس الأمر كذلك، بل هم العاجزون الضعفاء."));
        altorExes.add(new AltorEx("أَمْ لَهُمْ سُلَّمٌ يَسْتَمِعُونَ فِيهِ فَلْيَأْتِ مُسْتَمِعُهُمْ بِسُلْطَانٍ مُبِينٍ (38)"));
        altorExes.add(new AltorEx("أم لهم مصعد إلى السماء يستمعون فيه الوحي بأن الذي هم عليه حق؟ فليأت مَن يزعم أنه استمع ذلك بحجة بينة تصدِّق دعواه."));
        altorExes.add(new AltorEx("أَمْ لَهُ الْبَنَاتُ وَلَكُمُ الْبَنُونَ (39)"));
        altorExes.add(new AltorEx("ألِلهِ سبحانه البنات ولكم البنون كما تزعمون افتراء وكذبًا؟"));
        altorExes.add(new AltorEx("أَمْ تَسْأَلُهُمْ أَجْرًا فَهُمْ مِنْ مَغْرَمٍ مُثْقَلُونَ (40)"));
        altorExes.add(new AltorEx("بل أتسأل -أيها الرسول- هؤلاء المشركون أجرًا على تبليغ الرسالة، فهم في جهد ومشقة من التزام غرامة تطلبها منهم؟"));
        altorExes.add(new AltorEx("أَمْ عِنْدَهُمُ الْغَيْبُ فَهُمْ يَكْتُبُونَ (41)"));
        altorExes.add(new AltorEx("أم عندهم علم الغيب فهم يكتبونه للناس ويخبرونهم به؟ ليس الأمر كذلك; فإنه لا يعلم الغيب في السموات والأرض إلا الله."));
        altorExes.add(new AltorEx("أَمْ يُرِيدُونَ كَيْدًا فَالَّذِينَ كَفَرُوا هُمُ الْمَكِيدُونَ (42)"));
        altorExes.add(new AltorEx("بل يريدون برسول الله وبالمؤمنين مكرًا، فالذين كفروا يرجع كيدهم ومكرهم على أنفسهم."));
        altorExes.add(new AltorEx("أَمْ لَهُمْ إِلَهٌ غَيْرُ اللَّهِ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ (43)"));
        altorExes.add(new AltorEx("أم لهم معبود يستحق العبادة غير الله؟ تنزَّه وتعالى عما يشركون، فليس له شريك فى الملك، ولا شريك في الوحدانية والعبادة."));
        altorExes.add(new AltorEx("وَإِنْ يَرَوْا كِسْفًا مِنَ السَّمَاءِ سَاقِطًا يَقُولُوا سَحَابٌ مَرْكُومٌ (44)"));
        altorExes.add(new AltorEx("وإن ير هؤلاء المشركون قطعًا من السماء ساقطًا عليهم عذابًا لهم لم ينتقلوا عما هم عليه من التكذيب، ولقالوا: هذا سحاب متراكم بعضه فوق بعض."));
        altorExes.add(new AltorEx("فَذَرْهُمْ حَتَّى يُلَاقُوا يَوْمَهُمُ الَّذِي فِيهِ يُصْعَقُونَ (45)"));
        altorExes.add(new AltorEx("فدع -أيها الرسول- هؤلاء المشركين حتى يلاقوا يومهم الذي فيه يُهْلكون، وهو يوم القيامة."));
        altorExes.add(new AltorEx("يَوْمَ لَا يُغْنِي عَنْهُمْ كَيْدُهُمْ شَيْئًا وَلَا هُمْ يُنْصَرُونَ (46)"));
        altorExes.add(new AltorEx("وفي ذلك اليوم لا يَدْفع عنهم كيدهم من عذاب الله شيئًا، ولا ينصرهم ناصر من عذاب الله."));
        altorExes.add(new AltorEx("وَإِنَّ لِلَّذِينَ ظَلَمُوا عَذَابًا دُونَ ذَلِكَ وَلَكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ (47)"));
        altorExes.add(new AltorEx("وإن لهؤلاء الظلمة عذابًا يلقونه في الدنيا قبل عذاب يوم القيامة من القتل والسبي وعذاب البرزخ وغير ذلك، ولكن أكثرهم لا يعلمون ذلك."));
        altorExes.add(new AltorEx("وَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ (48)"));
        altorExes.add(new AltorEx("واصبر -أيها الرسول- لحكم ربك وأمره فيما حَمَّلك من الرسالة، وعلى ما يلحقك من أذى قومك، فإنك بمرأى منا وحفظ واعتناء، وسبِّح بحمد ربك حين تقوم إلى الصلاة، وحين تقوم من نومك."));
        altorExes.add(new AltorEx("وَمِنَ اللَّيْلِ فَسَبِّحْهُ وَإِدْبَارَ النُّجُومِ (49)"));
        altorExes.add(new AltorEx("ومن الليل فسبِّح بحمد ربك وعظِّمه، وصلِّ له، وافعل ذلك عند صلاة الصبح وقت إدبار النجوم.\n" +
                "وفي هذه الآية إثبات لصفة العينين لله تعالى بما يليق به، دون تشبيه بخلقه أو تكييف لذاته، سبحانه وبحمده، كما ثبت ذلك بالسنة، وأجمع عليه سلف الأمة، واللفظ ورد هنا بصيغة الجمع للتعظيم.\n"));


        quran_explanation_52_adapter = new quran_explanation_52_adapter(altorExes ,QuranExplanation_52Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_52);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_52Activity.this));
        recyclerView.setAdapter(quran_explanation_52_adapter);


    }

}