package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_13Activity extends AppCompatActivity {

    ArrayList<AlraadEx> alraadExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_13_adapter quran_explanation_13_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_13);

        alraadExes.add(new AlraadEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم"));
        alraadExes.add(new AlraadEx("المر تِلْكَ آيَاتُ الْكِتَابِ وَالَّذِي أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ الْحَقُّ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ (1)"));
        alraadExes.add(new AlraadEx("(المر) سبق الكلام على الحروف المقطَّعة في أول سورة البقرة.\n" +
                "هذه آيات القرآن الرفيعة القدر، وهذا القرآن المنزل عليك -أيها الرسول- هو الحق، لا كما يقول المشركون: إنك تأتي به مِن عند نفسك، ومع هذا فأكثر الناس لا يصدِّقون به ولا يعملون.\n"));
        alraadExes.add(new AlraadEx("اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ثُمَّ اسْتَوَى عَلَى الْعَرْشِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِي لِأَجَلٍ مُسَمًّى يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ لَعَلَّكُمْ بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ (2)"));
        alraadExes.add(new AlraadEx("الله تعالى هو الذي رفع السموات السبع بقدرته من غير عمد كما ترونها، ثم استوى -أي علا وارتفع- على العرش استواء يليق بجلاله وعظمته، وذلَّل الشمس والقمر لمنافع العباد، كلٌّ منهما يدور في فلكه إلى يوم القيامة. يدبِّر سبحانه أمور الدنيا والآخرة، يوضح لكم الآيات الدالة على قدرته وأنه لا إله إلا هو; لتوقنوا بالله والمعاد إليه، فتصدقوا بوعده ووعيده وتُخْلصوا العبادة له وحده."));
        alraadExes.add(new AlraadEx("وَهُوَ الَّذِي مَدَّ الْأَرْضَ وَجَعَلَ فِيهَا رَوَاسِيَ وَأَنْهَارًا وَمِنْ كُلِّ الثَّمَرَاتِ جَعَلَ فِيهَا زَوْجَيْنِ اثْنَيْنِ يُغْشِي اللَّيْلَ النَّهَارَ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ (3)"));
        alraadExes.add(new AlraadEx("وهو سبحانه الذي جعل الأرض متسعة ممتدة، وهيأها لمعاشكم، وجعل فيها جبالا تُثبِّتُها وأنهارًا لشربكم ومنافعكم، وجعل فيها من كل الثمرات صنفين اثنين، فكان منها الأبيض والأسود والحلو والحامض، وجعل الليل يغطي النهار بظلمته، إن في ذلك كله لَعظات لقوم يتفكرون فيها، فيتعظون."));
        alraadExes.add(new AlraadEx("وَفِي الْأَرْضِ قِطَعٌ مُتَجَاوِرَاتٌ وَجَنَّاتٌ مِنْ أَعْنَابٍ وَزَرْعٌ وَنَخِيلٌ صِنْوَانٌ وَغَيْرُ صِنْوَانٍ يُسْقَى بِمَاءٍ وَاحِدٍ وَنُفَضِّلُ بَعْضَهَا عَلَى بَعْضٍ فِي الْأُكُلِ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ (4)"));
        alraadExes.add(new AlraadEx("وفي الأرض قطع يجاور بعضها بعضًا، منها ما هو طيِّب يُنبتُ ما ينفع الناس، ومنها سَبِخة مِلْحة لا تُنبت شيئًا، وفي الأرض الطيبة بساتين من أعناب، وجعل فيها زروعًا مختلفة ونخيلا مجتمعًا في منبت واحد، وغير مجتمع فيه، كل ذلك في تربة واحدة، ويشرب من ماء واحد، ولكنه يختلف في الثمار والحجم والطعم وغير ذلك، فهذا حلو وهذا حامض، وبعضها أفضل من بعض في الأكل، إن في ذلك لَعلامات لمن كان له قلب يعقل عن الله تعالى أمره ونهيه."));
        alraadExes.add(new AlraadEx("وَإِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ أَإِذَا كُنَّا تُرَابًا أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ أُولَئِكَ الَّذِينَ كَفَرُوا بِرَبِّهِمْ وَأُولَئِكَ الْأَغْلَالُ فِي أَعْنَاقِهِمْ وَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ (5)"));
        alraadExes.add(new AlraadEx("وإن تعجب -أيها الرسول- من عدم إيمانهم بعد هذه الأدلة فالعجب الأشدُّ من قولهم: أإذا متنا وكنا ترابا نُبعث من جديد؟ أولئك هم الجاحدون بربهم الذي أوجدهم من العدم، وأولئك تكون السلاسل من النار في أعناقهم يوم القيامة، وأولئك يدخلون النار، ولا يخرجون منها أبدًا."));
        alraadExes.add(new AlraadEx("وَيَسْتَعْجِلُونَكَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ وَقَدْ خَلَتْ مِنْ قَبْلِهِمُ الْمَثُلَاتُ وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِلنَّاسِ عَلَى ظُلْمِهِمْ وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ (6)"));
        alraadExes.add(new AlraadEx("ويستعجلك المكذِّبون بالعقوبة التي لم أعاجلهم بها قبل الإيمان الذي يرجى به الأمان والحسنات، وقد مضت عقوبات المكذبين مِن قبلهم، فكيف لا يعتبرون بهم؟ وإن ربك -أيها الرسول- لَذو مغفرة لذنوبِ مَن تاب مِن ذنوبه من الناس على ظلمهم، يفتح لهم باب المغفرة، ويدعوهم إليها، وهم يظلمون أنفسهم بعصيانهم ربهم، وإن ربك لشديد العقاب على مَن أصرَّ على الكفر والضلال ومعصية الله."));
        alraadExes.add(new AlraadEx("وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ إِنَّمَا أَنْتَ مُنْذِرٌ وَلِكُلِّ قَوْمٍ هَادٍ (7)"));
        alraadExes.add(new AlraadEx("ويقول كفار «مكة» : هلا جاءته معجزة محسوسة كعصا موسى وناقة صالح، وليس ذلك بيدك -أيها الرسول- فما أنت إلا مبلِّغ لهم، ومخوِّف مِن بأس الله. ولكل أمة رسول يرشدهم إلى الله تعالى."));
        alraadExes.add(new AlraadEx("اللَّهُ يَعْلَمُ مَا تَحْمِلُ كُلُّ أُنْثَى وَمَا تَغِيضُ الْأَرْحَامُ وَمَا تَزْدَادُ وَكُلُّ شَيْءٍ عِنْدَهُ بِمِقْدَارٍ (8)"));
        alraadExes.add(new AlraadEx("الله تعالى يعلم ما تحمل كلُّ أنثى في بطنها، أذكر هو أم أنثى؟ وشقي هو أم سعيد؟ ويعلم ما تنقصه الأرحام، فيسقط أو يولد قبل تسعة أشهر، وما يزيد حمله عليها. وكل شيء مقدَّر عند الله بمقدار من النقصان أو الزيادة لا يتجاوزه."));
        alraadExes.add(new AlraadEx("عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْكَبِيرُ الْمُتَعَالِ (9)"));
        alraadExes.add(new AlraadEx("الله عالم بما خفي عن الأبصار، وبما هو مشاهَد، الكبير في ذاته وأسمائه وصفاته، المتعالي على جميع خلقه بذاته وقدرته وقهره."));
        alraadExes.add(new AlraadEx("سَوَاءٌ مِنْكُمْ مَنْ أَسَرَّ الْقَوْلَ وَمَنْ جَهَرَ بِهِ وَمَنْ هُوَ مُسْتَخْفٍ بِاللَّيْلِ وَسَارِبٌ بِالنَّهَارِ (10)"));
        alraadExes.add(new AlraadEx("يستوي في علمه تعالى مَن أخفى القول منكم ومَن جهر به، ويستوي عنده مَن استتر بأعماله في ظلمة الليل، ومن جهر بها في وضح النهار."));
        alraadExes.add(new AlraadEx("لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّى يُغَيِّرُوا مَا بِأَنْفُسِهِمْ وَإِذَا أَرَادَ اللَّهُ بِقَوْمٍ سُوءًا فَلَا مَرَدَّ لَهُ وَمَا لَهُمْ مِنْ دُونِهِ مِنْ وَالٍ (11)"));
        alraadExes.add(new AlraadEx("لله تعالى ملائكة يتعاقبون على الإنسان من بين يديه ومن خلفه، يحفظونه بأمر الله ويحصون ما يصدر عنه من خير أو شر. إن الله سبحانه وتعالى لا يغيِّر نعمة أنعمها على قوم إلا إذا غيَّروا ما أمرهم به فعصوه. وإذا أراد الله بجماعةٍ بلاءً فلا مفرَّ منه، وليس لهم مِن دون الله مِن وال يتولى أمورهم، فيجلب لهم المحبوب، ويدفع عنهم المكروه."));
        alraadExes.add(new AlraadEx("هُوَ الَّذِي يُرِيكُمُ الْبَرْقَ خَوْفًا وَطَمَعًا وَيُنْشِئُ السَّحَابَ الثِّقَالَ (12)"));
        alraadExes.add(new AlraadEx("هو الذي يريكم من آياته البرق -وهو النور اللامع من خلال السحاب- فتخافون أن تنزل عليكم منه الصواعق المحرقة، وتطمعون أن ينزل معه المطر، وبقدرته سبحانه يوجد السحاب المحمَّل بالماء الكثير لمنافعكم."));
        alraadExes.add(new AlraadEx("وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ وَيُرْسِلُ الصَّوَاعِقَ فَيُصِيبُ بِهَا مَنْ يَشَاءُ وَهُمْ يُجَادِلُونَ فِي اللَّهِ وَهُوَ شَدِيدُ الْمِحَالِ (13)"));
        alraadExes.add(new AlraadEx("ويسبِّح الرعد بحمد الله تسبيحًا يدل على خضوعه لربه، وتنزِّه الملائكة ربها مِن خوفها من الله، ويرسل الله الصواعق المهلكة فيهلك بها مَن يشاء من خلقه، والكفار يجادلون في وحدانية الله وقدرته على البعث، وهو شديد الحول والقوة والبطش بمن عصاه."));
        alraadExes.add(new AlraadEx("لَهُ دَعْوَةُ الْحَقِّ وَالَّذِينَ يَدْعُونَ مِنْ دُونِهِ لَا يَسْتَجِيبُونَ لَهُمْ بِشَيْءٍ إِلَّا كَبَاسِطِ كَفَّيْهِ إِلَى الْمَاءِ لِيَبْلُغَ فَاهُ وَمَا هُوَ بِبَالِغِهِ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ (14)"));
        alraadExes.add(new AlraadEx("لله سبحانه وتعالى وحده دعوة التوحيد (لا إله إلا الله) ، فلا يُعبد ولا يُدعى إلا هو، والآلهة التي يعبدونها من دون الله لا تجيب دعاء مَن دعاها، وحالهم معها كحال عطشان يمد يده إلى الماء من بعيد; ليصل إلى فمه فلا يصل إليه، وما سؤال الكافرين لها إلا غاية في البعد عن الصواب لإشراكهم بالله غيره."));
        alraadExes.add(new AlraadEx("وَلِلَّهِ يَسْجُدُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُمْ بِالْغُدُوِّ وَالْآصَالِ (15)"));
        alraadExes.add(new AlraadEx("ولله وحده يسجد خاضعًا منقادًا كُلُّ مَن في السموات والأرض، فيسجد ويخضع له المؤمنون طوعًا واختيارًا، ويخضع له الكافرون رغمًا عنهم; لأنهم يستكبرون عن عبادته، وحالهم وفطرتهم تكذِّبهم في ذلك، وتنقاد لعظته الله ظلال المخلوقات، فتتحرك بإرادته أول النهار وآخره."));
        alraadExes.add(new AlraadEx("قُلْ مَنْ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ قُلِ اللَّهُ قُلْ أَفَاتَّخَذْتُمْ مِنْ دُونِهِ أَوْلِيَاءَ لَا يَمْلِكُونَ لِأَنْفُسِهِمْ نَفْعًا وَلَا ضَرًّا قُلْ هَلْ يَسْتَوِي الْأَعْمَى وَالْبَصِيرُ أَمْ هَلْ تَسْتَوِي الظُّلُمَاتُ وَالنُّورُ أَمْ جَعَلُوا لِلَّهِ شُرَكَاءَ خَلَقُوا كَخَلْقِهِ فَتَشَابَهَ الْخَلْقُ عَلَيْهِمْ قُلِ اللَّهُ خَالِقُ كُلِّ شَيْءٍ وَهُوَ الْوَاحِدُ الْقَهَّارُ (16)"));
        alraadExes.add(new AlraadEx("قل -أيها الرسول- للمشركين: مَن خالق السَّموات والأرض ومدبِّرهما؟ قل: الله هو الخالق المدبر لهما، وأنتم تقرون بذلك، ثم قل لهم ملزمًا بالحجة: أجعلتم غيره معبودين لكم، وهم لا يَقْدرون على نفع أنفسهم أو ضرها فضلا عن نفعكم أو ضركم، وتركتم عبادة مالكها؟ قل لهم -أيها الرسول-: هل يستوي عندكم الكافر -وهو كالأعمى- والمؤمن وهو كالبصير؟ أم هل يستوي عندكم الكفر -وهو كالظلمات- والإيمان -وهو كالنور؟ أم أن أولياءهم الذين جعلوهم شركاء لله يخلقون مثل خَلْقه، فتشابه عليهم خَلْق الشركاء بخلق الله، فاعتقدوا استحقاقهم للعبادة؟ قل لهم -أيها الرسول-: الله تعالى خالق كل كائن من العدم، وهو المستحق للعبادة وحده، وهو الواحد القهار الذي يستحق الألوهية والعبادة، لا الأصنام والأوثان التي لا تضرُّ ولا تنفع."));
        alraadExes.add(new AlraadEx("أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا فَاحْتَمَلَ السَّيْلُ زَبَدًا رَابِيًا وَمِمَّا يُوقِدُونَ عَلَيْهِ فِي النَّارِ ابْتِغَاءَ حِلْيَةٍ أَوْ مَتَاعٍ زَبَدٌ مِثْلُهُ كَذَلِكَ يَضْرِبُ اللَّهُ الْحَقَّ وَالْبَاطِلَ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً وَأَمَّا مَا يَنْفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ كَذَلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ (17)"));
        alraadExes.add(new AlraadEx("ثم ضرب الله سبحانه مثلا للحق والباطل بماء أنزله من السماء، فجَرَت به أودية الأرض بقدر صغرها وكبرها، فحمل السيل غثاء طافيًا فوقه لا نفع فيه. وضرب مثلا آخر: هو المعادن يوقِدون عليها النار لصهرها طلبًا للزينة كما في الذهب والفضة، أو طلبًا لمنافع ينتفعون بها كما في النحاس، فيخرج منها خبثها مما لا فائدة فيه كالذي كان مع الماء، بمثل هذا يضرب الله المثل للحق والباطل: فالباطل كغثاء الماء يتلاشى أو يُرْمى إذ لا فائدة منه، والحق كالماء الصافي، والمعادن النقية تبقى في الأرض للانتفاع بها، كما بيَّن لكم هذه الأمثال، كذلك يضربها للناس; ليتضح الحق من الباطل والهدى من الضلال."));
        alraadExes.add(new AlraadEx("لِلَّذِينَ اسْتَجَابُوا لِرَبِّهِمُ الْحُسْنَى وَالَّذِينَ لَمْ يَسْتَجِيبُوا لَهُ لَوْ أَنَّ لَهُمْ مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ أُولَئِكَ لَهُمْ سُوءُ الْحِسَابِ وَمَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمِهَادُ (18)"));
        alraadExes.add(new AlraadEx("للمؤمنين الذين أطاعوا الله ورسوله الجنة، والذين لم يطيعوا وكفروا به لهم النار، ولو كانوا يملكون كل ما في الأرض وضِعْفه معه لبذلوه فداء لأنفسهم من عذاب الله يوم القيامة، ولن يُتَقبل منهم، أولئك يحاسَبون على كل ما أسلفوه من عمل سيِّئ، ومسكنهم ومقامهم جهنم تكون لهم فراشًا، وبئس الفراش الذي مهدوه لأنفسهم."));
        alraadExes.add(new AlraadEx("أَفَمَنْ يَعْلَمُ أَنَّمَا أُنْزِلَ إِلَيْكَ مِنْ رَبِّكَ الْحَقُّ كَمَنْ هُوَ أَعْمَى إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ (19)"));
        alraadExes.add(new AlraadEx("هل الذي يعلم أن ما جاءك -أيها الرسول- من عند الله هو الحق فيؤمن به، كالأعمى عن الحق الذي لم يؤمن؟ إنما يتعظ أصحاب العقول السليمة."));
        alraadExes.add(new AlraadEx("الَّذِينَ يُوفُونَ بِعَهْدِ اللَّهِ وَلَا يَنْقُضُونَ الْمِيثَاقَ (20)"));
        alraadExes.add(new AlraadEx("الذين يوفون بعهد الله الذي أمرهم به، ولا ينكثون العهد المؤكد الذي عاهدوا الله عليه."));
        alraadExes.add(new AlraadEx("وَالَّذِينَ يَصِلُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوءَ الْحِسَابِ (21)"));
        alraadExes.add(new AlraadEx("وهم الذين يَصِلون ما أمرهم الله بوصله كالأرحام والمحتاجين، ويراقبون ربهم، ويخشون أن يحاسبهم على كل ذنوبهم، ولا يغفر لهم منها شيئًا."));
        alraadExes.add(new AlraadEx("وَالَّذِينَ صَبَرُوا ابْتِغَاءَ وَجْهِ رَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَنْفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ أُولَئِكَ لَهُمْ عُقْبَى الدَّارِ (22)"));
        alraadExes.add(new AlraadEx("وهم الذين صبروا على الأذى وعلى الطاعة، وعن المعصية طلبًا لرضا ربهم، وأدَّوا الصلاة على أتمِّ وجوهها، وأدَّوا من أموالهم زكاتهم المفروضة، والنفقات المستحبة في الخفاء والعلن، ويدفعون بالحسنة السيئة فتمحوها، أولئك الموصوفون بهذه الصفات لهم العاقبة المحمودة في الآخرة."));
        alraadExes.add(new AlraadEx("جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا وَمَنْ صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ وَالْمَلَائِكَةُ يَدْخُلُونَ عَلَيْهِمْ مِنْ كُلِّ بَابٍ (23)"));
        alraadExes.add(new AlraadEx("تلك العاقبة هي جنات عدن يقيمون فيها لا يزولون عنها، ومعهم الصالحون من الآباء والزوجات والذريات من الذكور والإناث، وتدخل الملائكة عليهم من كل باب; لتهنئتهم بدخول الجنة."));
        alraadExes.add(new AlraadEx("سَلَامٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ (24)"));
        alraadExes.add(new AlraadEx("تقول الملائكة لهم: سلام عليكم، تحية خاصة لكم، سَلِمْتم من كل سوء بسبب صبركم على طاعة الله، فنِعْمَ عاقبة الدار الجنة."));
        alraadExes.add(new AlraadEx("وَالَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ أُولَئِكَ لَهُمُ اللَّعْنَةُ وَلَهُمْ سُوءُ الدَّارِ (25)"));
        alraadExes.add(new AlraadEx("أما الأشقياء فقد وُصِفوا بضد صفات المؤمنين، فهم الذين لا يوفون بعهد الله بإفراده سبحانه بالعبادة بعد أن أكدوه على أنفسهم، وهم الذين يقطعون ما أمرهم الله بوصله مِن صلة الأرحام وغيرها، ويفسدون في الأرض بعمل المعاصي، أولئك الموصوفون بهذه الصفات القبيحة لهم الطرد من رحمة الله، ولهم ما يسوءهم من العذاب الشديد في الدار الآخرة."));
        alraadExes.add(new AlraadEx("اللَّهُ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ وَفَرِحُوا بِالْحَيَاةِ الدُّنْيَا وَمَا الْحَيَاةُ الدُّنْيَا فِي الْآخِرَةِ إِلَّا مَتَاعٌ (26)"));
        alraadExes.add(new AlraadEx("الله وحده يوسِّع الرزق لمن يشاء من عباده، ويضيِّق على مَن يشاء منهم، وفرح الكفار بالسَّعة في الحياة الدنيا، وما هذه الحياة الدنيا بالنسبة للآخرة إلا شيء قليل يتمتع به، سُرعان ما يزول."));
        alraadExes.add(new AlraadEx("وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنْزِلَ عَلَيْهِ آيَةٌ مِنْ رَبِّهِ قُلْ إِنَّ اللَّهَ يُضِلُّ مَنْ يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ أَنَابَ (27)"));
        alraadExes.add(new AlraadEx("ويقول الكفار عنادًا: هلا أُنزل على محمد معجزة محسوسة كمعجزة موسى وعيسى. قل لهم: إن الله يضل مَن يشاء من المعاندين عن الهداية ولا تنفعه المعجزات، ويهدي إلى دينه الحق مَن رجع إليه وطلب رضوانه."));
        alraadExes.add(new AlraadEx("الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ (28)"));
        alraadExes.add(new AlraadEx("ويهدي الذين تسكن قلوبهم بتوحيد الله وذكره فتطمئن، ألا بطاعة الله وذكره وثوابه تسكن القلوب وتستأنس."));
        alraadExes.add(new AlraadEx("الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ طُوبَى لَهُمْ وَحُسْنُ مَآبٍ (29)"));
        alraadExes.add(new AlraadEx("الذين صدَّقوا بالله ورسوله، وعملوا الأعمال الصالحات لهم فرح وقرة عين، وحال طيبة، ومرجع حسن إلى جنة الله ورضوانه."));
        alraadExes.add(new AlraadEx("كَذَلِكَ أَرْسَلْنَاكَ فِي أُمَّةٍ قَدْ خَلَتْ مِنْ قَبْلِهَا أُمَمٌ لِتَتْلُوَ عَلَيْهِمُ الَّذِي أَوْحَيْنَا إِلَيْكَ وَهُمْ يَكْفُرُونَ بِالرَّحْمَنِ قُلْ هُوَ رَبِّي لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ مَتَابِ (30)"));
        alraadExes.add(new AlraadEx("كما أرسلنا المرسلين قبلك أرسلناك -أيها الرسول- في أمة قد مضت مِن قبلها أمم المرسلين; لتتلو على هذه الأمة القرآن المنزل عليك، وحال قومك الجحود بوحدانية الرحمن، قل لهم -أيها الرسول-: الرحمن الذي لم تتخذوه إلهًا واحدًا هو ربي وحده لا معبود بحق سواه، عليه اعتمدت ووثقت، وإليه مرجعي وإنابتي."));
        alraadExes.add(new AlraadEx("وَلَوْ أَنَّ قُرْآنًا سُيِّرَتْ بِهِ الْجِبَالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ أَوْ كُلِّمَ بِهِ الْمَوْتَى بَلْ لِلَّهِ الْأَمْرُ جَمِيعًا أَفَلَمْ يَيْأَسِ الَّذِينَ آمَنُوا أَنْ لَوْ يَشَاءُ اللَّهُ لَهَدَى النَّاسَ جَمِيعًا وَلَا يَزَالُ الَّذِينَ كَفَرُوا تُصِيبُهُمْ بِمَا صَنَعُوا قَارِعَةٌ أَوْ تَحُلُّ قَرِيبًا مِنْ دَارِهِمْ حَتَّى يَأْتِيَ وَعْدُ اللَّهِ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ (31)"));
        alraadExes.add(new AlraadEx("يردُّ الله -تعالى- على الكافرين الذين طلبوا إنزال معجزات محسوسة على النبي صلى الله عليه وسلم فيقول لهم: ولو أن ثمة قرآنًا يقرأ، فتزول به الجبال عن أماكنها، أو تتشقق به الأرض أنهارًا، أو يحيا به الموتى وتُكَلَّم -كما طلبوا منك- لكان هذا القرآن هو المتصف بذلك دون غيره، ولما آمنوا به. بل لله وحده الأمر كله في المعجزات وغيرها. أفلم يعلم المؤمنون أن الله لو يشاء لآمن أهل الأرض كلهم من غير معجزة؟ ولا يزال الكفار تنزل بهم مصيبة بسبب كفرهم كالقتل والأسر في غزوات المسلمين، أو تنزل تلك المصيبة قريبًا من دارهم، حتى يأتي وعد الله بالنصر عليهم، إن الله لا يخلف الميعاد."));
        alraadExes.add(new AlraadEx("وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِنْ قَبْلِكَ فَأَمْلَيْتُ لِلَّذِينَ كَفَرُوا ثُمَّ أَخَذْتُهُمْ فَكَيْفَ كَانَ عِقَابِ (32)"));
        alraadExes.add(new AlraadEx("وإذا كانوا قد سخروا من دعوتك -أيها الرسول- فلقد سَخِرَتْ أمم من قبلك برسلهم، فلا تحزن فقد أمهلتُ الذين كفروا، ثم أخذتُهم بعقابي، وكان عقابًا شديدًا."));
        alraadExes.add(new AlraadEx("أَفَمَنْ هُوَ قَائِمٌ عَلَى كُلِّ نَفْسٍ بِمَا كَسَبَتْ وَجَعَلُوا لِلَّهِ شُرَكَاءَ قُلْ سَمُّوهُمْ أَمْ تُنَبِّئُونَهُ بِمَا لَا يَعْلَمُ فِي الْأَرْضِ أَمْ بِظَاهِرٍ مِنَ الْقَوْلِ بَلْ زُيِّنَ لِلَّذِينَ كَفَرُوا مَكْرُهُمْ وَصُدُّوا عَنِ السَّبِيلِ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ (33)"));
        alraadExes.add(new AlraadEx("أفمن هو قائم على كل نفس يُحصي عليها ما تعمل، أحق أن يعبد، أم هذه المخلوقات العاجزة؟ وهم -من جهلهم- جعلوا لله شركاء مِن خَلْقه يعبدونهم، قل لهم -أيها الرسول-: اذكروا أسماءهم وصفاتهم، ولن يجدوا من صفاتهم ما يجعلهم أهلا للعبادة، أم تخبرون الله بشركاء في أرضه لا يعلمهم، أم تسمونهم شركاء بظاهر من اللفظ من غير أن يكون لهم حقيقة. بل حسَّن الشيطان للكفار قولهم الباطل وصدَّهم عن سبيل الله. ومَن لم يوفِّقه الله لهدايته فليس له أحد يهديه، ويوفقه إلى الحق والرشاد."));
        alraadExes.add(new AlraadEx("لَهُمْ عَذَابٌ فِي الْحَيَاةِ الدُّنْيَا وَلَعَذَابُ الْآخِرَةِ أَشَقُّ وَمَا لَهُمْ مِنَ اللَّهِ مِنْ وَاقٍ (34)"));
        alraadExes.add(new AlraadEx("لهؤلاء الكفار الصادين عن سبيل الله عذاب شاق في الحياة الدنيا بالقتل والأسر والخزي، ولَعذابهم في الآخرة أثقل وأشد، وليس لهم مانع يمنعهم من عذاب الله."));
        alraadExes.add(new AlraadEx("مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ أُكُلُهَا دَائِمٌ وَظِلُّهَا تِلْكَ عُقْبَى الَّذِينَ اتَّقَوْا وَعُقْبَى الْكَافِرِينَ النَّارُ (35)"));
        alraadExes.add(new AlraadEx("صفة الجنة التي وعد الله بها الذين يخشونه أنها تجري من تحت أشجارها وقصورها الأنهار، ثمرها لا ينقطع، وظلها لا يزول ولا ينقص، تلك المثوبة بالجنة عاقبة الذين خافوا الله، فاجتنبوا معاصيه وأدَّوا فرائضه، وعاقبة الكافرين بالله النار."));
        alraadExes.add(new AlraadEx("وَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَفْرَحُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمِنَ الْأَحْزَابِ مَنْ يُنْكِرُ بَعْضَهُ قُلْ إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ وَلَا أُشْرِكَ بِهِ إِلَيْهِ أَدْعُو وَإِلَيْهِ مَآبِ (36)"));
        alraadExes.add(new AlraadEx("والذين أعطيناهم الكتاب من اليهود والنصارى مَن آمن منهم بك كعبد الله بن سلام والنجاشي، يستبشرون بالقرآن المنزل عليك لموافقته ما عندهم، ومن المتحزبين على الكفر ضدك، كالسَّيد والعاقب، أُسْقفَي «نجران» ، وكعب بن الأشرف، مَن ينكر بعض المنزل عليك، قل لهم: إنما أمرني الله أن أعبده وحده، ولا أشرك به شيئًا، إلى عبادته أدعو الناس، وإليه مرجعي ومآبي."));
        alraadExes.add(new AlraadEx("وَكَذَلِكَ أَنْزَلْنَاهُ حُكْمًا عَرَبِيًّا وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُمْ بَعْدَ مَا جَاءَكَ مِنَ الْعِلْمِ مَا لَكَ مِنَ اللَّهِ مِنْ وَلِيٍّ وَلَا وَاقٍ (37)"));
        alraadExes.add(new AlraadEx("وكما أنزلنا الكتب على الأنبياء بلسانهم أنزلنا إليك -أيها الرسول- القرآن بلغة العرب; لتحكم به، ولئن اتبعت أهواء المشركين في عبادة غير الله -بعد الحق الذي جاءك من الله- ليس لك ناصر ينصرك ويمنعك من عذابه."));
        alraadExes.add(new AlraadEx("وَلَقَدْ أَرْسَلْنَا رُسُلًا مِنْ قَبْلِكَ وَجَعَلْنَا لَهُمْ أَزْوَاجًا وَذُرِّيَّةً وَمَا كَانَ لِرَسُولٍ أَنْ يَأْتِيَ بِآيَةٍ إِلَّا بِإِذْنِ اللَّهِ لِكُلِّ أَجَلٍ كِتَابٌ (38)"));
        alraadExes.add(new AlraadEx("وإذا قالوا: ما لك -أيها الرسول- تتزوج النساء؟ فلقد بعثنا قبلك رسلا من البشر وجعلنا لهم أزواجًا وذرية، وإذا قالوا: لو كان رسولا لأتى بما طلبنا من المعجزات، فليس في وُسْع رسولٍ أن يأتي بمعجزةٍ أرادها قومه إلا بإذن الله. لكل أمر قضاه الله كتاب وأجل قد كتبه الله عنده، لا يتقدم ولا يتأخر."));
        alraadExes.add(new AlraadEx("يَمْحُو اللَّهُ مَا يَشَاءُ وَيُثْبِتُ وَعِنْدَهُ أُمُّ الْكِتَابِ (39)"));
        alraadExes.add(new AlraadEx("يمحو الله ما يشاء من الأحكام وغيرها، ويُبْقي ما يشاء منها لحكمة يعلمها، وعنده أمُّ الكتاب، وهو اللوح المحفوظ."));
        alraadExes.add(new AlraadEx("وَإِنْ مَا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيْكَ الْبَلَاغُ وَعَلَيْنَا الْحِسَابُ (40)"));
        alraadExes.add(new AlraadEx("وإن أريناك -أيها الرسول- بعض العقاب الذي توعَّدْنا به أعداءك من الخزي والنَّكال في الدنيا فذلك المعجَّل لهم، وإن توفيناك قبل أن ترى ذلك، فما عليك إلا تبليغ الدعوة، وعلينا الحساب والجزاء."));
        alraadExes.add(new AlraadEx("أَوَلَمْ يَرَوْا أَنَّا نَأْتِي الْأَرْضَ نَنْقُصُهَا مِنْ أَطْرَافِهَا وَاللَّهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهِ وَهُوَ سَرِيعُ الْحِسَابِ (41)"));
        alraadExes.add(new AlraadEx("أو لم يبصر هؤلاء الكفار أنا نأتي الأرض ننقصها من أطرافها، وذلك بفتح المسلمين بلاد المشركين وإلحاقها ببلاد المسلمين؟ والله سبحانه يحكم لا معقِّب لحكمه وقضائه، وهو سريع الحساب، فلا يستعجلوا بالعذاب; فإن كل آت قريب."));
        alraadExes.add(new AlraadEx("وَقَدْ مَكَرَ الَّذِينَ مِنْ قَبْلِهِمْ فَلِلَّهِ الْمَكْرُ جَمِيعًا يَعْلَمُ مَا تَكْسِبُ كُلُّ نَفْسٍ وَسَيَعْلَمُ الْكُفَّارُ لِمَنْ عُقْبَى الدَّارِ (42)"));
        alraadExes.add(new AlraadEx("ولقد دبَّر الذين من قبلهم المكايد لرسلهم، كما فعل هؤلاء معك، فلله المكر جميعًا، فيبطل مكرهم، ويعيده عليهم بالخيبة والندم، يعلم سبحانه ما تكسب كل نفس من خير أو شر فتجازى عليه. وسيعلم الكفار -إذا قدموا على ربهم- لمن تكون العاقبة المحمودة بعد هذه الدنيا؟ إنها لأتباع الرسل. وفي هذا تهديد ووعيد للكافرين."));
        alraadExes.add(new AlraadEx("وَيَقُولُ الَّذِينَ كَفَرُوا لَسْتَ مُرْسَلًا قُلْ كَفَى بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ وَمَنْ عِنْدَهُ عِلْمُ الْكِتَابِ (43)"));
        alraadExes.add(new AlraadEx("ويقول الذين كفروا لنبي الله: -يا محمد- ما أرسلك الله، قل لهم: كفى بالله شهيدًا بصدقي وكذبكم، وكَفَتْ شهادة مَن عنده علم الكتاب من اليهود والنصارى ممن آمن برسالتي، وما جئتُ به من عند الله، واتبع الحق فصرَّح بتلك الشهادة، ولم يكتمها."));

        quran_explanation_13_adapter = new quran_explanation_13_adapter(alraadExes ,QuranExplanation_13Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_13);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_13Activity.this));
        recyclerView.setAdapter(quran_explanation_13_adapter);


    }

}