package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_25Activity extends AppCompatActivity {

    ArrayList<AlforqanEx> alforqanExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_25_adapter quran_explanation_25_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_25);

        alforqanExes.add(new AlforqanEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"));
        alforqanExes.add(new AlforqanEx("تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَى عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا (1)"));
        alforqanExes.add(new AlforqanEx("عَظُمَتْ بركات الله، وكثرت خيراته، وكملت أوصافه سبحانه وتعالى الذي نزَّل القرآن الفارق بين الحق والباطل على عبده محمد صلى الله عليه وسلم؛ ليكون رسولا للإنس والجن، مخوِّفًا لهم من عذاب الله."));
        alforqanExes.add(new AlforqanEx("الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَلَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهُ تَقْدِيرًا (2)"));
        alforqanExes.add(new AlforqanEx("الذي له ملك السموات والأرض، ولم يتخذ ولدًا، ولم يكن له شريك في ملكه، وهو الذي خلق كل شيء، فسوَّاه على ما يناسبه من الخلق وَفْق ما تقتضيه حكمته دون نقص أو خلل."));
        alforqanExes.add(new AlforqanEx("وَاتَّخَذُوا مِنْ دُونِهِ آلِهَةً لَا يَخْلُقُونَ شَيْئًا وَهُمْ يُخْلَقُونَ وَلَا يَمْلِكُونَ لِأَنْفُسِهِمْ ضَرًّا وَلَا نَفْعًا وَلَا يَمْلِكُونَ مَوْتًا وَلَا حَيَاةً وَلَا نُشُورًا (3)"));
        alforqanExes.add(new AlforqanEx("واتخذ مشركو العرب معبودات من دون الله لا تستطيع خَلْق شيء، والله خلقها وخلقهم، ولا تملك لنفسها دَفْعَ ضر أو جلب نفع، ولا تستطيع إماتة حي أو إحياء ميت، أو بعث أحد من الأموات حيًا من قبره."));
        alforqanExes.add(new AlforqanEx("وَقَالَ الَّذِينَ كَفَرُوا إِنْ هَذَا إِلَّا إِفْكٌ افْتَرَاهُ وَأَعَانَهُ عَلَيْهِ قَوْمٌ آخَرُونَ فَقَدْ جَاءُوا ظُلْمًا وَزُورًا (4)"));
        alforqanExes.add(new AlforqanEx("وقال الكافرون بالله: ما هذا القرآن إلا كذب وبهتان اختلقه محمد، وأعانه على ذلك أناس آخرون، فقد ارتكبوا ظلمًا فظيعًا، وأتوا زورًا شنيعًا؛ فالقرآن ليس مما يمكن لبشر أن يختلقه."));
        alforqanExes.add(new AlforqanEx("وَقَالُوا أَسَاطِيرُ الْأَوَّلِينَ اكْتَتَبَهَا فَهِيَ تُمْلَى عَلَيْهِ بُكْرَةً وَأَصِيلًا (5) "));
        alforqanExes.add(new AlforqanEx("وقالوا عن القرآن: هو أحاديث الأولين المسطرة في كتبهم، استنسخها محمد، فهي تُقْرَأ عليه صباحًا ومساء."));
        alforqanExes.add(new AlforqanEx("قُلْ أَنْزَلَهُ الَّذِي يَعْلَمُ السِّرَّ فِي السَّمَاوَاتِ وَالْأَرْضِ إِنَّهُ كَانَ غَفُورًا رَحِيمًا (6)"));
        alforqanExes.add(new AlforqanEx("قل - أيها الرسول - لهؤلاء الكفار: إن الذي أنزل القرآن هو الله الذي أحاط علمه بما في السموات والأرض، إنه كان غفورًا لمن تاب من الذنوب والمعاصي، رحيمًا بهم حيث لم يعاجلهم بالعقوبة."));
        alforqanExes.add(new AlforqanEx("وَقَالُوا مَالِ هَذَا الرَّسُولِ يَأْكُلُ الطَّعَامَ وَيَمْشِي فِي الْأَسْوَاقِ لَوْلَا أُنْزِلَ إِلَيْهِ مَلَكٌ فَيَكُونَ مَعَهُ نَذِيرًا (7)"));
        alforqanExes.add(new AlforqanEx("وقال المشركون: ما لهذا الذي يزعم أنه رسول الله (يعنون محمدًا صلى الله عليه وسلم) يأكل الطعام مثلنا، ويمشي في الأسواق لطلب الرزق؟ فهلا أرسل الله معه مَلَكًا يشهد على صدقه."));
        alforqanExes.add(new AlforqanEx("أَوْ يُلْقَى إِلَيْهِ كَنْزٌ أَوْ تَكُونُ لَهُ جَنَّةٌ يَأْكُلُ مِنْهَا وَقَالَ الظَّالِمُونَ إِنْ تَتَّبِعُونَ إِلَّا رَجُلًا مَسْحُورًا (8)"));
        alforqanExes.add(new AlforqanEx("أو يهبط عليه من السماء كنز من مال، أو تكون له حديقة عظيمة يأكل من ثمرها، وقال هؤلاء الظالمون المكذبون: ما تتبعون أيها المؤمنون إلا رجلا به سحر غلب على عقله."));
        alforqanExes.add(new AlforqanEx("انْظُرْ كَيْفَ ضَرَبُوا لَكَ الْأَمْثَالَ فَضَلُّوا فَلَا يَسْتَطِيعُونَ سَبِيلًا (9)"));
        alforqanExes.add(new AlforqanEx("انظر - أيها الرسول - كيف قال المكذبون في حقك تلك الأقوال العجيبة التي تشبه -لغرابتها- الأمثال؛ ليتوصلوا إلى تكذيبك؟ فبَعُدوا بذلك عن الحق، فلا يجدون سبيلا إليه؛ ليصححوا ما قالوه فيك من الكذب والافتراء."));
        alforqanExes.add(new AlforqanEx("تَبَارَكَ الَّذِي إِنْ شَاءَ جَعَلَ لَكَ خَيْرًا مِنْ ذَلِكَ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَيَجْعَلْ لَكَ قُصُورًا (10)"));
        alforqanExes.add(new AlforqanEx("عَظُمَتْ بركات الله، وكَثُرَتْ خيراته، الذي إن شاء جعل لك - أيها الرسول - خيرًا مما تمنَّوه لك، فجعل لك في الدنيا حدائق كثيرة تتخللها الأنهار، وجعل لك فيها قصورًا عظيمة."));
        alforqanExes.add(new AlforqanEx("بَلْ كَذَّبُوا بِالسَّاعَةِ وَأَعْتَدْنَا لِمَنْ كَذَّبَ بِالسَّاعَةِ سَعِيرًا (11)"));
        alforqanExes.add(new AlforqanEx("وما كذبوك؛ لأنك تأكل الطعام، وتمشي في الأسواق، بل كذَّبوا بيوم القيامة وما فيه من جزاء، وأعتدنا لمن كذب بالساعة نارًا حارة تُسَعَّر بهم."));
        alforqanExes.add(new AlforqanEx("إِذَا رَأَتْهُمْ مِنْ مَكَانٍ بَعِيدٍ سَمِعُوا لَهَا تَغَيُّظًا وَزَفِيرًا (12)"));
        alforqanExes.add(new AlforqanEx("إذا رأت النار هؤلاء المكذبين يوم القيامة من مكان بعيد، سمعوا صوت غليانها وزفيرها، من شدة تغيظها منهم."));
        alforqanExes.add(new AlforqanEx("وَإِذَا أُلْقُوا مِنْهَا مَكَانًا ضَيِّقًا مُقَرَّنِينَ دَعَوْا هُنَالِكَ ثُبُورًا (13)"));
        alforqanExes.add(new AlforqanEx("وإذا أُلقوا في مكان شديد الضيق من جهنم -وقد قُرِنت أيديهم بالسلاسل إلى أعناقهم- دَعَوْا على أنفسهم بالهلاك للخلاص منها."));
        alforqanExes.add(new AlforqanEx("لَا تَدْعُوا الْيَوْمَ ثُبُورًا وَاحِدًا وَادْعُوا ثُبُورًا كَثِيرًا (14)"));
        alforqanExes.add(new AlforqanEx("فيقال لهم تيئيسًا، لا تَدْعوا اليوم بالهلاك مرة واحدة، بل مرات كثيرة، فلن يزيدكم ذلك إلا غمًّا، فلا خلاص لكم."));
        alforqanExes.add(new AlforqanEx("قُلْ أَذَلِكَ خَيْرٌ أَمْ جَنَّةُ الْخُلْدِ الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاءً وَمَصِيرًا (15)"));
        alforqanExes.add(new AlforqanEx("قل لهم - أيها الرسول -: أهذه النار التي وُصِفتْ لكم خيرٌ أم جنة النعيم الدائم التي وُعِد بها الخائفون من عذاب ربهم، كانت لهم ثوابًا على عملهم، ومآلا يرجعون إليه في الآخرة؟"));
        alforqanExes.add(new AlforqanEx("لَهُمْ فِيهَا مَا يَشَاءُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْئُولًا (16)"));
        alforqanExes.add(new AlforqanEx("لهؤلاء المطيعين في الجنة ما يشتهون من ملاذِّ النعيم، متاعهم فيه دائم، كان دخولهم إياها على ربك - أيها الرسول - وعدًا مسؤولا يسأله عباد الله المتقون، والله لا يخلف وعده."));
        alforqanExes.add(new AlforqanEx("وَيَوْمَ يَحْشُرُهُمْ وَمَا يَعْبُدُونَ مِنْ دُونِ اللَّهِ فَيَقُولُ أَأَنْتُمْ أَضْلَلْتُمْ عِبَادِي هَؤُلَاءِ أَمْ هُمْ ضَلُّوا السَّبِيلَ (17)"));
        alforqanExes.add(new AlforqanEx("ويوم القيامة يحشر الله المشركين وما كانوا يعبدونه من دونه، فيقول لهؤلاء المعبودين: أأنتم أضللتم عبادي هؤلاء عن طريق الحق، وأمرتموهم بعبادتكم، أم هم ضلوا السبيل، فعبدوكم مِن تلقاء أنفسهم؟"));
        alforqanExes.add(new AlforqanEx("قَالُوا سُبْحَانَكَ مَا كَانَ يَنْبَغِي لَنَا أَنْ نَتَّخِذَ مِنْ دُونِكَ مِنْ أَوْلِيَاءَ وَلَكِنْ مَتَّعْتَهُمْ وَآبَاءَهُمْ حَتَّى نَسُوا الذِّكْرَ وَكَانُوا قَوْمًا بُورًا (18)"));
        alforqanExes.add(new AlforqanEx("قال المعبودون من دون الله: تنزيهًا لك -يا ربنا- عَمَّا فعل هؤلاء، فما يصحُّ أن نَتَّخِذ سواك أولياء نواليهم، ولكن متعتَ هؤلاء المشركين وآباءهم بالمال والعافية في الدنيا، حتى نسوا ذكرك فأشركوا بك، وكانوا قومًا هلكى غلب عليهم الشقاء والخِذْلان."));
        alforqanExes.add(new AlforqanEx("فَقَدْ كَذَّبُوكُمْ بِمَا تَقُولُونَ فَمَا تَسْتَطِيعُونَ صَرْفًا وَلَا نَصْرًا وَمَنْ يَظْلِمْ مِنْكُمْ نُذِقْهُ عَذَابًا كَبِيرًا (19)"));
        alforqanExes.add(new AlforqanEx("فيقال للمشركين: لقد كذَّبكم هؤلاء الذين عبدتموهم في ادِّعائكم عليهم، فها أنتم أولاء لا تستطيعون دَفْعًا للعذاب عن أنفسكم، ولا نصرًا لها، ومَن يشرك بالله فيظلم نفسه ويعبد غير الله، ويمت على ذلك، يعذبه الله عذابًا شديدًا."));
        alforqanExes.add(new AlforqanEx("وَمَا أَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِينَ إِلَّا إِنَّهُمْ لَيَأْكُلُونَ الطَّعَامَ وَيَمْشُونَ فِي الْأَسْوَاقِ وَجَعَلْنَا بَعْضَكُمْ لِبَعْضٍ فِتْنَةً أَتَصْبِرُونَ وَكَانَ رَبُّكَ بَصِيرًا (20)"));
        alforqanExes.add(new AlforqanEx("وما أرسلنا قبلك - أيها الرسول - أحدًا مِن رسلنا إلا كانوا بشرًا، يأكلون الطعام، ويمشون في الأسواق. وجعلنا بعضكم -أيها الناس- لبعض ابتلاء واختبارًا بالهدى والضلال، والغنى والفقر، والصحة والمرض، هل تصبرون، فتقوموا بما أوجبه الله عليكم، وتشكروا له، فيثيبكم مولاكم، أو لا تصبرون فتستحقوا العقوبة؟ وكان ربك - أيها الرسول - بصيرًا بمن يجزع أو يصبر، وبمن يكفر أو يشكر."));
        alforqanExes.add(new AlforqanEx("وَقَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا لَوْلَا أُنْزِلَ عَلَيْنَا الْمَلَائِكَةُ أَوْ نَرَى رَبَّنَا لَقَدِ اسْتَكْبَرُوا فِي أَنْفُسِهِمْ وَعَتَوْا عُتُوًّا كَبِيرًا (21)"));
        alforqanExes.add(new AlforqanEx("وقال الذين لا يؤمِّلون لقاء ربهم بعد موتهم لإنكارهم له: هلا أُنزل علينا الملائكة، فتُخْبِرنا بأن محمدًا صادق، أو نرى ربنا عِيانًا، فيخبرنا بصدقه في رسالته. لقد أُعجِبوا بأنفسهم واستعلَوْا حيث اجترؤوا على هذا القول، وتجاوزوا الحدَّ في طغيانهم وكفرهم."));
        alforqanExes.add(new AlforqanEx("يَوْمَ يَرَوْنَ الْمَلَائِكَةَ لَا بُشْرَى يَوْمَئِذٍ لِلْمُجْرِمِينَ وَيَقُولُونَ حِجْرًا مَحْجُورًا (22)"));
        alforqanExes.add(new AlforqanEx("يوم يرون الملائكة عند الاحتضار، وفي القبر، ويوم القيامة، على غير الصورة التي اقترحوها لا لتبشرهم بالجنة، ولكن لتقول لهم: جعل الله الجنة مكانًا محرمًا عليكم."));
        alforqanExes.add(new AlforqanEx("وَقَدِمْنَا إِلَى مَا عَمِلُوا مِنْ عَمَلٍ فَجَعَلْنَاهُ هَبَاءً مَنْثُورًا (23)"));
        alforqanExes.add(new AlforqanEx("وقَدِمْنا إلى ما عملوه مِن مظاهر الخير والبر، فجعلناه باطلا مضمحلا لا ينفعهم كالهباء المنثور، وهو ما يُرى في ضوء الشمس من خفيف الغبار؛ وذلك أن العمل لا ينفع في الآخرة إلا إذا توفر في صاحبه: الإيمان بالله، والإخلاص له، والمتابعة لرسوله محمد، صلى الله عليه وسلم."));
        alforqanExes.add(new AlforqanEx("أَصْحَابُ الْجَنَّةِ يَوْمَئِذٍ خَيْرٌ مُسْتَقَرًّا وَأَحْسَنُ مَقِيلًا (24)"));
        alforqanExes.add(new AlforqanEx("أصحاب الجنة يوم القيامة خير مستقرًا من أهل النار وأحسن منازل في الجنة، فراحتهم تامة، ونعيمهم لا يشوبه كدر."));
        alforqanExes.add(new AlforqanEx("وَيَوْمَ تَشَقَّقُ السَّمَاءُ بِالْغَمَامِ وَنُزِّلَ الْمَلَائِكَةُ تَنْزِيلًا (25)"));
        alforqanExes.add(new AlforqanEx("واذكر - أيها الرسول - ذلك اليوم الذي تتشقق فيه السماء، ويظهر من فتحاتها السحاب الأبيض الرقيق، وينزل الله ملائكة السموات يومئذ، فيحيطون بالخلائق في المحشر، ويأتي الله تبارك وتعالى لفصل القضاء بين العباد، إتيانًا يليق بجلاله."));
        alforqanExes.add(new AlforqanEx("الْمُلْكُ يَوْمَئِذٍ الْحَقُّ لِلرَّحْمَنِ وَكَانَ يَوْمًا عَلَى الْكَافِرِينَ عَسِيرًا (26)"));
        alforqanExes.add(new AlforqanEx("المُلْك الحق في هذا اليوم للرحمن وحده دون مَن سواه، وكان هذا اليوم صعبًا شديدًا على الكافرين، لما ينالهم من العقاب والعذاب الأليم."));
        alforqanExes.add(new AlforqanEx("وَيَوْمَ يَعَضُّ الظَّالِمُ عَلَى يَدَيْهِ يَقُولُ يَالَيْتَنِي اتَّخَذْتُ مَعَ الرَّسُولِ سَبِيلًا (27)"));
        alforqanExes.add(new AlforqanEx("واذكر - أيها الرسول - يوم يَعَضُّ الظالم لنفسه على يديه ندمًا وتحسرًا قائلا يا ليتني صاحبت رسول الله محمدًا صلى الله عليه وسلم واتبعته في اتخاذ الإسلام طريقًا إلى الجنة."));
        alforqanExes.add(new AlforqanEx("يَاوَيْلَتَى لَيْتَنِي لَمْ أَتَّخِذْ فُلَانًا خَلِيلًا (28)"));
        alforqanExes.add(new AlforqanEx("ويتحسَّر قائلا يا ليتني لم أتخذ الكافر فلانًا صديقًا أتبعه وأوده."));
        alforqanExes.add(new AlforqanEx("لَقَدْ أَضَلَّنِي عَنِ الذِّكْرِ بَعْدَ إِذْ جَاءَنِي وَكَانَ الشَّيْطَانُ لِلْإِنْسَانِ خَذُولًا (29)"));
        alforqanExes.add(new AlforqanEx("لقد أضلَّني هذا الصديق عن القرآن بعد إذ جاءني. وكان الشيطان الرجيم خذولا للإنسان دائمًا. وفي هذه الآيات التحذير من مصاحبة قرين السوء؛ فإنه قد يكون سببًا لإدخال قرينه النار."));
        alforqanExes.add(new AlforqanEx("وَقَالَ الرَّسُولُ يَارَبِّ إِنَّ قَوْمِي اتَّخَذُوا هَذَا الْقُرْآنَ مَهْجُورًا (30)"));
        alforqanExes.add(new AlforqanEx("وقال الرسول شاكيًا ما صنع قومه: يا ربِّ إن قومي تركوا هذا القرآن وهجروه، متمادين في إعراضهم عنه وتَرْكِ تدبُّره والعمل به وتبليغه. وفي الآية تخويف عظيم لمن هجر القرآن فلم يعمل به."));
        alforqanExes.add(new AlforqanEx("وَكَذَلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِنَ الْمُجْرِمِينَ وَكَفَى بِرَبِّكَ هَادِيًا وَنَصِيرًا (31)"));
        alforqanExes.add(new AlforqanEx("وكما جعلنا لك - أيها الرسول - أعداء من مجرمي قومك، جعلنا لكل نبيٍّ من الأنبياء عدوًا من مجرمي قومه، فاصبر كما صبروا. وكفى بربك هاديًا ومرشدًا ومعينًا يعينك على أعدائك. وفي هذا تسلية لنبيه محمد صلى الله عليه وسلم."));
        alforqanExes.add(new AlforqanEx("وَقَالَ الَّذِينَ كَفَرُوا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْآنُ جُمْلَةً وَاحِدَةً كَذَلِكَ لِنُثَبِّتَ بِهِ فُؤَادَكَ وَرَتَّلْنَاهُ تَرْتِيلًا (32)"));
        alforqanExes.add(new AlforqanEx("وقال الذين كفروا: هلا أنزل القرآن على محمد جملة واحدة كالتوراة والإنجيل والزبور! قال الله سبحانه وتعالى: كذلك أنزلناه مفرقًا؛ لنقوِّي به قلبك وتزداد به طمأنينة، فتعيه وتحمله، وبيَّنَّاه في تثبت ومُهْلَة."));
        alforqanExes.add(new AlforqanEx("وَلَا يَأْتُونَكَ بِمَثَلٍ إِلَّا جِئْنَاكَ بِالْحَقِّ وَأَحْسَنَ تَفْسِيرًا (33)"));
        alforqanExes.add(new AlforqanEx("ولا يأتيك - أيها الرسول - المشركون بحجة أو شبهة إلا جئناك بالجواب الحق وبأحسن بيان له."));
        alforqanExes.add(new AlforqanEx("الَّذِينَ يُحْشَرُونَ عَلَى وُجُوهِهِمْ إِلَى جَهَنَّمَ أُولَئِكَ شَرٌّ مَكَانًا وَأَضَلُّ سَبِيلًا (34)"));
        alforqanExes.add(new AlforqanEx("أولئك الكفار هم الذين يُسحبون على وجوههم إلى جهنم، وأولئك هم شر الناس منزلة، وأبعدهم طريقًا عن الحق."));
        alforqanExes.add(new AlforqanEx("وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ وَجَعَلْنَا مَعَهُ أَخَاهُ هَارُونَ وَزِيرًا (35)"));
        alforqanExes.add(new AlforqanEx("ولقد آتينا موسى التوراة، وجعلنا معه أخاه هارون معينًا له"));
        alforqanExes.add(new AlforqanEx("فَقُلْنَا اذْهَبَا إِلَى الْقَوْمِ الَّذِينَ كَذَّبُوا بِآيَاتِنَا فَدَمَّرْنَاهُمْ تَدْمِيرًا (36)"));
        alforqanExes.add(new AlforqanEx("فقلنا لهما: اذهبا إلى فرعون وقومه الذين كذَّبوا بدلائل ربوبيتنا وألوهيتنا، فذهبا إليهم، فدَعَواهم إلى الإيمان بالله وطاعته وعدم الإشراك به، فكذَّبوهما، فأهلكناهم إهلاكًا عظيمًا."));
        alforqanExes.add(new AlforqanEx("وَقَوْمَ نُوحٍ لَمَّا كَذَّبُوا الرُّسُلَ أَغْرَقْنَاهُمْ وَجَعَلْنَاهُمْ لِلنَّاسِ آيَةً وَأَعْتَدْنَا لِلظَّالِمِينَ عَذَابًا أَلِيمًا (37)"));
        alforqanExes.add(new AlforqanEx("وأغرقنا قوم نوح بالطوفان حين كذَّبوه. ومن كذب رسولا فقد كذب الرسل جميعًا. وجعلنا إغراقهم للناس عبرة، وجعلنا لهم ولمن سلك سبيلهم في التكذيب يوم القيامة عذابًا موجعًا."));
        alforqanExes.add(new AlforqanEx("وَعَادًا وَثَمُودَ وَأَصْحَابَ الرَّسِّ وَقُرُونًا بَيْنَ ذَلِكَ كَثِيرًا (38)"));
        alforqanExes.add(new AlforqanEx("وأهلكنا عادًا قوم هود، وثمود قوم صالح، وأصحاب البئر وأممًا كثيرة بين قوم نوح وعاد وثمود وأصحاب الرسِّ، لا يعلمهم إلا الله."));
        alforqanExes.add(new AlforqanEx("وَكُلًّا ضَرَبْنَا لَهُ الْأَمْثَالَ وَكُلًّا تَبَّرْنَا تَتْبِيرًا (39)"));
        alforqanExes.add(new AlforqanEx("وكل الأمم بيَّنَّا لهم الحجج، ووضَّحنا لهم الأدلة، وأزحنا الأعذار عنهم، ومع ذلك لم يؤمنوا، فأهلكناهم بالعذاب إهلاكًا."));
        alforqanExes.add(new AlforqanEx("وَلَقَدْ أَتَوْا عَلَى الْقَرْيَةِ الَّتِي أُمْطِرَتْ مَطَرَ السَّوْءِ أَفَلَمْ يَكُونُوا يَرَوْنَهَا بَلْ كَانُوا لَا يَرْجُونَ نُشُورًا (40)"));
        alforqanExes.add(new AlforqanEx("ولقد كان مشركو «مكة» يمرون في أسفارهم على قرية قوم لوط، وهي قرية «سدوم» التي أُهلِكت بالحجارة من السماء، فلم يعتبروا بها، بل كانوا لا يرجون معادًا يوم القيامة يجازون فيه."));
        alforqanExes.add(new AlforqanEx("وَإِذَا رَأَوْكَ إِنْ يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَذَا الَّذِي بَعَثَ اللَّهُ رَسُولًا (41)"));
        alforqanExes.add(new AlforqanEx("وإذا رآك هؤلاء المكذبون - أيها الرسول - استهزؤوا بك قائلين: أهذا الذي يزعم أن الله بعثه رسولا إلينا؟"));
        alforqanExes.add(new AlforqanEx("إِنْ كَادَ لَيُضِلُّنَا عَنْ آلِهَتِنَا لَوْلَا أَنْ صَبَرْنَا عَلَيْهَا وَسَوْفَ يَعْلَمُونَ حِينَ يَرَوْنَ الْعَذَابَ مَنْ أَضَلُّ سَبِيلًا (42)"));
        alforqanExes.add(new AlforqanEx("إنه قارب أن يصرفنا عن عبادة أصنامنا بقوة حجته وبيانه، لولا أن ثَبَتْنا على عبادتها، وسوف يعلمون حين يرون ما يستحقون من العذاب: مَن أضل دينًا أهم أم محمد؟"));
        alforqanExes.add(new AlforqanEx("أَرَأَيْتَ مَنِ اتَّخَذَ إِلَهَهُ هَوَاهُ أَفَأَنْتَ تَكُونُ عَلَيْهِ وَكِيلًا (43)"));
        alforqanExes.add(new AlforqanEx("انظر - أيها الرسول - متعجبًا إلى مَن أطاع هواه كطاعة الله، أفأنت تكون عليه حفيظًا حتى تردَّه إلى الإيمان؟"));
        alforqanExes.add(new AlforqanEx("أَمْ تَحْسَبُ أَنَّ أَكْثَرَهُمْ يَسْمَعُونَ أَوْ يَعْقِلُونَ إِنْ هُمْ إِلَّا كَالْأَنْعَامِ بَلْ هُمْ أَضَلُّ سَبِيلًا (44)"));
        alforqanExes.add(new AlforqanEx("أم تظن أن أكثرهم يسمعون آيات الله سماع تدبر، أو يفهمون ما فيها؟ ما هم إلا كالبهائم في عدم الانتفاع بما يسمعونه، بل هم أضل طريقًا منها."));
        alforqanExes.add(new AlforqanEx("أَلَمْ تَرَ إِلَى رَبِّكَ كَيْفَ مَدَّ الظِّلَّ وَلَوْ شَاءَ لَجَعَلَهُ سَاكِنًا ثُمَّ جَعَلْنَا الشَّمْسَ عَلَيْهِ دَلِيلًا (45)"));
        alforqanExes.add(new AlforqanEx("ألم تر كيف مدَّ الله الظل من طلوع الفجر إلى طلوع الشمس؟ ولو شاء لجعله ثابتًا مستقرًا لا تزيله الشمس، ثم جعلنا الشمس علامة يُستَدَلُّ بأحوالها على أحواله، ثم تَقَلَّصَ الظل يسيرًا يسيرًا، فكلما ازداد ارتفاع الشمس ازداد نقصانه."));
        alforqanExes.add(new AlforqanEx("ثُمَّ قَبَضْنَاهُ إِلَيْنَا قَبْضًا يَسِيرًا (46)"));
        alforqanExes.add(new AlforqanEx("وذلك من الأدلة على قدرة الله وعظمته، وأنه وحده المستحق للعبادة دون سواه."));
        alforqanExes.add(new AlforqanEx("وَهُوَ الَّذِي جَعَلَ لَكُمُ اللَّيْلَ لِبَاسًا وَالنَّوْمَ سُبَاتًا وَجَعَلَ النَّهَارَ نُشُورًا (47)"));
        alforqanExes.add(new AlforqanEx("والله تعالى هو الذي جعل لكم الليل ساترًا لكم بظلامه كما يستركم اللباس، وجعل النوم راحة لأبدانكم، وجعل لكم النهار؛ لتنتشروا في الأرض، وتطلبوا معايشكم."));
        alforqanExes.add(new AlforqanEx("وَهُوَ الَّذِي أَرْسَلَ الرِّيَاحَ بُشْرًا بَيْنَ يَدَيْ رَحْمَتِهِ وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً طَهُورًا (48)"));
        alforqanExes.add(new AlforqanEx("وهو الذي أرسل الرياح التي تحمل السحاب، تبشر الناس بالمطر رحمة منه، وأنزلنا من السماء ماء يُتَطَهَّر به."));
        alforqanExes.add(new AlforqanEx("لِنُحْيِيَ بِهِ بَلْدَةً مَيْتًا وَنُسْقِيَهُ مِمَّا خَلَقْنَا أَنْعَامًا وَأَنَاسِيَّ كَثِيرًا (49)"));
        alforqanExes.add(new AlforqanEx("لنخرج به النبات في مكان لا نبات فيه، فيحيا البلد الجدب بعد موات، ونُسْقي ذلك الماء مِن خَلْقِنا كثيرًا من الأنعام والناس."));
        alforqanExes.add(new AlforqanEx("وَلَقَدْ صَرَّفْنَاهُ بَيْنَهُمْ لِيَذَّكَّرُوا فَأَبَى أَكْثَرُ النَّاسِ إِلَّا كُفُورًا (50)"));
        alforqanExes.add(new AlforqanEx("ولقد أنزلنا المطر على أرض دون أخرى؛ ليذكر الذين أنزلنا عليهم المطر نعمة الله عليهم، فيشكروا له، وليذكر الذين مُنعوا منه، فيسارعوا بالتوبة إلى الله -جل وعلا- ليرحمهم ويسقيهم، فأبى أكثر الناس إلا جحودًا لنعمنا عليهم، كقولهم: مطرنا بنَوْء كذا وكذا."));
        alforqanExes.add(new AlforqanEx("وَلَوْ شِئْنَا لَبَعَثْنَا فِي كُلِّ قَرْيَةٍ نَذِيرًا (51)"));
        alforqanExes.add(new AlforqanEx("ولو شئنا لبعثنا في كل قرية نذيرًا، يدعوهم إلى الله عز وجل، وينذرهم عذابه، ولكنا جعلناك - أيها الرسول - مبعوثًا إلى جميع أهل الأرض، وأمرناك أن تبلغهم هذا القرآن."));
        alforqanExes.add(new AlforqanEx("فَلَا تُطِعِ الْكَافِرِينَ وَجَاهِدْهُمْ بِهِ جِهَادًا كَبِيرًا (52)"));
        alforqanExes.add(new AlforqanEx("فلا تطع الكافرين في ترك شيء مما أرسلتَ به، بل ابذل جهدك في تبليغ الرسالة، وجاهد الكافرين بهذا القرآن جهادًا كبيرًا، لا يخالطه فتور."));
        alforqanExes.add(new AlforqanEx("وَهُوَ الَّذِي مَرَجَ الْبَحْرَيْنِ هَذَا عَذْبٌ فُرَاتٌ وَهَذَا مِلْحٌ أُجَاجٌ وَجَعَلَ بَيْنَهُمَا بَرْزَخًا وَحِجْرًا مَحْجُورًا (53)"));
        alforqanExes.add(new AlforqanEx("والله هو الذي خلط البحرين: العذب السائغ الشراب، والملح الشديد الملوحة، وجعل بينهما حاجزًا يمنع كل واحدٍ منهما من إفساد الآخر، ومانعًا مِن أن يصل أحدهما إلى الآخر."));
        alforqanExes.add(new AlforqanEx("وَهُوَ الَّذِي خَلَقَ مِنَ الْمَاءِ بَشَرًا فَجَعَلَهُ نَسَبًا وَصِهْرًا وَكَانَ رَبُّكَ قَدِيرًا (54)"));
        alforqanExes.add(new AlforqanEx("وهو الذي خلق مِن منيِّ الرجل والمرأة ذرية ذكورًا وإناثًا، فنشأ من هذا قرابة النسب وقرابة المصاهرة. وكان ربك قديرًا على خلق ما يشاء."));
        alforqanExes.add(new AlforqanEx("وَيَعْبُدُونَ مِنْ دُونِ اللَّهِ مَا لَا يَنْفَعُهُمْ وَلَا يَضُرُّهُمْ وَكَانَ الْكَافِرُ عَلَى رَبِّهِ ظَهِيرًا (55)"));
        alforqanExes.add(new AlforqanEx("ومع كل هذه الدلائل على قدرة الله وإنعامه على خلقه يَعبدُ الكفار مِن دون الله ما لا ينفعهم إن عبدوه، ولا يضرهم إن تركوا عبادته، وكان الكافر عونًا للشيطان على ربه بالشرك في عبادة الله، مُظَاهِرًا له على معصيته."));
        alforqanExes.add(new AlforqanEx("وَمَا أَرْسَلْنَاكَ إِلَّا مُبَشِّرًا وَنَذِيرًا (56)"));
        alforqanExes.add(new AlforqanEx("وما أرسلناك - أيها الرسول - إلا مبشرًا للمؤمنين بالجنة ومنذرًا للكافرين بالنار."));
        alforqanExes.add(new AlforqanEx("قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ إِلَّا مَنْ شَاءَ أَنْ يَتَّخِذَ إِلَى رَبِّهِ سَبِيلًا (57)"));
        alforqanExes.add(new AlforqanEx("قل لهم: لا أطلب منكم على تبليغ الرسالة أيَّ أجر، لكنْ من أراد أن يهتدي ويسلك سبيل الحق إلى ربه وينفق في مرضاته، فلست أُجبركم عليه، وإنما هو خير لأنفسكم."));
        alforqanExes.add(new AlforqanEx("وَتَوَكَّلْ عَلَى الْحَيِّ الَّذِي لَا يَمُوتُ وَسَبِّحْ بِحَمْدِهِ وَكَفَى بِهِ بِذُنُوبِ عِبَادِهِ خَبِيرًا (58)"));
        alforqanExes.add(new AlforqanEx("وتوكل على الله الذي له جميع معاني الحياة الكاملة كما يليق بجلاله الذي لا يموت، ونزِّهه عن صفات النقصان. وكفى بالله خبيرًا بذنوب خلقه، لا يخفى عليه شيء منها، وسيحاسبهم عليها ويجازيهم بها."));
        alforqanExes.add(new AlforqanEx("الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَمَا بَيْنَهُمَا فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَى عَلَى الْعَرْشِ الرَّحْمَنُ فَاسْأَلْ بِهِ خَبِيرًا (59)"));
        alforqanExes.add(new AlforqanEx("الذي خلق السموات والأرض وما بينهما في ستة أيام، ثم استوى على العرش -أي علا وارتفع- استواءً يليق بجلاله، هو الرحمن، فاسأل - أيها النبي - به خبيرًا، يعني بذلك سبحانه نفسه الكريمة، فهو الذي يعلم صفاته وعظمته وجلاله. ولا أحد من البشر أعلم بالله ولا أخبر به من عبده ورسوله محمد صلى الله عليه وسلم."));
        alforqanExes.add(new AlforqanEx("وَإِذَا قِيلَ لَهُمُ اسْجُدُوا لِلرَّحْمَنِ قَالُوا وَمَا الرَّحْمَنُ أَنَسْجُدُ لِمَا تَأْمُرُنَا وَزَادَهُمْ نُفُورًا (60)"));
        alforqanExes.add(new AlforqanEx("وإذا قيل للكافرين: اسجدوا للرحمن واعبدوه قالوا: ما نعرف الرحمن، أنسجد لما تأمرنا بالسجود له طاعة لأمرك؟ وزادهم دعاؤهم إلى السجود للرحمن بُعْداً عن الإيمان ونفورًا منه."));
        alforqanExes.add(new AlforqanEx("تَبَارَكَ الَّذِي جَعَلَ فِي السَّمَاءِ بُرُوجًا وَجَعَلَ فِيهَا سِرَاجًا وَقَمَرًا مُنِيرًا (61)"));
        alforqanExes.add(new AlforqanEx("عَظُمَتْ بركات الرحمن وكثر خيره، الذي جعل في السماء النجوم الكبار بمنازلها، وجعل فيها شمسًا تضيء وقمرًا ينير."));
        alforqanExes.add(new AlforqanEx("وَهُوَ الَّذِي جَعَلَ اللَّيْلَ وَالنَّهَارَ خِلْفَةً لِمَنْ أَرَادَ أَنْ يَذَّكَّرَ أَوْ أَرَادَ شُكُورًا (62)"));
        alforqanExes.add(new AlforqanEx("وهو الذي جعل الليل والنهار متعاقبَيْن يَخْلُف أحدهما الآخر لمن أراد أن يعتبر بما في ذلك إيمانًا بالمدبِّر الخالق، أو أراد أن يشكر لله تعالى على نعمه وآلائه."));
        alforqanExes.add(new AlforqanEx("وَعِبَادُ الرَّحْمَنِ الَّذِينَ يَمْشُونَ عَلَى الْأَرْضِ هَوْنًا وَإِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا (63)"));
        alforqanExes.add(new AlforqanEx("وعباد الرحمن الصالحون يمشون على الأرض بسكينة متواضعين، وإذا خاطبهم الجهلة السفهاء بالأذى أجابوهم بالمعروف من القول، وخاطبوهم خطابًا يَسْلَمون فيه من الإثم، ومن مقابلة الجاهل بجهله."));
        alforqanExes.add(new AlforqanEx("وَالَّذِينَ يَبِيتُونَ لِرَبِّهِمْ سُجَّدًا وَقِيَامًا (64)"));
        alforqanExes.add(new AlforqanEx("والذين يكثرون من صلاة الليل مخلصين فيها لربهم، متذللين له بالسجود والقيام."));
        alforqanExes.add(new AlforqanEx("وَالَّذِينَ يَقُولُونَ رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا (65)"));
        alforqanExes.add(new AlforqanEx("والذين هم مع اجتهادهم في العبادة يخافون الله فيدعونه أن ينجيهم من عذاب جهنم، إن عذابها يلازم صاحبه."));
        alforqanExes.add(new AlforqanEx("إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا (66)"));
        alforqanExes.add(new AlforqanEx("إن جهنم شر قرار وإقامة."));
        alforqanExes.add(new AlforqanEx("وَالَّذِينَ إِذَا أَنْفَقُوا لَمْ يُسْرِفُوا وَلَمْ يَقْتُرُوا وَكَانَ بَيْنَ ذَلِكَ قَوَامًا (67)"));
        alforqanExes.add(new AlforqanEx("والذين إذا أنفقوا من أموالهم لم يتجاوزوا الحد في العطاء، ولم يضيِّقوا في النفقة، وكان إنفاقهم وسطًا بين التبذير والتضييق."));
        alforqanExes.add(new AlforqanEx("وَالَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا يَزْنُونَ وَمَنْ يَفْعَلْ ذَلِكَ يَلْقَ أَثَامًا (68)"));
        alforqanExes.add(new AlforqanEx("والذين يوحدون الله، ولا يدعون ولا يعبدون إلهًا غيره، ولا يقتلون النفس التي حرَّم الله قتلها إلا بما يحق قتلها به: من كفر بعد إيمان، أو زنى بعد زواج، أو قتل نفس عدوانًا، ولا يزنون، بل يحفظون فروجهم، إلا على أزواجهم أو ما ملكت أيمانهم، ومن يفعل شيئًا من هذه الكبائر يَلْقَ في الآخرة عقابًا."));
        alforqanExes.add(new AlforqanEx("يُضَاعَفْ لَهُ الْعَذَابُ يَوْمَ الْقِيَامَةِ وَيَخْلُدْ فِيهِ مُهَانًا (69)"));
        alforqanExes.add(new AlforqanEx("يُضاعَفْ له العذاب يوم القيامة، ويَخْلُدْ فيه ذليلا حقيرًا. (والوعيد بالخلود لمن فعلها كلَّها، أو لمن أشرك بالله) ."));
        alforqanExes.add(new AlforqanEx("إِلَّا مَنْ تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ وَكَانَ اللَّهُ غَفُورًا رَحِيمًا (70)"));
        alforqanExes.add(new AlforqanEx("لكن مَن تاب مِن هذه الذنوب توبة نصوحًا وآمن إيمانًا جازمًا مقرونًا بالعمل الصالح، فأولئك يمحو الله عنهم سيئاتهم ويجعل مكانها حسنات؛ بسبب توبتهم وندمهم. وكان الله غفورًا لمن تاب، رحيمًا بعباده حيث دعاهم إلى التوبة بعد مبارزته بأكبر المعاصي."));
        alforqanExes.add(new AlforqanEx("وَمَنْ تَابَ وَعَمِلَ صَالِحًا فَإِنَّهُ يَتُوبُ إِلَى اللَّهِ مَتَابًا (71)"));
        alforqanExes.add(new AlforqanEx("ومن تاب عمَّا ارتكب من الذنوب، وعمل عملا صالحا فإنه بذلك يرجع إلى الله رجوعًا صحيحًا، فيقبل الله توبته ويكفر ذنوبه."));
        alforqanExes.add(new AlforqanEx("وَالَّذِينَ لَا يَشْهَدُونَ الزُّورَ وَإِذَا مَرُّوا بِاللَّغْوِ مَرُّوا كِرَامًا (72)"));
        alforqanExes.add(new AlforqanEx("والذين لا يشهدون بالكذب ولا يحضرون مجالسه، وإذا مروا بأهل الباطل واللغو من غير قصد مرُّوا معرضين منكرين يتنزهون عنه، ولا يرضونه لغيرهم."));
        alforqanExes.add(new AlforqanEx("وَالَّذِينَ إِذَا ذُكِّرُوا بِآيَاتِ رَبِّهِمْ لَمْ يَخِرُّوا عَلَيْهَا صُمًّا وَعُمْيَانًا (73)"));
        alforqanExes.add(new AlforqanEx("والذين إذا وُعِظُوا بآيات القرآن ودلائل وحدانية الله لم يتغافلوا عنها، كأنهم صمٌّ لم يسمعوها، وعُمْيٌ لم يبصروها، بل وَعَتْها قلوبهم، وتفتَّحت لها بصائرهم، فخرُّوا لله ساجدين مطيعين."));
        alforqanExes.add(new AlforqanEx("وَالَّذِينَ يَقُولُونَ رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا (74)"));
        alforqanExes.add(new AlforqanEx("والذين يسألون الله تعالى قائلين: ربنا هب لنا مِن أزواجنا وذريَّاتنا ما تَقَرُّ به أعيننا، وفيه أنسنا وسرورنا، واجعلنا قدوة يُقتدى بنا في الخير."));
        alforqanExes.add(new AlforqanEx("أُولَئِكَ يُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوا وَيُلَقَّوْنَ فِيهَا تَحِيَّةً وَسَلَامًا (75)"));
        alforqanExes.add(new AlforqanEx("أولئك الذين اتصفوا بالصفات السابقة من عباد الرحمن، يثابون أعلى منازل الجنة؛ برحمة الله وبسبب صبرهم على الطاعات، وسَيُلَقَّوْن في الجنة التحية والتسليم من الملائكة، والحياة الطيبة والسلامة مِنَ الآفات."));
        alforqanExes.add(new AlforqanEx("خَالِدِينَ فِيهَا حَسُنَتْ مُسْتَقَرًّا وَمُقَامًا (76)"));
        alforqanExes.add(new AlforqanEx("خالدين فيها أبدًا مِن غير موت، حَسُنَتْ مستقرًا يَقِرُّون فيه ومقامًا يقيمون به، لا يبغون عنها تحولا."));
        alforqanExes.add(new AlforqanEx("قُلْ مَا يَعْبَأُ بِكُمْ رَبِّي لَوْلَا دُعَاؤُكُمْ فَقَدْ كَذَّبْتُمْ فَسَوْفَ يَكُونُ لِزَامًا (77)"));
        alforqanExes.add(new AlforqanEx("أخبر الله تعالى أنه لا يبالي ولا يعبأ بالناس، لولا دعاؤهم إياه دعاء العبادة ودعاء المسألة، فقد كَذَّبتم -أيها الكافرون- فسوف يكون تكذيبكم مُفْضِيًا لعذاب يلزمكم لزوم الغريم لغريمه، ويهلككم في الدنيا والآخرة."));



        quran_explanation_25_adapter = new quran_explanation_25_adapter(alforqanExes ,QuranExplanation_25Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_25);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_25Activity.this));
        recyclerView.setAdapter(quran_explanation_25_adapter);


    }

}