package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_59Activity extends AppCompatActivity {

    ArrayList<AlhashrEx> alhashrExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_59_adapter quran_explanation_59_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_59);

        alhashrExes.add(new AlhashrEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"));
        alhashrExes.add(new AlhashrEx("سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (1)"));
        alhashrExes.add(new AlhashrEx("نزَّه الله عن كل ما لا يليق به كلُّ ما في السموات وما في الأرض، وهو العزيز الذي لا يغالَب، الحكيم في قَدَره وتدبيره وصنعه وتشريعه، يضع الأمور في مواضعها."));
        alhashrExes.add(new AlhashrEx("هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِنْ دِيَارِهِمْ لِأَوَّلِ الْحَشْرِ مَا ظَنَنْتُمْ أَنْ يَخْرُجُوا وَظَنُّوا أَنَّهُمْ مَانِعَتُهُمْ حُصُونُهُمْ مِنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَاأُولِي الْأَبْصَارِ (2)"));
        alhashrExes.add(new AlhashrEx("هو -سبحانه- الذي أخرج الذين جحدوا نبوة محمد صلى الله عليه وسلم، من أهل الكتاب، وهم يهود بني النضير، من مساكنهم التي جاوروا بها المسلمين حول «المدينة» ، وذلك أول إخراج لهم من «جزيرة العرب» إلى «الشام» ، ما ظننتم -أيها المسلمون- أن يخرجوا من ديارهم بهذا الذل والهوان; لشدة بأسهم وقوة منعتهم، وظن اليهود أن حصونهم تدفع عنهم بأس الله ولا يقدر عليها أحد، فأتاهم الله من حيث لم يخطر لهم ببال، وألقى في قلوبهم الخوف والفزع الشديد، يُخْربون بيوتهم بأيديهم وأيدي المؤمنين، فاتعظوا يا أصحاب البصائر السليمة والعقول الراجحة بما جرى لهم."));
        alhashrExes.add(new AlhashrEx("وَلَوْلَا أَنْ كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلَاءَ لَعَذَّبَهُمْ فِي الدُّنْيَا وَلَهُمْ فِي الْآخِرَةِ عَذَابُ النَّارِ (3)"));
        alhashrExes.add(new AlhashrEx("ولولا أن كتب الله عليهم الخروج مِن ديارهم وقضاه، لَعذَّبهم في الدنيا بالقتل والسبي، ولهم في الآخرة عذاب النار."));
        alhashrExes.add(new AlhashrEx("ذَلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ وَمَنْ يُشَاقِّ اللَّهَ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ (4)"));
        alhashrExes.add(new AlhashrEx("ذلك -الذي أصاب اليهود في الدنيا وما ينتظرهم في الآخرة- لأنهم خالفوا أمر الله وأمر رسوله أشدَّ المخالفة، وحاربوهما وسعَوا في معصيتهما، ومن يخالف الله ورسوله فإن الله شديد العقاب له."));
        alhashrExes.add(new AlhashrEx("مَا قَطَعْتُمْ مِنْ لِينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَى أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ (5)"));
        alhashrExes.add(new AlhashrEx("ما قطعتم -أيها المؤمنون- من نخلة أو تركتموها قائمة على ساقها، من غير أن تتعرضوا لها، فبإذن الله وأمره؛ وليُذلَّ بذلك الخارجين عن طاعته المخالفين أمره ونهيه، حيث سلَّطكم على قطع نخيلهم وتحريقها."));
        alhashrExes.add(new AlhashrEx("وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَى مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (6)"));
        alhashrExes.add(new AlhashrEx("وما أفاءه الله على رسوله من أموال يهود بني النضير، فلم تركبوا لتحصيله خيلا ولا إبلا ولكن الله يسلِّط رسله على مَن يشاء مِن أعدائه، فيستسلمون لهم بلا قتال، والفيء ما أُخذ من أموال الكفار بحق من غير قتال. والله على كل شيء قدير لا يعجزه شيء."));
        alhashrExes.add(new AlhashrEx("مَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْ أَهْلِ الْقُرَى فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ كَيْ لَا يَكُونَ دُولَةً بَيْنَ الْأَغْنِيَاءِ مِنْكُمْ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانْتَهُوا وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ (7)"));
        alhashrExes.add(new AlhashrEx("ما أفاءه الله على رسوله من أموال مشركي أهل القرى من غير ركوب خيل ولا إبل فلله ولرسوله، يُصْرف في مصالح المسلمين العامة، ولذي قرابة رسول الله صلى الله عليه وسلم، وهم بنو هاشم وبنو المطلب، واليتامى وهم الأطفال الفقراء الذين مات آباؤهم، والمساكين، وهم أهل الحاجة الذين لا يملكون ما يكفيهم ويسد حاجتهم، وابن السبيل، وهو الغريب المسافر الذي نَفِدت نفقته وانقطع عنه ماله؛ وذلك حتى لا يكون المال ملكًا متداولا بين الأغنياء وحدهم، ويحرم منه الفقراء والمساكين. وما أعطاكم الرسول من مال، أو شرعه لكم مِن شرع، فخذوه، وما نهاكم عن أَخْذه أو فِعْله فانتهوا عنه، واتقوا الله بامتثال أوامره وترك نواهيه. إن الله شديد العقاب لمن عصاه وخالف أمره ونهيه. والآية أصل في وجوب العمل بالسنة: قولا أو فعلا أو تقريرًا."));
        alhashrExes.add(new AlhashrEx("لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِنْ دِيَارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَرِضْوَانًا وَيَنْصُرُونَ اللَّهَ وَرَسُولَهُ أُولَئِكَ هُمُ الصَّادِقُونَ (8)"));
        alhashrExes.add(new AlhashrEx("وكذلك يُعطى من المال الذي أفاءه الله على رسوله الفقراء المهاجرون، الذين اضطرهم كفار «مكة» إلى الخروج من ديارهم وأموالهم يطلبون من الله أن يتفضل عليهم بالرزق في الدنيا والرضوان في الآخرة، وينصرون دين الله ورسوله بالجهاد في سبيل الله، أولئك هم الصادقون الذين صدَّقوا قولهم بفعلهم."));
        alhashrExes.add(new AlhashrEx("وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالْإِيمَانَ مِنْ قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِمَّا أُوتُوا وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ وَمَنْ يُوقَ شُحَّ نَفْسِهِ فَأُولَئِكَ هُمُ الْمُفْلِحُونَ (9)"));
        alhashrExes.add(new AlhashrEx("والذين استوطنوا «المدينة» ، وآمنوا من قبل هجرة المهاجرين -وهم الأنصار- يحبون المهاجرين، ويواسونهم بأموالهم، ولا يجدون في أنفسهم حسدًا لهم مما أُعْطوا من مال الفيء وغيره، ويُقَدِّمون المهاجرين وذوي الحاجة على أنفسهم، ولو كان بهم حاجة وفقر، ومن سَلِم من البخل ومَنْعِ الفضل من المال فأولئك هم الفائزون الذين فازوا بمطلوبهم."));
        alhashrExes.add(new AlhashrEx("وَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ (10)"));
        alhashrExes.add(new AlhashrEx("والذين جاؤوا من المؤمنين من بعد الأنصار والمهاجرين الأولين يقولون: ربنا اغفر لنا ذنوبنا، واغفر لإخواننا في الدين الذين سبقونا بالإيمان، ولا تجعل في قلوبنا حسدًا وحقدًا لأحد من أهل الإيمان، ربنا إنك ترحم عبادك رحمة واسعة في عاجلهم وآجلهم.\n" +
                "وفي الآية دلالة على أنه ينبغي للمسلم أن يذكر سلفه بخير، ويدعو لهم، وأن يحب صحابة رسول الله، صلى الله عليه وسلم، ويذكرهم بخير، ويترضى عنهم.\n"));
        alhashrExes.add(new AlhashrEx("أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لِإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِنْ قُوتِلْتُمْ لَنَنْصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ (11)"));
        alhashrExes.add(new AlhashrEx("ألم تنظر إلى المنافقين، يقولون لإخوانهم في الكفر من يهود بني النضير: لئن أخرجكم محمد ومَن معه مِن منازلكم لنخرجن معكم، ولا نطيع فيكم أحدًا أبدًا سألَنا خِذْلانكم أو ترك الخروج معكم، ولئن قاتلوكم لنعاوننكم عليهم؟ والله يشهد إن المنافقين لكاذبون فيما وعدوا به يهود بني النضير."));
        alhashrExes.add(new AlhashrEx("لَئِنْ أُخْرِجُوا لَا يَخْرُجُونَ مَعَهُمْ وَلَئِنْ قُوتِلُوا لَا يَنْصُرُونَهُمْ وَلَئِنْ نَصَرُوهُمْ لَيُوَلُّنَّ الْأَدْبَارَ ثُمَّ لَا يُنْصَرُونَ (12)"));
        alhashrExes.add(new AlhashrEx("لئن أُخرج اليهود من «المدينة» لا يخرج المنافقون معهم، ولئن قوتلوا لا يقاتلون معهم كما وَعَدوا، ولئن قاتلوا معهم ليولُنَّ الأدبار فرارًا منهزمين، ثم لا ينصرهم الله، بل يخذلهم، ويُذِلُّهم."));
        alhashrExes.add(new AlhashrEx("لَأَنْتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِمْ مِنَ اللَّهِ ذَلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَفْقَهُونَ (13)"));
        alhashrExes.add(new AlhashrEx("لَخوفُ المنافقين وخشيتهم إياكم -أيها المؤمنون- أعظم وأشد في صدورهم من خوفهم وخشيتهم من الله؛ وذلك بسبب أنهم قوم لا يفقهون عظمة الله والإيمان به، ولا يرهبون عقابه."));
        alhashrExes.add(new AlhashrEx("لَا يُقَاتِلُونَكُمْ جَمِيعًا إِلَّا فِي قُرًى مُحَصَّنَةٍ أَوْ مِنْ وَرَاءِ جُدُرٍ بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّى ذَلِكَ بِأَنَّهُمْ قَوْمٌ لَا يَعْقِلُونَ (14)"));
        alhashrExes.add(new AlhashrEx("لا يواجهكم اليهود بقتال مجتمعين إلا في قرى محصنة بالأسوار والخنادق، أو من خلف الحيطان التي يتسترون بها؛ لجبنهم وللرعب الذي تمكن من قلوبهم، عداوتهم فيما بينهم شديدة، تظن أنهم مجتمعون على كلمة واحدة، ولكن قلوبهم متفرقة؛ وذلك بسبب أنهم قوم لا يعقلون أمر الله ولا يتدبرون آياته."));
        alhashrExes.add(new AlhashrEx("كَمَثَلِ الَّذِينَ مِنْ قَبْلِهِمْ قَرِيبًا ذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ (15)"));
        alhashrExes.add(new AlhashrEx("مثل هؤلاء اليهود فيما حلَّ بهم من عقوبة الله كمثل كفار قريش يوم «بدر» ، ويهود بني قينقاع، حيث ذاقوا سوء عاقبة كفرهم وعداوتهم لرسول الله صلى الله عليه وسلم في الدنيا، ولهم في الآخرة عذاب أليم موجع."));
        alhashrExes.add(new AlhashrEx("كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنْسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِنْكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ (16)"));
        alhashrExes.add(new AlhashrEx("ومثل هؤلاء المنافقين في إغراء اليهود على القتال ووَعْدهم بالنصر على رسول الله صلى الله عليه وسلم، كمثل الشيطان حين زيَّن للإنسان الكفر ودعاه إليه، فلما كفر قال: إني بريء منك، إني أخاف الله رب الخلق أجمعين."));
        alhashrExes.add(new AlhashrEx("فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا وَذَلِكَ جَزَاءُ الظَّالِمِينَ (17)"));
        alhashrExes.add(new AlhashrEx("فكان عاقبة أمر الشيطان والإنسان الذي أطاعه فكفر، أنهما في النار، ماكثَيْن فيها أبدًا، وذلك جزاء المعتدين المتجاوزين حدود الله."));
        alhashrExes.add(new AlhashrEx("يَاأَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ (18)"));
        alhashrExes.add(new AlhashrEx("يا أيها الذين صدَّقوا الله ورسوله وعملوا بشرعه، خافوا الله، واحذروا عقابه بفعل ما أمركم به وترك ما نهاكم عنه، ولتتدبر كل نفس ما قدمت من الأعمال ليوم القيامة، وخافوا الله في كل ما تأتون وما تَذَرون، إن الله سبحانه خبير بما تعملون، لا يخفى عليه شيء من أعمالكم، وهو مجازيكم عليها."));
        alhashrExes.add(new AlhashrEx("وَلَا تَكُونُوا كَالَّذِينَ نَسُوا اللَّهَ فَأَنْسَاهُمْ أَنْفُسَهُمْ أُولَئِكَ هُمُ الْفَاسِقُونَ (19)"));
        alhashrExes.add(new AlhashrEx("ولا تكونوا -أيها المؤمنون- كالذين تركوا أداء حق الله الذي أوجبه عليهم، فأنساهم بسبب ذلك حظوظ أنفسهم من الخيرات التي تنجيهم من عذاب يوم القيامة، أولئك هم الموصوفون بالفسق، الخارجون عن طاعة الله طاعة ورسوله."));
        alhashrExes.add(new AlhashrEx("لَا يَسْتَوِي أَصْحَابُ النَّارِ وَأَصْحَابُ الْجَنَّةِ أَصْحَابُ الْجَنَّةِ هُمُ الْفَائِزُونَ (20)"));
        alhashrExes.add(new AlhashrEx("لا يستوي أصحاب النار المعذَّبون، وأصحاب الجنة المنعَّمون، أصحاب الجنة هم الظافرون بكل مطلوب، الناجون من كل مكروه."));
        alhashrExes.add(new AlhashrEx("لَوْ أَنْزَلْنَا هَذَا الْقُرْآنَ عَلَى جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا مِنْ خَشْيَةِ اللَّهِ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ (21)"));
        alhashrExes.add(new AlhashrEx("لو أنزلنا هذا القرآن على جبل من الجبال، ففهم ما فيه مِن وعد ووعيد، لأبصَرْته على قوته وشدة صلابته وضخامته، خاضعًا ذليلا متشققًا من خشية الله تعالى. وتلك الأمثال نضربها، ونوضحها للناس؛ لعلهم يتفكرون في قدرة الله وعظمته. وفي الآية حث على تدبر القرآن، وتفهم معانيه، والعمل به."));
        alhashrExes.add(new AlhashrEx("هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ (22)"));
        alhashrExes.add(new AlhashrEx("هو الله سبحانه وتعالى المعبود بحق الذي لا إله سواه، عالم السر والعلن، يعلم ما غاب وما حضر، هو الرحمن الذي وسعت رحمته كل شيء، الرحيم بأهل الإيمان به."));
        alhashrExes.add(new AlhashrEx("هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ (23)"));
        alhashrExes.add(new AlhashrEx("هو الله المعبود بحق، الذي لا إله إلا هو، الملك لجميع الأشياء، المتصرف فيها بلا ممانعة ولا مدافعة، المنزَّه عن كل نقص، الذي سلِم من كل عيب، المصدِّق رسله وأنبياءه بما أرسلهم به من الآيات البينات، الرقيب على كل خلقه في أعمالهم، العزيز الذي لا يغالَب، الجبار الذي قهر جميع العباد، وأذعن له سائر الخلق، المتكبِّر الذي له الكبرياء والعظمة. تنزَّه الله تعالى عن كل ما يشركونه به في عبادته."));
        alhashrExes.add(new AlhashrEx("هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (24)"));
        alhashrExes.add(new AlhashrEx("هو الله سبحانه وتعالى الخالق المقدر للخلق، البارئ المنشئ الموجد لهم على مقتضى حكمته، المصوِّر خلقه كيف يشاء، له سبحانه الأسماء الحسنى والصفات العلى، يسبِّح له جميع ما في السموات والأرض، وهو العزيز شديد الانتقام مِن أعدائه، الحكيم في تدبيره أمور خلقه."));


        quran_explanation_59_adapter = new quran_explanation_59_adapter(alhashrExes ,QuranExplanation_59Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_59);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_59Activity.this));
        recyclerView.setAdapter(quran_explanation_59_adapter);


    }

}