package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_71Activity extends AppCompatActivity {

    ArrayList<NouhEx> nouhExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_71_adapter quran_explanation_71_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_71);

        nouhExes.add(new NouhEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"));
        nouhExes.add(new NouhEx("إِنَّا أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ أَنْ أَنْذِرْ قَوْمَكَ مِنْ قَبْلِ أَنْ يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ (1)"));
        nouhExes.add(new NouhEx("إنا بعثنا نوحاً إلى قومه، وقلنا له: حذِّر قومك من قبل أن يأتيهم عذاب موجع."));
        nouhExes.add(new NouhEx("قَالَ يَاقَوْمِ إِنِّي لَكُمْ نَذِيرٌ مُبِينٌ (2)"));
        nouhExes.add(new NouhEx("قال نوح: يا قومي إني نذير لكم بيِّن الإنذار من عذاب الله إن عصيتموه."));
        nouhExes.add(new NouhEx("أَنِ اعْبُدُوا اللَّهَ وَاتَّقُوهُ وَأَطِيعُونِ (3)"));
        nouhExes.add(new NouhEx("وإني رسول الله إليكم فاعبدوه وحده، وخافوا عقابه، وأطيعوني فيما آمركم به، وأنهاكم عنه."));
        nouhExes.add(new NouhEx("يَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَى أَجَلٍ مُسَمًّى إِنَّ أَجَلَ اللَّهِ إِذَا جَاءَ لَا يُؤَخَّرُ لَوْ كُنْتُمْ تَعْلَمُونَ (4)"));
        nouhExes.add(new NouhEx("فإن أطعتموني واستجبتم لي يصفح الله عن ذنوبكم ويغفر لكم، ويُمدد في أعماركم إلى وقت مقدر في علم الله تعالى، إن الموت إذا جاء لا يؤخر أبدًا، لو كنتم تعلمون ذلك لسارعتم إلى الإيمان والطاعة."));
        nouhExes.add(new NouhEx("قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا (5)"));
        nouhExes.add(new NouhEx("قال نوح: رب إني دعوت قومي إلى الإيمان بك وطاعتك في الليل والنهار."));
        nouhExes.add(new NouhEx("فَلَمْ يَزِدْهُمْ دُعَائِي إِلَّا فِرَارًا (6)"));
        nouhExes.add(new NouhEx("فلم يزدهم دعائي لهم إلى الإيمان إلا هربًا وإعراضًا عنه."));
        nouhExes.add(new NouhEx("وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا (7)"));
        nouhExes.add(new NouhEx("وإني كلما دعوتهم إلى الإيمان بك؛ ليكون سببًا في غفرانك ذنوبهم، وضعوا أصابعهم في آذانهم ; كي لا يسمعوا دعوة الحق، وتغطَّوا بثيابهم؛ كي لا يروني، وأقاموا على كفرهم، واستكبروا عن قَبول الإيمان استكبارًا شديدًا."));
        nouhExes.add(new NouhEx("ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا (8)"));
        nouhExes.add(new NouhEx("ثم إني دعوتهم إلى الإيمان ظاهرًا علنًا في غير خفاء."));
        nouhExes.add(new NouhEx("ثُمَّ إِنِّي أَعْلَنْتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا (9)"));
        nouhExes.add(new NouhEx("ثم إني أعلنت لهم الدعوة بصوت مرتفع في حال، وأسررت بها بصوت خفيٍّ في حال أخرى."));
        nouhExes.add(new NouhEx("فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا (10)"));
        nouhExes.add(new NouhEx("فقلت لقومي: سلوا ربكم غفران ذنوبكم، وتوبوا إليه من كفركم، إنه تعالى كان غفارًا لمن تاب من عباده ورجع إليه."));
        nouhExes.add(new NouhEx("يُرْسِلِ السَّمَاءَ عَلَيْكُمْ مِدْرَارًا (11)"));
        nouhExes.add(new NouhEx("إن تتوبوا وتستغفروا يُنْزِلِ الله عليكم المطر غزيرًا متتابعًا."));
        nouhExes.add(new NouhEx("وَيُمْدِدْكُمْ بِأَمْوَالٍ وَبَنِينَ وَيَجْعَلْ لَكُمْ جَنَّاتٍ وَيَجْعَلْ لَكُمْ أَنْهَارًا (12)"));
        nouhExes.add(new NouhEx("ويكثرْ أموالكم وأولادكم، ويجعلْ لكم حدائق تَنْعَمون بثمارها وجمالها، ويجعل لكم الأنهار التي تسقون منها زرعكم ومواشيكم. ما لكم -أيها القوم- لا تخافون عظمة الله وسلطانه."));
        nouhExes.add(new NouhEx("وَقَدْ خَلَقَكُمْ أَطْوَارًا (14)"));
        nouhExes.add(new NouhEx("وقد خلقكم في أطوار متدرجة: نطفة ثم علقة ثم مضغة ثم عظامًا ولحمًا؟"));
        nouhExes.add(new NouhEx("أَلَمْ تَرَوْا كَيْفَ خَلَقَ اللَّهُ سَبْعَ سَمَاوَاتٍ طِبَاقًا (15)"));
        nouhExes.add(new NouhEx("ألم تنظروا كيف خلق الله سبع سموات متطابقة بعضها فوق بعض."));
        nouhExes.add(new NouhEx("وَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا (16)"));
        nouhExes.add(new NouhEx("وجعل القمر في هذه السموات نورًا، وجعل الشمس مصباحًا مضيئًا يستضيء به أهل الأرض؟"));
        nouhExes.add(new NouhEx("وَاللَّهُ أَنْبَتَكُمْ مِنَ الْأَرْضِ نَبَاتًا (17)"));
        nouhExes.add(new NouhEx("والله أنشأ أصلكم من الأرض إنشاء."));
        nouhExes.add(new NouhEx("ثُمَّ يُعِيدُكُمْ فِيهَا وَيُخْرِجُكُمْ إِخْرَاجًا (18)"));
        nouhExes.add(new NouhEx("ثم يعيدكم في الأرض بعد الموت، ويخرجكم يوم البعث إخراجًا محققًا."));
        nouhExes.add(new NouhEx("وَاللَّهُ جَعَلَ لَكُمُ الْأَرْضَ بِسَاطًا (19)"));
        nouhExes.add(new NouhEx("والله جعل لكم الأرض ممهدة كالبساط."));
        nouhExes.add(new NouhEx("لِتَسْلُكُوا مِنْهَا سُبُلًا فِجَاجًا (20)"));
        nouhExes.add(new NouhEx("لتسلكوا فيها طرقًا واسعة."));
        nouhExes.add(new NouhEx("قَالَ نُوحٌ رَبِّ إِنَّهُمْ عَصَوْنِي وَاتَّبَعُوا مَنْ لَمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلَّا خَسَارًا (21)"));
        nouhExes.add(new NouhEx("قال نوح: ربِّ إن قومي بالغوا في عصياني وتكذيبي، واتبع الضعفاء منهم الرؤساء الضالين الذين لم تزدهم أموالهم وأولادهم إلا ضلالا في الدنيا وعقابًا في الآخرة."));
        nouhExes.add(new NouhEx("وَمَكَرُوا مَكْرًا كُبَّارًا (22)"));
        nouhExes.add(new NouhEx("ومكر رؤساء الضلال بتابعيهم من الضعفاء مكرًا عظيمًا."));
        nouhExes.add(new NouhEx("وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا (23)"));
        nouhExes.add(new NouhEx("وقالوا لهم: لا تتركوا عبادة آلهتكم إلى عبادة الله وحده، التي يدعو إليها نوح، ولا تتركوا وَدًّا ولا سُواعًا ولا يغوث ويعوق ونَسْرا، وهي أسماء أصنامهم التي كانوا يعبدونها من دون الله، وكانت أسماء رجال صالحين، لما ماتوا أوحى الشيطان إلى قومهم أن يقيموا لهم التماثيل والصور; لينشطوا -بزعمهم- على الطاعة إذا رأوها، فلما ذهب هؤلاء القوم وطال الأمد، وخَلَفهم غيرهم، وسوس لهم الشيطان بأن أسلافهم كانوا يعبدون التماثيل والصور، ويتوسلون بها، وهذا من حكم تحريم التماثيل، وتحريم بناء القباب على القبور; لأنها تصير مع تطاول الزمن معبودة للجهال."));
        nouhExes.add(new NouhEx("وَقَدْ أَضَلُّوا كَثِيرًا وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ضَلَالًا (24)"));
        nouhExes.add(new NouhEx("وقد أضلَّ هؤلاء المتبوعون كثيرًا من الناس بما زيَّنوا لهم من طرق الغَواية والضلال. ثم قال نوح -عليه السلام-: ولا تزد -يا ربنا- هؤلاء الظالمين لأنفسهم بالكفر والعناد إلا بُعْدا عن الحق."));
        nouhExes.add(new NouhEx("مِمَّا خَطِيئَاتِهِمْ أُغْرِقُوا فَأُدْخِلُوا نَارًا فَلَمْ يَجِدُوا لَهُمْ مِنْ دُونِ اللَّهِ أَنْصَارًا (25)"));
        nouhExes.add(new NouhEx("فبسبب ذنوبهم وإصرارهم على الكفر والطغيان أُغرقوا بالطوفان، وأُدخلوا عقب الإغراق نارًا عظيمة اللهب والإحراق، فلم يجدوا من دون الله مَن ينصرهم، أو يدفع عنهم عذاب الله."));
        nouhExes.add(new NouhEx("وَقَالَ نُوحٌ رَبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا (26)"));
        nouhExes.add(new NouhEx("وقال نوح -عليه السلام- بعد يأسه من قومه: ربِّ لا تترك من الكافرين بك أحدًا حيًّا على الأرض يدور ويتحرك."));
        nouhExes.add(new NouhEx("إِنَّكَ إِنْ تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا (27)"));
        nouhExes.add(new NouhEx("إنك إن تتركهم دون إهلاك يُضلوا عبادك الذين قد آمنوا بك عن طريق الحق، ولا يأت من أصلابهم وأرحامهم إلا مائل عن الحق شديد الكفر بك والعصيان لك."));
        nouhExes.add(new NouhEx("رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا (28)"));
        nouhExes.add(new NouhEx("ربِّ اغفر لي ولوالديَّ ولمن دخل بيتي مؤمنًا، وللمؤمنين والمؤمنات بك، ولا تزد الكافرين إلا هلاكًا وخسرانًا في الدنيا والآخرة."));


        quran_explanation_71_adapter = new quran_explanation_71_adapter(nouhExes ,QuranExplanation_71Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_71);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_71Activity.this));
        recyclerView.setAdapter(quran_explanation_71_adapter);


    }

}