package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranText_23Activity extends AppCompatActivity {

    ArrayList<Almomenon> almomenons = new ArrayList<>();
    RecyclerView recyclerView;
    quran_text_23_adapter quran_text_23_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_text_23);

        almomenons.add(new Almomenon("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"));
        almomenons.add(new Almomenon("قَدْ أَفْلَحَ الْمُؤْمِنُونَ (1)"));
        almomenons.add(new Almomenon("الَّذِينَ هُمْ فِي صَلَاتِهِمْ خَاشِعُونَ (2)"));
        almomenons.add(new Almomenon("وَالَّذِينَ هُمْ عَنِ اللَّغْوِ مُعْرِضُونَ (3)"));
        almomenons.add(new Almomenon("وَالَّذِينَ هُمْ لِلزَّكَاةِ فَاعِلُونَ (4)"));
        almomenons.add(new Almomenon("وَالَّذِينَ هُمْ لِفُرُوجِهِمْ حَافِظُونَ (5)"));
        almomenons.add(new Almomenon("إِلَّا عَلَى أَزْوَاجِهِمْ أوْ مَا مَلَكَتْ أَيْمَانُهُمْ فَإِنَّهُمْ غَيْرُ مَلُومِينَ (6)"));
        almomenons.add(new Almomenon("فَمَنِ ابْتَغَى وَرَاءَ ذَلِكَ فَأُولَئِكَ هُمُ الْعَادُونَ (7)"));
        almomenons.add(new Almomenon("وَالَّذِينَ هُمْ لِأَمَانَاتِهِمْ وَعَهْدِهِمْ رَاعُونَ (8)"));
        almomenons.add(new Almomenon("وَالَّذِينَ هُمْ عَلَى صَلَوَاتِهِمْ يُحَافِظُونَ (9)"));
        almomenons.add(new Almomenon("أُولَئِكَ هُمُ الْوَارِثُونَ (10)"));
        almomenons.add(new Almomenon("الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ هُمْ فِيهَا خَالِدُونَ (11)"));
        almomenons.add(new Almomenon("وَلَقَدْ خَلَقْنَا الْإِنْسَانَ مِنْ سُلَالَةٍ مِنْ طِينٍ (12)"));
        almomenons.add(new Almomenon("ثُمَّ جَعَلْنَاهُ نُطْفَةً فِي قَرَارٍ مَكِينٍ (13)"));
        almomenons.add(new Almomenon("ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً فَخَلَقْنَا الْمُضْغَةَ عِظَامًا فَكَسَوْنَا الْعِظَامَ لَحْمًا ثُمَّ أَنْشَأْنَاهُ خَلْقًا آَخَرَ فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ (14)"));
        almomenons.add(new Almomenon("ثُمَّ إِنَّكُمْ بَعْدَ ذَلِكَ لَمَيِّتُونَ (15)"));
        almomenons.add(new Almomenon("ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ تُبْعَثُونَ (16)"));
        almomenons.add(new Almomenon("وَلَقَدْ خَلَقْنَا فَوْقَكُمْ سَبْعَ طَرَائِقَ وَمَا كُنَّا عَنِ الْخَلْقِ غَافِلِينَ (17)"));
        almomenons.add(new Almomenon("وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً بِقَدَرٍ فَأَسْكَنَّاهُ فِي الْأَرْضِ وَإِنَّا عَلَى ذَهَابٍ بِهِ لَقَادِرُونَ (18)"));
        almomenons.add(new Almomenon("فَأَنْشَأْنَا لَكُمْ بِهِ جَنَّاتٍ مِنْ نَخِيلٍ وَأَعْنَابٍ لَكُمْ فِيهَا فَوَاكِهُ كَثِيرَةٌ وَمِنْهَا تَأْكُلُونَ (19)"));
        almomenons.add(new Almomenon("وَشَجَرَةً تَخْرُجُ مِنْ طُورِ سَيْنَاءَ تَنْبُتُ بِالدُّهْنِ وَصِبْغٍ لِلْآَكِلِينَ (20)"));
        almomenons.add(new Almomenon("وَإِنَّ لَكُمْ فِي الْأَنْعَامِ لَعِبْرَةً نُسْقِيكُمْ مِمَّا فِي بُطُونِهَا وَلَكُمْ فِيهَا مَنَافِعُ كَثِيرَةٌ وَمِنْهَا تَأْكُلُونَ (21)"));
        almomenons.add(new Almomenon("وَعَلَيْهَا وَعَلَى الْفُلْكِ تُحْمَلُونَ (22)"));
        almomenons.add(new Almomenon("وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَى قَوْمِهِ فَقَالَ يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ أَفَلَا تَتَّقُونَ (23)"));
        almomenons.add(new Almomenon("فَقَالَ الْمَلَأُ الَّذِينَ كَفَرُوا مِنْ قَوْمِهِ مَا هَذَا إِلَّا بَشَرٌ مِثْلُكُمْ يُرِيدُ أَنْ يَتَفَضَّلَ عَلَيْكُمْ وَلَوْ شَاءَ اللَّهُ لَأَنْزَلَ مَلَائِكَةً مَا سَمِعْنَا بِهَذَا فِي آَبَائِنَا الْأَوَّلِينَ (24)"));
        almomenons.add(new Almomenon("إِنْ هُوَ إِلَّا رَجُلٌ بِهِ جِنَّةٌ فَتَرَبَّصُوا بِهِ حَتَّى حِينٍ (25)"));
        almomenons.add(new Almomenon("قَالَ رَبِّ انْصُرْنِي بِمَا كَذَّبُونِ (26)"));
        almomenons.add(new Almomenon("فَأَوْحَيْنَا إِلَيْهِ أَنِ اصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا فَإِذَا جَاءَ أَمْرُنَا وَفَارَ التَّنُّورُ فَاسْلُكْ فِيهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَأَهْلَكَ إِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ مِنْهُمْ وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا إِنَّهُمْ مُغْرَقُونَ (27)"));
        almomenons.add(new Almomenon("فَإِذَا اسْتَوَيْتَ أَنْتَ وَمَنْ مَعَكَ عَلَى الْفُلْكِ فَقُلِ الْحَمْدُ لِلَّهِ الَّذِي نَجَّانَا مِنَ الْقَوْمِ الظَّالِمِينَ (28)"));
        almomenons.add(new Almomenon("وَقُلْ رَبِّ أَنْزِلْنِي مُنْزَلًا مُبَارَكًا وَأَنْتَ خَيْرُ الْمُنْزِلِينَ (29"));
        almomenons.add(new Almomenon("إِنَّ فِي ذَلِكَ لَآَيَاتٍ وَإِنْ كُنَّا لَمُبْتَلِينَ (30)"));
        almomenons.add(new Almomenon("ثُمَّ أَنْشَأْنَا مِنْ بَعْدِهِمْ قَرْنًا آَخَرِينَ (31)"));
        almomenons.add(new Almomenon("فَأَرْسَلْنَا فِيهِمْ رَسُولًا مِنْهُمْ أَنِ اعْبُدُوا اللَّهَ مَا لَكُمْ مِنْ إِلَهٍ غَيْرُهُ أَفَلَا تَتَّقُونَ (32)"));
        almomenons.add(new Almomenon("وَقَالَ الْمَلَأُ مِنْ قَوْمِهِ الَّذِينَ كَفَرُوا وَكَذَّبُوا بِلِقَاءِ الْآَخِرَةِ وَأَتْرَفْنَاهُمْ فِي الْحَيَاةِ الدُّنْيَا مَا هَذَا إِلَّا بَشَرٌ مِثْلُكُمْ يَأْكُلُ مِمَّا تَأْكُلُونَ مِنْهُ وَيَشْرَبُ مِمَّا تَشْرَبُونَ (33)"));
        almomenons.add(new Almomenon("وَلَئِنْ أَطَعْتُمْ بَشَرًا مِثْلَكُمْ إِنَّكُمْ إِذًا لَخَاسِرُونَ (34)"));
        almomenons.add(new Almomenon("أَيَعِدُكُمْ أَنَّكُمْ إِذَا مِتُّمْ وَكُنْتُمْ تُرَابًا وَعِظَامًا أَنَّكُمْ مُخْرَجُونَ (35)"));
        almomenons.add(new Almomenon("هَيْهَاتَ هَيْهَاتَ لِمَا تُوعَدُونَ (36)"));
        almomenons.add(new Almomenon("إِنْ هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا نَحْنُ بِمَبْعُوثِينَ (37)"));
        almomenons.add(new Almomenon("إِنْ هُوَ إِلَّا رَجُلٌ افْتَرَى عَلَى اللَّهِ كَذِبًا وَمَا نَحْنُ لَهُ بِمُؤْمِنِينَ (38)"));
        almomenons.add(new Almomenon("قَالَ رَبِّ انْصُرْنِي بِمَا كَذَّبُونِ (39)"));
        almomenons.add(new Almomenon("قَالَ عَمَّا قَلِيلٍ لَيُصْبِحُنَّ نَادِمِينَ (40)"));
        almomenons.add(new Almomenon("فَأَخَذَتْهُمُ الصَّيْحَةُ بِالْحَقِّ فَجَعَلْنَاهُمْ غُثَاءً فَبُعْدًا لِلْقَوْمِ الظَّالِمِينَ (41)"));
        almomenons.add(new Almomenon("ثُمَّ أَنْشَأْنَا مِنْ بَعْدِهِمْ قُرُونًا آَخَرِينَ (42)"));
        almomenons.add(new Almomenon("مَا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا وَمَا يَسْتَأْخِرُونَ (43)"));
        almomenons.add(new Almomenon("ثُمَّ أَرْسَلْنَا رُسُلَنَا تَتْرَى كُلَّ مَا جَاءَ أُمَّةً رَسُولُهَا كَذَّبُوهُ فَأَتْبَعْنَا بَعْضَهُمْ بَعْضًا وَجَعَلْنَاهُمْ أَحَادِيثَ فَبُعْدًا لِقَوْمٍ لَا يُؤْمِنُونَ (44)"));
        almomenons.add(new Almomenon("ثُمَّ أَرْسَلْنَا مُوسَى وَأَخَاهُ هَارُونَ بِآَيَاتِنَا وَسُلْطَانٍ مُبِينٍ (45)"));
        almomenons.add(new Almomenon("إِلَى فِرْعَوْنَ وَمَلَئِهِ فَاسْتَكْبَرُوا وَكَانُوا قَوْمًا عَالِينَ (46)"));
        almomenons.add(new Almomenon("فَقَالُوا أَنُؤْمِنُ لِبَشَرَيْنِ مِثْلِنَا وَقَوْمُهُمَا لَنَا عَابِدُونَ (47)"));
        almomenons.add(new Almomenon("فَكَذَّبُوهُمَا فَكَانُوا مِنَ الْمُهْلَكِينَ (48)"));
        almomenons.add(new Almomenon("وَلَقَدْ آَتَيْنَا مُوسَى الْكِتَابَ لَعَلَّهُمْ يَهْتَدُونَ (49)"));
        almomenons.add(new Almomenon("وَجَعَلْنَا ابْنَ مَرْيَمَ وَأُمَّهُ آَيَةً وَآَوَيْنَاهُمَا إِلَى رَبْوَةٍ ذَاتِ قَرَارٍ وَمَعِينٍ (50)"));
        almomenons.add(new Almomenon("يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا إِنِّي بِمَا تَعْمَلُونَ عَلِيمٌ (51)"));
        almomenons.add(new Almomenon("وَإِنَّ هَذِهِ أُمَّتُكُمْ أُمَّةً وَاحِدَةً وَأَنَا رَبُّكُمْ فَاتَّقُونِ (52)"));
        almomenons.add(new Almomenon("فَتَقَطَّعُوا أَمْرَهُمْ بَيْنَهُمْ زُبُرًا كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ (53)"));
        almomenons.add(new Almomenon("فَذَرْهُمْ فِي غَمْرَتِهِمْ حَتَّى حِينٍ (54)"));
        almomenons.add(new Almomenon("أَيَحْسَبُونَ أَنَّمَا نُمِدُّهُمْ بِهِ مِنْ مَالٍ وَبَنِينَ (55)"));
        almomenons.add(new Almomenon("نُسَارِعُ لَهُمْ فِي الْخَيْرَاتِ بَل لَا يَشْعُرُونَ (56)"));
        almomenons.add(new Almomenon("إِنَّ الَّذِينَ هُمْ مِنْ خَشْيَةِ رَبِّهِمْ مُشْفِقُونَ (57)"));
        almomenons.add(new Almomenon("وَالَّذِينَ هُمْ بِآَيَاتِ رَبِّهِمْ يُؤْمِنُونَ (58)"));
        almomenons.add(new Almomenon("وَالَّذِينَ هُمْ بِرَبِّهِمْ لَا يُشْرِكُونَ (59)"));
        almomenons.add(new Almomenon("وَالَّذِينَ يُؤْتُونَ مَا آَتَوْا وَقُلُوبُهُمْ وَجِلَةٌ أَنَّهُمْ إِلَى رَبِّهِمْ رَاجِعُونَ (60)"));
        almomenons.add(new Almomenon("أُولَئِكَ يُسَارِعُونَ فِي الْخَيْرَاتِ وَهُمْ لَهَا سَابِقُونَ (61)"));
        almomenons.add(new Almomenon("وَلَا نُكَلِّفُ نَفْسًا إِلَّا وُسْعَهَا وَلَدَيْنَا كِتَابٌ يَنْطِقُ بِالْحَقِّ وَهُمْ لَا يُظْلَمُونَ (62)"));
        almomenons.add(new Almomenon("بَلْ قُلُوبُهُمْ فِي غَمْرَةٍ مِنْ هَذَا وَلَهُمْ أَعْمَالٌ مِنْ دُونِ ذَلِكَ هُمْ لَهَا عَامِلُونَ (63)"));
        almomenons.add(new Almomenon("حَتَّى إِذَا أَخَذْنَا مُتْرَفِيهِمْ بِالْعَذَابِ إِذَا هُمْ يَجْأَرُونَ (64)"));
        almomenons.add(new Almomenon("لَا تَجْأَرُوا الْيَوْمَ إِنَّكُمْ مِنَّا لَا تُنْصَرُونَ (65)"));
        almomenons.add(new Almomenon("قَدْ كَانَتْ آَيَاتِي تُتْلَى عَلَيْكُمْ فَكُنْتُمْ عَلَى أَعْقَابِكُمْ تَنْكِصُونَ (66)"));
        almomenons.add(new Almomenon("مُسْتَكْبِرِينَ بِهِ سَامِرًا تَهْجُرُونَ (67)"));
        almomenons.add(new Almomenon("أَفَلَمْ يَدَّبَّرُوا الْقَوْلَ أَمْ جَاءَهُمْ مَا لَمْ يَأْتِ آَبَاءَهُمُ الْأَوَّلِينَ (68)"));
        almomenons.add(new Almomenon("لَمْ يَعْرِفُوا رَسُولَهُمْ فَهُمْ لَهُ مُنْكِرُونَ (69)"));
        almomenons.add(new Almomenon("أَمْ يَقُولُونَ بِهِ جِنَّةٌ بَلْ جَاءَهُمْ بِالْحَقِّ وَأَكْثَرُهُمْ لِلْحَقِّ كَارِهُونَ (70)"));
        almomenons.add(new Almomenon("وَلَوِ اتَّبَعَ الْحَقُّ أَهْوَاءَهُمْ لَفَسَدَتِ السَّمَاوَاتُ وَالْأَرْضُ وَمَنْ فِيهِنَّ بَلْ أَتَيْنَاهُمْ بِذِكْرِهِمْ فَهُمْ عَنْ ذِكْرِهِمْ مُعْرِضُونَ (71)"));
        almomenons.add(new Almomenon("أَمْ تَسْأَلُهُمْ خَرْجًا فَخَرَاجُ رَبِّكَ خَيْرٌ وَهُوَ خَيْرُ الرَّازِقِينَ (72)"));
        almomenons.add(new Almomenon("وَإِنَّكَ لَتَدْعُوهُمْ إِلَى صِرَاطٍ مُسْتَقِيمٍ (73)"));
        almomenons.add(new Almomenon("وَإِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْآَخِرَةِ عَنِ الصِّرَاطِ لَنَاكِبُونَ (74)"));
        almomenons.add(new Almomenon("وَلَوْ رَحِمْنَاهُمْ وَكَشَفْنَا مَا بِهِمْ مِنْ ضُرٍّ لَلَجُّوا فِي طُغْيَانِهِمْ يَعْمَهُونَ (75)"));
        almomenons.add(new Almomenon("وَلَقَدْ أَخَذْنَاهُمْ بِالْعَذَابِ فَمَا اسْتَكَانُوا لِرَبِّهِمْ وَمَا يَتَضَرَّعُونَ (76)"));
        almomenons.add(new Almomenon("حَتَّى إِذَا فَتَحْنَا عَلَيْهِمْ بَابًا ذَا عَذَابٍ شَدِيدٍ إِذَا هُمْ فِيهِ مُبْلِسُونَ (77)"));
        almomenons.add(new Almomenon("وَهُوَ الَّذِي أَنْشَأَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ قَلِيلًا مَا تَشْكُرُونَ (78)"));
        almomenons.add(new Almomenon("وَهُوَ الَّذِي ذَرَأَكُمْ فِي الْأَرْضِ وَإِلَيْهِ تُحْشَرُونَ (79)"));
        almomenons.add(new Almomenon("وَهُوَ الَّذِي يُحْيِي وَيُمِيتُ وَلَهُ اخْتِلَافُ اللَّيْلِ وَالنَّهَارِ أَفَلَا تَعْقِلُونَ (80)"));
        almomenons.add(new Almomenon("بَلْ قَالُوا مِثْلَ مَا قَالَ الْأَوَّلُونَ (81)"));
        almomenons.add(new Almomenon("قَالُوا أَئِذَا مِتْنَا وَكُنَّا تُرَابًا وَعِظَامًا أَئِنَّا لَمَبْعُوثُونَ (82)"));
        almomenons.add(new Almomenon("لَقَدْ وُعِدْنَا نَحْنُ وَآَبَاؤُنَا هَذَا مِنْ قَبْلُ إِنْ هَذَا إِلَّا أَسَاطِيرُ الْأَوَّلِينَ (83)"));
        almomenons.add(new Almomenon("قُلْ لِمَنِ الْأَرْضُ وَمَنْ فِيهَا إِنْ كُنْتُمْ تَعْلَمُونَ (84)"));
        almomenons.add(new Almomenon("سَيَقُولُونَ لِلَّهِ قُلْ أَفَلَا تَذَكَّرُونَ (85)"));
        almomenons.add(new Almomenon("قُلْ مَنْ رَبُّ السَّمَاوَاتِ السَّبْعِ وَرَبُّ الْعَرْشِ الْعَظِيمِ (86)"));
        almomenons.add(new Almomenon("سَيَقُولُونَ لِلَّهِ قُلْ أَفَلَا تَتَّقُونَ (87)"));
        almomenons.add(new Almomenon("قُلْ مَنْ بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَهُوَ يُجِيرُ وَلَا يُجَارُ عَلَيْهِ إِنْ كُنْتُمْ تَعْلَمُونَ (88)"));
        almomenons.add(new Almomenon("سَيَقُولُونَ لِلَّهِ قُلْ فَأَنَّى تُسْحَرُونَ (89)"));
        almomenons.add(new Almomenon("بَلْ أَتَيْنَاهُمْ بِالْحَقِّ وَإِنَّهُمْ لَكَاذِبُونَ (90)"));
        almomenons.add(new Almomenon("مَا اتَّخَذَ اللَّهُ مِنْ وَلَدٍ وَمَا كَانَ مَعَهُ مِنْ إِلَهٍ إِذًا لَذَهَبَ كُلُّ إِلَهٍ بِمَا خَلَقَ وَلَعَلَا بَعْضُهُمْ عَلَى بَعْضٍ سُبْحَانَ اللَّهِ عَمَّا يَصِفُونَ (91)"));
        almomenons.add(new Almomenon("عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَتَعَالَى عَمَّا يُشْرِكُونَ (92)"));
        almomenons.add(new Almomenon("قُلْ رَبِّ إِمَّا تُرِيَنِّي مَا يُوعَدُونَ (93)"));
        almomenons.add(new Almomenon("رَبِّ فَلَا تَجْعَلْنِي فِي الْقَوْمِ الظَّالِمِينَ (94)"));
        almomenons.add(new Almomenon("وَإِنَّا عَلَى أَنْ نُرِيَكَ مَا نَعِدُهُمْ لَقَادِرُونَ (95)"));
        almomenons.add(new Almomenon("ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ السَّيِّئَةَ نَحْنُ أَعْلَمُ بِمَا يَصِفُونَ (96)"));
        almomenons.add(new Almomenon("وَقُلْ رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ (97)"));
        almomenons.add(new Almomenon("وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ (98)"));
        almomenons.add(new Almomenon("حَتَّى إِذَا جَاءَ أَحَدَهُمُ الْمَوْتُ قَالَ رَبِّ ارْجِعُونِ (99)"));
        almomenons.add(new Almomenon("لَعَلِّي أَعْمَلُ صَالِحًا فِيمَا تَرَكْتُ كَلَّا إِنَّهَا كَلِمَةٌ هُوَ قَائِلُهَا وَمِنْ وَرَائِهِمْ بَرْزَخٌ إِلَى يَوْمِ يُبْعَثُونَ (100)"));
        almomenons.add(new Almomenon("فَإِذَا نُفِخَ فِي الصُّورِ فَلَا أَنْسَابَ بَيْنَهُمْ يَوْمَئِذٍ وَلَا يَتَسَاءَلُونَ (101)"));
        almomenons.add(new Almomenon("فَمَنْ ثَقُلَتْ مَوَازِينُهُ فَأُولَئِكَ هُمُ الْمُفْلِحُونَ (102)"));
        almomenons.add(new Almomenon("وَمَنْ خَفَّتْ مَوَازِينُهُ فَأُولَئِكَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ فِي جَهَنَّمَ خَالِدُونَ (103)"));
        almomenons.add(new Almomenon("تَلْفَحُ وُجُوهَهُمُ النَّارُ وَهُمْ فِيهَا كَالِحُونَ (104)"));
        almomenons.add(new Almomenon("أَلَمْ تَكُنْ آَيَاتِي تُتْلَى عَلَيْكُمْ فَكُنْتُمْ بِهَا تُكَذِّبُونَ (105)"));
        almomenons.add(new Almomenon("قَالُوا رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَالِّينَ (106)"));
        almomenons.add(new Almomenon("رَبَّنَا أَخْرِجْنَا مِنْهَا فَإِنْ عُدْنَا فَإِنَّا ظَالِمُونَ (107)"));
        almomenons.add(new Almomenon("قَالَ اخْسَئُوا فِيهَا وَلَا تُكَلِّمُونِ (108)"));
        almomenons.add(new Almomenon("إِنَّهُ كَانَ فَرِيقٌ مِنْ عِبَادِي يَقُولُونَ رَبَّنَا آَمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ (109)"));
        almomenons.add(new Almomenon("فَاتَّخَذْتُمُوهُمْ سِخْرِيًّا حَتَّى أَنْسَوْكُمْ ذِكْرِي وَكُنْتُمْ مِنْهُمْ تَضْحَكُونَ (110)"));
        almomenons.add(new Almomenon("إِنِّي جَزَيْتُهُمُ الْيَوْمَ بِمَا صَبَرُوا أَنَّهُمْ هُمُ الْفَائِزُونَ (111)"));
        almomenons.add(new Almomenon("قَالَ كَمْ لَبِثْتُمْ فِي الْأَرْضِ عَدَدَ سِنِينَ (112)"));
        almomenons.add(new Almomenon("قَالُوا لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ فَاسْأَلِ الْعَادِّينَ (113)"));
        almomenons.add(new Almomenon("قَالَ إِنْ لَبِثْتُمْ إِلَّا قَلِيلًا لَوْ أَنَّكُمْ كُنْتُمْ تَعْلَمُونَ (114)"));
        almomenons.add(new Almomenon("أَفَحَسِبْتُمْ أَنَّمَا خَلَقْنَاكُمْ عَبَثًا وَأَنَّكُمْ إِلَيْنَا لَا تُرْجَعُونَ (115)"));
        almomenons.add(new Almomenon("فَتَعَالَى اللَّهُ الْمَلِكُ الْحَقُّ لَا إِلَهَ إِلَّا هُوَ رَبُّ الْعَرْشِ الْكَرِيمِ (116)"));
        almomenons.add(new Almomenon("وَمَنْ يَدْعُ مَعَ اللَّهِ إِلَهًا آَخَرَ لَا بُرْهَانَ لَهُ بِهِ فَإِنَّمَا حِسَابُهُ عِنْدَ رَبِّهِ إِنَّهُ لَا يُفْلِحُ الْكَافِرُونَ (117)"));
        almomenons.add(new Almomenon("وَقُلْ رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ (118)"));

        quran_text_23_adapter = new quran_text_23_adapter(almomenons ,QuranText_23Activity.this);

        recyclerView = findViewById(R.id.rv_23);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranText_23Activity.this));
        recyclerView.setAdapter(quran_text_23_adapter);


    }

}