package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_54Activity extends AppCompatActivity {

    ArrayList<AlqamarEx> alqamarExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_54_adapter quran_explanation_54_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_54);

        alqamarExes.add(new AlqamarEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"));
        alqamarExes.add(new AlqamarEx("اقْتَرَبَتِ السَّاعَةُ وَانْشَقَّ الْقَمَرُ (1)"));
        alqamarExes.add(new AlqamarEx("دنت القيامة، وانفلق القمر فلقتين، حين سأل كفار «مكة» النبي صلى الله عليه وسلم أن يريهم آية، فدعا الله، فأراهم تلك الآية."));
        alqamarExes.add(new AlqamarEx("وَإِنْ يَرَوْا آيَةً يُعْرِضُوا وَيَقُولُوا سِحْرٌ مُسْتَمِرٌّ (2)"));
        alqamarExes.add(new AlqamarEx("وإن ير المشركون دليلا وبرهانًا على صدق الرسول محمد صلى الله عليه وسلم، يُعرضوا عن الإيمان به وتصديقه مكذبين منكرين، ويقولوا بعد ظهور الدليل: هذا سحر باطل ذاهب مضمحل لا دوام له."));
        alqamarExes.add(new AlqamarEx("وَكَذَّبُوا وَاتَّبَعُوا أَهْوَاءَهُمْ وَكُلُّ أَمْرٍ مُسْتَقِرٌّ (3)"));
        alqamarExes.add(new AlqamarEx("وكذَّبوا النبي صلى الله عليه وسلم، واتبعوا ضلالتهم وما دعتهم إليه أهواؤهم من التكذيب، وكلُّ أمر من خير أو شر واقع بأهله يوم القيامة عند ظهور الثواب والعقاب."));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ جَاءَهُمْ مِنَ الْأَنْبَاءِ مَا فِيهِ مُزْدَجَرٌ (4)"));
        alqamarExes.add(new AlqamarEx("ولقد جاء كفار قريش من أنباء الأمم المكذبة برسلها، وما حلَّ بها من العذاب، ما فيه كفاية لردعهم عن كفرهم وضلالهم."));
        alqamarExes.add(new AlqamarEx("حِكْمَةٌ بَالِغَةٌ فَمَا تُغْنِ النُّذُرُ (5)"));
        alqamarExes.add(new AlqamarEx("هذا القرآن الذي جاءهم حكمة عظيمة بالغة غايتها، فأي شيء تغني النذر عن قوم أعرضوا وكذَّبوا بها؟"));
        alqamarExes.add(new AlqamarEx("فَتَوَلَّ عَنْهُمْ يَوْمَ يَدْعُ الدَّاعِ إِلَى شَيْءٍ نُكُرٍ (6)"));
        alqamarExes.add(new AlqamarEx("فأعرض -أيها الرسول- عنهم، وانتظر بهم يومًا عظيمًا. يوم يدعو الملك بنفخه في «القرن» إلى أمر فظيع منكر، وهو موقف الحساب."));
        alqamarExes.add(new AlqamarEx("خُشَّعًا أَبْصَارُهُمْ يَخْرُجُونَ مِنَ الْأَجْدَاثِ كَأَنَّهُمْ جَرَادٌ مُنْتَشِرٌ (7)"));
        alqamarExes.add(new AlqamarEx("ذليلة أبصارهم يخرجون من القبور كأنهم في انتشارهم وسرعة سيرهم للحساب جرادٌ منتشر في الآفاق."));
        alqamarExes.add(new AlqamarEx("مُهْطِعِينَ إِلَى الدَّاعِ يَقُولُ الْكَافِرُونَ هَذَا يَوْمٌ عَسِرٌ (8)"));
        alqamarExes.add(new AlqamarEx("مسرعين إلى ما دُعُوا إليه، يقول الكافرون: هذا يوم عسر شديد الهول."));
        alqamarExes.add(new AlqamarEx("كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ فَكَذَّبُوا عَبْدَنَا وَقَالُوا مَجْنُونٌ وَازْدُجِرَ (9)"));
        alqamarExes.add(new AlqamarEx("كذَّبت قبل قومك -أيها الرسول- قوم نوح فكذَّبوا عبدنا نوحًا، وقالوا: هو مجنون، وانتهروه متوعدين إياه بأنواع الأذى، إن لم ينته عن دعوته."));
        alqamarExes.add(new AlqamarEx("فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانْتَصِرْ (10)"));
        alqamarExes.add(new AlqamarEx("فدعا نوح ربه أنِّي ضعيف عن مقاومة هؤلاء، فانتصر لي بعقاب من عندك على كفرهم بك."));
        alqamarExes.add(new AlqamarEx("فَفَتَحْنَا أَبْوَابَ السَّمَاءِ بِمَاءٍ مُنْهَمِرٍ (11)"));
        alqamarExes.add(new AlqamarEx("فأجبنا دعاءه، ففتحنا أبواب السماء بماء كثير متدفق."));
        alqamarExes.add(new AlqamarEx("وَفَجَّرْنَا الْأَرْضَ عُيُونًا فَالْتَقَى الْمَاءُ عَلَى أَمْرٍ قَدْ قُدِرَ (12)"));
        alqamarExes.add(new AlqamarEx("وشققنا الأرض عيونًا متفجرة بالماء، فالتقى ماء السماء وماء الأرض على إهلاكهم الذي قدَّره الله لهم؛ جزاء شركهم."));
        alqamarExes.add(new AlqamarEx("وَحَمَلْنَاهُ عَلَى ذَاتِ أَلْوَاحٍ وَدُسُرٍ (13)"));
        alqamarExes.add(new AlqamarEx("وحملنا نوحًا ومَن معه على سفينة ذات ألواح ومسامير شُدَّت بها."));
        alqamarExes.add(new AlqamarEx("تَجْرِي بِأَعْيُنِنَا جَزَاءً لِمَنْ كَانَ كُفِرَ (14)"));
        alqamarExes.add(new AlqamarEx("تجري بمرأى منا وحفظ، وأغرقنا المكذبين؛ جزاء لهم على كفرهم وانتصارًا لنوح عليه السلام.\n" +
                "وفي هذا دليل على إثبات صفة العينين لله سبحانه وتعالى، كما يليق به.\n"));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ تَرَكْنَاهَا آيَةً فَهَلْ مِنْ مُدَّكِرٍ (15)"));
        alqamarExes.add(new AlqamarEx("ولقد أبقينا قصة نوح مع قومه عبرة ودليلا على قدرتنا لمن بعد نوح؛ ليعتبروا ويتعظوا بما حلَّ بهذه الأمة التي كفرت بربها، فهل من متعظ يتعظ؟"));
        alqamarExes.add(new AlqamarEx("فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ (16)"));
        alqamarExes.add(new AlqamarEx("فكيف كان عذابي ونذري لمن كفر بي وكذب رسلي، ولم يتعظ بما جاءت به؟ إنه كان عظيمًا مؤلمًا."));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ (17)"));
        alqamarExes.add(new AlqamarEx("ولقد سَهَّلْنا لفظ القرآن للتلاوة والحفظ، ومعانيه للفهم والتدبر، لمن أراد أن يتذكر ويعتبر، فهل من متعظ به؟\n" +
                "وفي هذه الآية وما ناظرها من السورة حث على الاستنكار من تلاوة القرآن وتعلمه وتعليمه.\n"));
        alqamarExes.add(new AlqamarEx("كَذَّبَتْ عَادٌ فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ (18)"));
        alqamarExes.add(new AlqamarEx("كذبت عاد هودًا فعاقبناهم، فكيف كان عذابي لهم على كفرهم، ونذري على تكذيب رسولهم، وعدم الإيمان به؟ إنه كان عظيمًا مؤلمًا."));
        alqamarExes.add(new AlqamarEx("إِنَّا أَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي يَوْمِ نَحْسٍ مُسْتَمِرٍّ (19)"));
        alqamarExes.add(new AlqamarEx("إنَّا أرسلنا عليهم ريحًا شديدة البرد، في يوم شؤم مستمر عليهم بالعذاب والهلاك."));
        alqamarExes.add(new AlqamarEx("تَنْزِعُ النَّاسَ كَأَنَّهُمْ أَعْجَازُ نَخْلٍ مُنْقَعِرٍ (20)"));
        alqamarExes.add(new AlqamarEx("تقتلع الناس من مواضعهم على الأرض فترمي بهم على رؤوسهم، فتدق أعناقهم، ويفصل رؤوسهم عن أجسادهم، فتتركهم كالنخل المنقلع من أصله."));
        alqamarExes.add(new AlqamarEx("فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ (21)"));
        alqamarExes.add(new AlqamarEx("فكيف كان عذابي ونذري لمن كفر بي، وكذَّب رسلي ولم يؤمن بهم؟ إنه كان عظيمًا مؤلمًا."));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ (22)"));
        alqamarExes.add(new AlqamarEx("ولقد سَهَّلنا لفظ القرآن للتلاوة والحفظ، ومعانيه للفهم وللتدبر، لمن أراد أن يتذكر ويعتبر، فهل من متعظ به؟"));
        alqamarExes.add(new AlqamarEx("كَذَّبَتْ ثَمُودُ بِالنُّذُرِ (23)"));
        alqamarExes.add(new AlqamarEx("كذبت ثمود -وهم قوم صالح- بالآيات التي أُنذرِوا بها."));
        alqamarExes.add(new AlqamarEx("فَقَالُوا أَبَشَرًا مِنَّا وَاحِدًا نَتَّبِعُهُ إِنَّا إِذًا لَفِي ضَلَالٍ وَسُعُرٍ (24)"));
        alqamarExes.add(new AlqamarEx("فقالوا: أبشرًا منا واحدًا نتبعه نحن الجماعة الكثيرة وهو واحد؟ إنا إذا لفي بُعْدٍ عن الصواب وجنون."));
        alqamarExes.add(new AlqamarEx("أَأُلْقِيَ الذِّكْرُ عَلَيْهِ مِنْ بَيْنِنَا بَلْ هُوَ كَذَّابٌ أَشِرٌ (25)"));
        alqamarExes.add(new AlqamarEx("أأُنزل عليه الوحي وخُصَّ بالنبوة مِن بيننا، وهو واحد منا؟ بل هو كثير الكذب والتجبر."));
        alqamarExes.add(new AlqamarEx("سَيَعْلَمُونَ غَدًا مَنِ الْكَذَّابُ الْأَشِرُ (26)"));
        alqamarExes.add(new AlqamarEx("سَيَرون عند نزول العذاب بهم في الدنيا ويوم القيامة مَنِ الكذاب المتجبر؟"));
        alqamarExes.add(new AlqamarEx("إِنَّا مُرْسِلُو النَّاقَةِ فِتْنَةً لَهُمْ فَارْتَقِبْهُمْ وَاصْطَبِرْ (27)"));
        alqamarExes.add(new AlqamarEx("إنا مخرجو الناقة التي سألوها من الصخرة؛ اختبارًا لهم، فانتظر -يا صالح- ما يحلُّ بهم من العذاب، واصطبر على دعوتك إياهم وأذاهم لك."));
        alqamarExes.add(new AlqamarEx("وَنَبِّئْهُمْ أَنَّ الْمَاءَ قِسْمَةٌ بَيْنَهُمْ كُلُّ شِرْبٍ مُحْتَضَرٌ (28)"));
        alqamarExes.add(new AlqamarEx("وأخبرهم أن الماء مقسوم بين قومك والناقة: للناقة يوم، ولهم يوم، كل شِرْب يحضره مَن كانت قسمته، ويُحظر على من ليس بقسمة له."));
        alqamarExes.add(new AlqamarEx("فَنَادَوْا صَاحِبَهُمْ فَتَعَاطَى فَعَقَرَ (29)"));
        alqamarExes.add(new AlqamarEx("فنادوا صاحبهم بالحض على عقرها، فتناول الناقة بيده، فنحرها فعاقَبْتُهم."));
        alqamarExes.add(new AlqamarEx("فَكَيْفَ كَانَ عَذَابِي وَنُذُرِ (30)"));
        alqamarExes.add(new AlqamarEx("فكيف كان عقابي لهم على كفرهم، وإنذاري لمن عصى رسلي؟ إنه كان عظيماً مؤلماً."));
        alqamarExes.add(new AlqamarEx("إِنَّا أَرْسَلْنَا عَلَيْهِمْ صَيْحَةً وَاحِدَةً فَكَانُوا كَهَشِيمِ الْمُحْتَظِرِ (31)"));
        alqamarExes.add(new AlqamarEx("إنا أرسلنا عليهم جبريل، فصاح بهم صيحة واحدة، فبادوا عن آخرهم، فكانوا كالزرع اليابس سريع الانكسار الذي يُجْعل حِظارًا على الإبل والمواشي."));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ (32)"));
        alqamarExes.add(new AlqamarEx("ولقد سَهَّلْنا لفظ القرآن للتلاوة والحفظ، ومعانيه للفهم والتدبر لمن أراد أن يتذكر ويعتبر، فهل مِن متعظ به؟"));
        alqamarExes.add(new AlqamarEx("كَذَّبَتْ قَوْمُ لُوطٍ بِالنُّذُرِ (33)"));
        alqamarExes.add(new AlqamarEx("كذَّبت قوم لوط بآيات الله التي أنذِروا بها."));
        alqamarExes.add(new AlqamarEx("إِنَّا أَرْسَلْنَا عَلَيْهِمْ حَاصِبًا إِلَّا آلَ لُوطٍ نَجَّيْنَاهُمْ بِسَحَرٍ (34)"));
        alqamarExes.add(new AlqamarEx("إنا أرسلنا عليهم حجارةً إلا آل لوط، نجَّيناهم من العذاب في آخر الليل."));
        alqamarExes.add(new AlqamarEx("نِعْمَةً مِنْ عِنْدِنَا كَذَلِكَ نَجْزِي مَنْ شَكَرَ (35)"));
        alqamarExes.add(new AlqamarEx("نعمة من عندنا عليهم، كما أثبنا لوطًا وآله وأنعمنا عليهم، فأنجيناهم مِن عذابنا، نُثيب مَن آمن بنا وشكرنا."));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ أَنْذَرَهُمْ بَطْشَتَنَا فَتَمَارَوْا بِالنُّذُرِ (36)"));
        alqamarExes.add(new AlqamarEx("ولقد خوَّف لوط قومه بأس الله وعذابه، فلم يسمعوا له، بل شكُّوا في ذلك، وكذَّبوه."));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ رَاوَدُوهُ عَنْ ضَيْفِهِ فَطَمَسْنَا أَعْيُنَهُمْ فَذُوقُوا عَذَابِي وَنُذُرِ (37)"));
        alqamarExes.add(new AlqamarEx("ولقد طلبوا منه أن يفعلوا الفاحشة بضيوفه من الملائكة، فطمسنا أعينهم فلم يُبصروا شيئًا، فقيل لهم: ذوقوا عذابي وإنذاري الذي أنذركم به لوط عليه السلام."));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ صَبَّحَهُمْ بُكْرَةً عَذَابٌ مُسْتَقِرٌّ (38)"));
        alqamarExes.add(new AlqamarEx("ولقد جاءهم وقت الصباح عذاب دائم استقر فيهم حتى يُفضي بهم إلى عذاب الآخرة، وذلك العذاب هو رجمهم بالحجارة وقلب قُراهم وجعل أعلاها أسفلها."));
        alqamarExes.add(new AlqamarEx("فَذُوقُوا عَذَابِي وَنُذُرِ (39)"));
        alqamarExes.add(new AlqamarEx("فقيل لهم: ذوقوا عذابي الذي أنزلته بكم؛ لكفركم وتكذيبكم، وإنذاري الذي أنذركم به لوط عليه السلام."));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ يَسَّرْنَا الْقُرْآنَ لِلذِّكْرِ فَهَلْ مِنْ مُدَّكِرٍ (40)"));
        alqamarExes.add(new AlqamarEx("ولقد سَهَّلْنا لفظ القرآن للتلاوة والحفظ، ومعانيه للفهم والتدبر لمن أراد أن يتذكر، فهل مِن متعظ به؟"));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ جَاءَ آلَ فِرْعَوْنَ النُّذُرُ (41)"));
        alqamarExes.add(new AlqamarEx("ولقد جاء أتباعَ فرعون وقومَه إنذارُنا بالعقوبة لهم على كفرهم."));
        alqamarExes.add(new AlqamarEx("كَذَّبُوا بِآيَاتِنَا كُلِّهَا فَأَخَذْنَاهُمْ أَخْذَ عَزِيزٍ مُقْتَدِرٍ (42)"));
        alqamarExes.add(new AlqamarEx("كذَّبوا بأدلتنا كلها الدالة على وحدانيتنا ونبوة أنبيائنا، فعاقبناهم بالعذاب عقوبة عزيز لا يغالَب، مقتدر على ما يشاء."));
        alqamarExes.add(new AlqamarEx("أَكُفَّارُكُمْ خَيْرٌ مِنْ أُولَئِكُمْ أَمْ لَكُمْ بَرَاءَةٌ فِي الزُّبُرِ (43)"));
        alqamarExes.add(new AlqamarEx("أكفاركم -يا معشر قريش- خير مِنَ الذين تقدَّم ذكرهم ممن هلكوا بسبب تكذيبهم، أم لكم براءة مِن عقاب الله في الكتب المنزلة على الأنبياء بالسلامة من العقوبة؟"));
        alqamarExes.add(new AlqamarEx("أَمْ يَقُولُونَ نَحْنُ جَمِيعٌ مُنْتَصِرٌ (44)"));
        alqamarExes.add(new AlqamarEx("بل أيقول كفار «مكة» : نحن أولو حزم ورأي وأمرنا مجتمع، فنحن جماعة منتصرة لا يغلبنا من أرادنا بسوء؟"));
        alqamarExes.add(new AlqamarEx("سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ (45)"));
        alqamarExes.add(new AlqamarEx("سيهزم جمع كفار «مكة» أمام المؤمنين، ويولُّون الأدبار، وقد حدث هذا يوم «بدر» ."));
        alqamarExes.add(new AlqamarEx("بَلِ السَّاعَةُ مَوْعِدُهُمْ وَالسَّاعَةُ أَدْهَى وَأَمَرُّ (46)"));
        alqamarExes.add(new AlqamarEx("والساعة موعدهم الذي يُجازون فيه بما يستحقون، والساعة أعظم وأقسى مما لحقهم من العذاب يوم «بدر» ."));
        alqamarExes.add(new AlqamarEx("إِنَّ الْمُجْرِمِينَ فِي ضَلَالٍ وَسُعُرٍ (47)"));
        alqamarExes.add(new AlqamarEx("إن المجرمين في تيه عن الحق وعناء وعذاب."));
        alqamarExes.add(new AlqamarEx("يَوْمَ يُسْحَبُونَ فِي النَّارِ عَلَى وُجُوهِهِمْ ذُوقُوا مَسَّ سَقَرَ (48)"));
        alqamarExes.add(new AlqamarEx("يوم يُجرُّون في النار على وجوههم، ويقال لهم: ذوقوا شدة عذاب جهنم."));
        alqamarExes.add(new AlqamarEx("إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ (49)"));
        alqamarExes.add(new AlqamarEx("إنَّا كل شيء خلقناه بمقدار قدرناه وقضيناه، وسبق علمنا به، وكتابتنا له في اللوح المحفوظ."));
        alqamarExes.add(new AlqamarEx("وَمَا أَمْرُنَا إِلَّا وَاحِدَةٌ كَلَمْحٍ بِالْبَصَرِ (50)"));
        alqamarExes.add(new AlqamarEx("وما أمرنا للشيء إذا أردناه إلا أن نقول قولة واحدة وهي «كن» ، فيكون كلمح البصر، لا يتأخر طرفة عين."));
        alqamarExes.add(new AlqamarEx("وَلَقَدْ أَهْلَكْنَا أَشْيَاعَكُمْ فَهَلْ مِنْ مُدَّكِرٍ (51)"));
        alqamarExes.add(new AlqamarEx("ولقد أهلكنا أشباهكم في الكفر من الأمم الخالية، فهل من متعظ بما حلَّ بهم من النَّكال والعذاب؟"));
        alqamarExes.add(new AlqamarEx("وَكُلُّ شَيْءٍ فَعَلُوهُ فِي الزُّبُرِ (52)"));
        alqamarExes.add(new AlqamarEx("وكل شيء فعله أشباهكم الماضون من خير أو شرٍّ مكتوب في الكتب التي كتبتها الحفظة."));
        alqamarExes.add(new AlqamarEx("وَكُلُّ صَغِيرٍ وَكَبِيرٍ مُسْتَطَرٌ (53)"));
        alqamarExes.add(new AlqamarEx("وكل صغير وكبير من أعمالهم مُسَطَّر في صحائفهم، وسيجازون به."));
        alqamarExes.add(new AlqamarEx("إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَهَرٍ (54)"));
        alqamarExes.add(new AlqamarEx("إن المتقين في بساتين عظيمة، وأنهار واسعة يوم القيامة."));
        alqamarExes.add(new AlqamarEx("فِي مَقْعَدِ صِدْقٍ عِنْدَ مَلِيكٍ مُقْتَدِرٍ (55)"));
        alqamarExes.add(new AlqamarEx("في مجلس حق، لا لغو فيه ولا تأثيم عند الله المَلِك العظيم، الخالق للأشياء كلها، المقتدر على كل شيء تبارك وتعالى."));



        quran_explanation_54_adapter = new quran_explanation_54_adapter(alqamarExes ,QuranExplanation_54Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_54);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_54Activity.this));
        recyclerView.setAdapter(quran_explanation_54_adapter);


    }

}