package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_72Activity extends AppCompatActivity {

    ArrayList<AlgenEx> algenExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_72_adapter quran_explanation_72_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_72);

        algenExes.add(new AlgenEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"));
        algenExes.add(new AlgenEx("قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا (1)"));
        algenExes.add(new AlgenEx("قل -أيها الرسول-: أوحى الله إليَّ أنَّ جماعة من الجن قد استمعوا لتلاوتي للقرآن، فلما سمعوه قالوا لقومهم: إنا سمعنا قرآنًا بديعًا في بلاغته وفصاحته وحكمه وأحكامه وأخباره."));
        algenExes.add(new AlgenEx("يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا (2)"));
        algenExes.add(new AlgenEx("يدعو إلى الحق والهدى، فصدَّقنا بهذا القرآن وعملنا به، ولن نشرك بربنا الذي خلقنا أحدًا في عبادته."));
        algenExes.add(new AlgenEx("وَأَنَّهُ تَعَالَى جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا (3)"));
        algenExes.add(new AlgenEx("وأنه تعالَتْ عظمة ربنا وجلاله، ما اتخذ زوجة ولا ولدًا."));
        algenExes.add(new AlgenEx("وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى اللَّهِ شَطَطًا (4)"));
        algenExes.add(new AlgenEx("وأن سفيهنا -وهو إبليس- كان يقول على الله تعالى قولا بعيدًا عن الحق والصواب، مِن دعوى الصاحبة والولد."));
        algenExes.add(new AlgenEx("وَأَنَّا ظَنَنَّا أَنْ لَنْ تَقُولَ الْإِنْسُ وَالْجِنُّ عَلَى اللَّهِ كَذِبًا (5)"));
        algenExes.add(new AlgenEx("وأنَّا حَسِبْنا أن أحدًا لن يكذب على الله تعالى، لا من الإنس ولا من الجن في نسبة الصاحبة والولد إليه."));
        algenExes.add(new AlgenEx("وَأَنَّهُ كَانَ رِجَالٌ مِنَ الْإِنْسِ يَعُوذُونَ بِرِجَالٍ مِنَ الْجِنِّ فَزَادُوهُمْ رَهَقًا (6)"));
        algenExes.add(new AlgenEx("وأنه كان رجال من الإنس يستجيرون برجال من الجن، فزاد رجالُ الجنِّ الإنسَ باستعاذتهم بهم خوفًا وإرهابًا ورعبًا.\n" +
                "وهذه الاستعاذة بغير الله، التي نعاها الله على أهل الجاهلية، من الشرك الأكبر، الذي لا يغفره الله إلا بالتوبة النصوح منه. وفي الآية تحذير شديد من اللجوء إلى السحرة والمشعوذين وأشباههم.\n"));
        algenExes.add(new AlgenEx("وَأَنَّهُمْ ظَنُّوا كَمَا ظَنَنْتُمْ أَنْ لَنْ يَبْعَثَ اللَّهُ أَحَدًا (7)"));
        algenExes.add(new AlgenEx("وأن كفار الإنس حسبوا كما حسبتم -يا معشر الجن- أن الله تعالى لن يبعث أحدًا بعد الموت."));
        algenExes.add(new AlgenEx("وَأَنَّا لَمَسْنَا السَّمَاءَ فَوَجَدْنَاهَا مُلِئَتْ حَرَسًا شَدِيدًا وَشُهُبًا (8)"));
        algenExes.add(new AlgenEx("وأنَّا -معشر الجن- طلبنا بلوغ السماء؛ لاستماع كلام أهلها، فوجدناها مُلئت بالملائكة الكثيرين الذين يحرسونها، وبالشهب المحرقة التي يُرمى بها مَن يقترب منها."));
        algenExes.add(new AlgenEx("وَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ فَمَنْ يَسْتَمِعِ الْآنَ يَجِدْ لَهُ شِهَابًا رَصَدًا (9)"));
        algenExes.add(new AlgenEx("وأنا كنا قبل ذلك نتخذ من السماء مواضع; لنستمع إلى أخبارها، فمن يحاول الآن استراق السمع يجد له شهابًا بالمرصاد، يُحرقه ويهلكه. وفي هاتين الآيتين إبطال مزاعم السحرة والمشعوذين، الذين يدَّعون علم الغيب، ويغررون بضعفة العقول؛ بكذبهم وافترائهم."));
        algenExes.add(new AlgenEx("وَأَنَّا لَا نَدْرِي أَشَرٌّ أُرِيدَ بِمَنْ فِي الْأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا (10)"));
        algenExes.add(new AlgenEx("وأننا -معشر الجن- لا نعلم: أشرًّا أراد الله أن ينزله بأهل الأرض، أم أراد بهم خيرًا وهدى؟"));
        algenExes.add(new AlgenEx("وَأَنَّا مِنَّا الصَّالِحُونَ وَمِنَّا دُونَ ذَلِكَ كُنَّا طَرَائِقَ قِدَدًا (11)"));
        algenExes.add(new AlgenEx("وأنا منا الأبرار المتقون، ومنا قوم دون ذلك كفار وفساق، كنا فرقًا ومذاهب مختلفة."));
        algenExes.add(new AlgenEx("وَأَنَّا ظَنَنَّا أَنْ لَنْ نُعْجِزَ اللَّهَ فِي الْأَرْضِ وَلَنْ نُعْجِزَهُ هَرَبًا (12)"));
        algenExes.add(new AlgenEx("وأنا أيقنا أن الله قادر علينا، وأننا في قبضته وسلطانه، فلن نفوته إذا أراد بنا أمرًا أينما كنا، ولن نستطيع أن نُفْلِت مِن عقابه هربًا إلى السماء، إن أراد بنا سوءًا."));
        algenExes.add(new AlgenEx("وَأَنَّا لَمَّا سَمِعْنَا الْهُدَى آمَنَّا بِهِ فَمَنْ يُؤْمِنْ بِرَبِّهِ فَلَا يَخَافُ بَخْسًا وَلَا رَهَقًا (13)"));
        algenExes.add(new AlgenEx("وإنا لما سمعنا القرآن آمنَّا به، وأقررنا أنه حق مِن عند الله، فمن يؤمن بربه، فإنه لا يخشى نقصانًا من حسناته، ولا ظلمًا يلحقه بزيادة في سيئاته."));
        algenExes.add(new AlgenEx("وَأَنَّا مِنَّا الْمُسْلِمُونَ وَمِنَّا الْقَاسِطُونَ فَمَنْ أَسْلَمَ فَأُولَئِكَ تَحَرَّوْا رَشَدًا (14)"));
        algenExes.add(new AlgenEx("وأنا منا الخاضعون لله بالطاعة، ومنا الجائرون الظالمون الذين حادوا عن طريق الحق، فمن أسلم وخضع لله بالطاعة، فأولئك الذين قصدوا طريق الحق والصواب، واجتهدوا في اختياره فهداهم الله إليه."));
        algenExes.add(new AlgenEx("وَأَمَّا الْقَاسِطُونَ فَكَانُوا لِجَهَنَّمَ حَطَبًا (15)"));
        algenExes.add(new AlgenEx("وأما الجائرون عن طريق الإسلام فكانوا وَقودًا لجهنم."));
        algenExes.add(new AlgenEx("وَأَلَّوِ اسْتَقَامُوا عَلَى الطَّرِيقَةِ لَأَسْقَيْنَاهُمْ مَاءً غَدَقًا (16)"));
        algenExes.add(new AlgenEx("وأنه لو سار الكفار من الإنس والجن على طريقة الإسلام، ولم يحيدوا عنها لأنزلنا عليهم ماءً كثيرًا، ولوسَّعنا عليهم الرزق في الدنيا."));
        algenExes.add(new AlgenEx("لِنَفْتِنَهُمْ فِيهِ وَمَنْ يُعْرِضْ عَنْ ذِكْرِ رَبِّهِ يَسْلُكْهُ عَذَابًا صَعَدًا (17)"));
        algenExes.add(new AlgenEx("لنختبرهم: كيف يشكرون نعم الله عليهم؟ ومن يُعرض عن طاعة ربه واستماع القرآن وتدبره، والعمل به يدخله عذابًا شديدًا شاقًّا."));
        algenExes.add(new AlgenEx("وَأَنَّ الْمَسَاجِدَ لِلَّهِ فَلَا تَدْعُوا مَعَ اللَّهِ أَحَدًا (18)"));
        algenExes.add(new AlgenEx("وأن المساجد لعبادة الله وحده، فلا تعبدوا فيها غيره، وأخلصوا له الدعاء والعبادة فيها؛ فإن المساجد لم تُبْنَ إلا ليُعبَدَ اللهُ وحده فيها، دون من سواه، وفي هذا وجوب تنزيه المساجد من كل ما يشوب الإخلاص لله، ومتابعة رسوله محمد صلى الله عليه وسلم."));
        algenExes.add(new AlgenEx("وَأَنَّهُ لَمَّا قَامَ عَبْدُ اللَّهِ يَدْعُوهُ كَادُوا يَكُونُونَ عَلَيْهِ لِبَدًا (19)"));
        algenExes.add(new AlgenEx("وأنه لما قام محمد صلى الله عليه وسلم، يعبد ربه، كاد الجن يكونون عليه جماعات متراكمة، بعضها فوق بعض ; مِن شدة ازدحامهم لسماع القرآن منه."));
        algenExes.add(new AlgenEx("قُلْ إِنَّمَا أَدْعُو رَبِّي وَلَا أُشْرِكُ بِهِ أَحَدًا (20)"));
        algenExes.add(new AlgenEx("قل -أيها الرسول- لهؤلاء الكفار: إنما أعبد ربي وحده، ولا أشرك معه في العبادة أحدًا."));
        algenExes.add(new AlgenEx("قُلْ إِنِّي لَا أَمْلِكُ لَكُمْ ضَرًّا وَلَا رَشَدًا (21)"));
        algenExes.add(new AlgenEx("قل -أيها الرسول- لهم: إني لا أقدر أن أدفع عنكم ضرًا، ولا أجلب لكم نفعًا."));
        algenExes.add(new AlgenEx("قُلْ إِنِّي لَنْ يُجِيرَنِي مِنَ اللَّهِ أَحَدٌ وَلَنْ أَجِدَ مِنْ دُونِهِ مُلْتَحَدًا (22)"));
        algenExes.add(new AlgenEx("قل: إني لن ينقذني من عذاب الله أحد إن عصيته، ولن أجد من دونه ملجأ أفرُّ إليه مِن عذابه."));
        algenExes.add(new AlgenEx("إِلَّا بَلَاغًا مِنَ اللَّهِ وَرِسَالَاتِهِ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ فَإِنَّ لَهُ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا أَبَدًا (23)"));
        algenExes.add(new AlgenEx("لكن أملك أن أبلغكم عن الله ما أمرني بتبليغه لكم، ورسالتَه التي أرسلني بها إليكم. ومَن يعص الله ورسوله، ويُعرض عن دين الله، فإن جزاءه نار جهنم لا يخرج منها أبدًا."));
        algenExes.add(new AlgenEx("حَتَّى إِذَا رَأَوْا مَا يُوعَدُونَ فَسَيَعْلَمُونَ مَنْ أَضْعَفُ نَاصِرًا وَأَقَلُّ عَدَدًا (24)"));
        algenExes.add(new AlgenEx("حتى إذا أبصر المشركون ما يوعدون به من العذاب، فسيعلمون عند حلوله بهم: مَن أضعف ناصرًا ومعينًا وأقل جندًا؟"));
        algenExes.add(new AlgenEx("قُلْ إِنْ أَدْرِي أَقَرِيبٌ مَا تُوعَدُونَ أَمْ يَجْعَلُ لَهُ رَبِّي أَمَدًا (25)"));
        algenExes.add(new AlgenEx("قل -أيها الرسول- لهؤلاء المشركين: ما أدري أهذا العذاب الذي وُعدتم به قريب زمنه، أم يجعل له ربي مدة طويلة؟"));
        algenExes.add(new AlgenEx("عَالِمُ الْغَيْبِ فَلَا يُظْهِرُ عَلَى غَيْبِهِ أَحَدًا (26)"));
        algenExes.add(new AlgenEx("وهو سبحانه عالم بما غاب عن الأبصار، فلا يظهر على غيبه أحدًا من خلقه."));
        algenExes.add(new AlgenEx("إِلَّا مَنِ ارْتَضَى مِنْ رَسُولٍ فَإِنَّهُ يَسْلُكُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَدًا (27)"));
        algenExes.add(new AlgenEx("إلا من اختاره الله لرسالته وارتضاه، فإنه يُطلعهم على بعض الغيب، ويرسل من أمام الرسول ومن خلفه ملائكة يحفظونه من الجن; لئلا يسترقوه ويهمسوا به إلى الكهنة."));
        algenExes.add(new AlgenEx("لِيَعْلَمَ أَنْ قَدْ أَبْلَغُوا رِسَالَاتِ رَبِّهِمْ وَأَحَاطَ بِمَا لَدَيْهِمْ وَأَحْصَى كُلَّ شَيْءٍ عَدَدًا (28)"));
        algenExes.add(new AlgenEx("ليعلم الرسول صلى الله عليه وسلم، أن الرسل قبله كانوا على مثل حاله من التبليغ بالحق والصدق، وأنه حُفظ كما حُفظوا من الجن، وأن الله سبحانه أحاط علمه بما عندهم ظاهرًا وباطنًا من الشرائع والأحكام وغيرها، لا يفوته منها شيء، وأنه تعالى أحصى كل شيء عددًا، فلم يَخْفَ عليه منه شيء."));

        quran_explanation_72_adapter = new quran_explanation_72_adapter(algenExes ,QuranExplanation_72Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_72);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_72Activity.this));
        recyclerView.setAdapter(quran_explanation_72_adapter);


    }

}