package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_31Activity extends AppCompatActivity {

    ArrayList<LoqmanEx> loqmanExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_31_adapter quran_explanation_31_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_31);

        loqmanExes.add(new LoqmanEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"));
        loqmanExes.add(new LoqmanEx("الم (1)"));
        loqmanExes.add(new LoqmanEx("(الم) سبق الكلام على الحروف المقطَّعة في أول سورة البقرة."));
        loqmanExes.add(new LoqmanEx("تِلْكَ آيَاتُ الْكِتَابِ الْحَكِيمِ (2)"));
        loqmanExes.add(new LoqmanEx("هذه الآيات آيات القرآن ذي الحكمة البالغة."));
        loqmanExes.add(new LoqmanEx("هُدًى وَرَحْمَةً لِلْمُحْسِنِينَ (3)"));
        loqmanExes.add(new LoqmanEx("هذه الآيات هدى ورحمة للذين أحسنوا العمل بما أنزل الله في القرآن، وما أمرهم به رسوله محمد صلى الله عليه وسلم."));
        loqmanExes.add(new LoqmanEx("الَّذِينَ يُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ يُوقِنُونَ (4)"));
        loqmanExes.add(new LoqmanEx("الذين يؤدون الصلاة كاملة في أوقاتها ويؤتون الزكاة المفروضة عليهم لمستحقيها، وهم بالبعث والجزاء في الدار الآخرة يوقنون."));
        loqmanExes.add(new LoqmanEx("أُولَئِكَ عَلَى هُدًى مِنْ رَبِّهِمْ وَأُولَئِكَ هُمُ الْمُفْلِحُونَ (5)"));
        loqmanExes.add(new LoqmanEx("أولئك المتصفون بالصفات السابقة على بيان مِن ربهم ونور، وأولئك هم الفائزون في الدنيا والآخرة."));
        loqmanExes.add(new LoqmanEx("وَمِنَ النَّاسِ مَنْ يَشْتَرِي لَهْوَ الْحَدِيثِ لِيُضِلَّ عَنْ سَبِيلِ اللَّهِ بِغَيْرِ عِلْمٍ وَيَتَّخِذَهَا هُزُوًا أُولَئِكَ لَهُمْ عَذَابٌ مُهِينٌ (6)"));
        loqmanExes.add(new LoqmanEx("ومن الناس مَن يشتري لَهْو الحديث -وهو كل ما يُلهي عن طاعة الله ويصد عن مرضاته- ليضلَّ الناس عن طريق الهدى إلى طريق الهوى، ويتخذ آيات الله سخرية، أولئك لهم عذاب يهينهم ويخزيهم."));
        loqmanExes.add(new LoqmanEx("وَإِذَا تُتْلَى عَلَيْهِ آيَاتُنَا وَلَّى مُسْتَكْبِرًا كَأَنْ لَمْ يَسْمَعْهَا كَأَنَّ فِي أُذُنَيْهِ وَقْرًا فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ (7)"));
        loqmanExes.add(new LoqmanEx("وإذا تتلى عليه آيات القرآن أعرض عن طاعة الله، وتكبَّر غير معتبر، كأنه لم يسمع شيئًا، كأَنَّ في أذنيه صممًا، ومَن هذه حاله فبشِّره -أيها الرسول- بعذاب مؤلم موجع في النار يوم القيامة."));
        loqmanExes.add(new LoqmanEx("إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتُ النَّعِيمِ (8)"));
        loqmanExes.add(new LoqmanEx("إن الذين آمنوا بالله ورسوله وعملوا الصالحات التي أُمروا بها، أولئك لهم نعيم مقيم في الجنات."));
        loqmanExes.add(new LoqmanEx("خَالِدِينَ فِيهَا وَعْدَ اللَّهِ حَقًّا وَهُوَ الْعَزِيزُ الْحَكِيمُ (9)"));
        loqmanExes.add(new LoqmanEx("وحياتهم في تلك الجنات حياة أبديةٌ لا تنقطع ولا تزول، وعدهم الله بذلك وعدًا حقًا. وهو سبحانه لا يُخلف وعده، وهو العزيز في أمره، الحكيم في تدبيره."));
        loqmanExes.add(new LoqmanEx("خَلَقَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا وَأَلْقَى فِي الْأَرْضِ رَوَاسِيَ أَنْ تَمِيدَ بِكُمْ وَبَثَّ فِيهَا مِنْ كُلِّ دَابَّةٍ وَأَنْزَلْنَا مِنَ السَّمَاءِ مَاءً فَأَنْبَتْنَا فِيهَا مِنْ كُلِّ زَوْجٍ كَرِيمٍ (10)"));
        loqmanExes.add(new LoqmanEx("خلق الله السموات، ورفعها بغير عمد كما تشاهدونها، وألقى في الأرض جبالا ثابتة؛ لئلا تضطرب وتتحرك فتفسد حياتكم، ونشر في الأرض مختلف أنواع الدواب، وأنزلنا من السحاب مطرًا، فأنبتنا به من الأرض من كل زوج بهيج نافع حسن المنظر."));
        loqmanExes.add(new LoqmanEx("هَذَا خَلْقُ اللَّهِ فَأَرُونِي مَاذَا خَلَقَ الَّذِينَ مِنْ دُونِهِ بَلِ الظَّالِمُونَ فِي ضَلَالٍ مُبِينٍ (11)"));
        loqmanExes.add(new LoqmanEx("وكل ما تشاهدونه هو خلق الله، فأروني -أيها المشركون-: ماذا خلقت آلهتكم التي تعبدونها من دون الله؟ بل المشركون في ذهاب بيِّن عن الحق والاستقامة."));
        loqmanExes.add(new LoqmanEx("وَلَقَدْ آتَيْنَا لُقْمَانَ الْحِكْمَةَ أَنِ اشْكُرْ لِلَّهِ وَمَنْ يَشْكُرْ فَإِنَّمَا يَشْكُرُ لِنَفْسِهِ وَمَنْ كَفَرَ فَإِنَّ اللَّهَ غَنِيٌّ حَمِيدٌ (12)"));
        loqmanExes.add(new LoqmanEx("ولقد أعطينا عبدًا صالحًا من عبادنا (وهو لقمان) الحكمة، وهي الفقه في الدين وسلامة العقل والإصابة في القول، وقلنا له: اشكر لله نِعَمَه عليك، ومَن يشكر لربه فإنما يعود نَفْع ذلك عليه، ومن جحد نِعَمَه فإن الله غني عن شكره، غير محتاج إليه، له الحمد والثناء على كل حال."));
        loqmanExes.add(new LoqmanEx("وَإِذْ قَالَ لُقْمَانُ لِابْنِهِ وَهُوَ يَعِظُهُ يَابُنَيَّ لَا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ (13)"));
        loqmanExes.add(new LoqmanEx("واذكر -أيها الرسول- نصيحة لقمان لابنه حين قال له واعظًا: يا بنيَّ لا تشرك بالله فتظلم نفسك؛ إن الشرك لأعظم الكبائر وأبشعها."));
        loqmanExes.add(new LoqmanEx("وَوَصَّيْنَا الْإِنْسَانَ بِوَالِدَيْهِ حَمَلَتْهُ أُمُّهُ وَهْنًا عَلَى وَهْنٍ وَفِصَالُهُ فِي عَامَيْنِ أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ (14)"));
        loqmanExes.add(new LoqmanEx("وأَمَرْنا الإنسان ببرِّ والديه والإحسان إليهما، حَمَلَتْه أمه ضعفًا على ضعف، وحمله وفِطامه عن الرضاعة في مدة عامين، وقلنا له: اشكر لله، ثم اشكر لوالديك، إليَّ المرجع فأُجازي كُلا بما يستحق."));
        loqmanExes.add(new LoqmanEx("وَإِنْ جَاهَدَاكَ عَلَى أَنْ تُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا وَصَاحِبْهُمَا فِي الدُّنْيَا مَعْرُوفًا وَاتَّبِعْ سَبِيلَ مَنْ أَنَابَ إِلَيَّ ثُمَّ إِلَيَّ مَرْجِعُكُمْ فَأُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ (15)"));
        loqmanExes.add(new LoqmanEx("وإن جاهدك -أيها الولد المؤمن- والداك على أن تشرك بي غيري في عبادتك إياي مما ليس لك به عِلم، أو أمراك بمعصية مِن معاصي الله فلا تطعهما؛ لأنه لا طاعة لمخلوق في معصية الخالق، وصاحبهما في الدنيا بالمعروف فيما لا إثم فيه، واسلك -أيها الابن المؤمن- طريق مَن تاب من ذنبه، ورجع إليَّ وآمن برسولي محمد صلى الله عليه وسلم، ثم إليَّ مرجعكم، فأخبركم بما كنتم تعملونه في الدنيا، وأجازي كلَّ عامل بعمله."));
        loqmanExes.add(new LoqmanEx("يَابُنَيَّ إِنَّهَا إِنْ تَكُ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ فَتَكُنْ فِي صَخْرَةٍ أَوْ فِي السَّمَاوَاتِ أَوْ فِي الْأَرْضِ يَأْتِ بِهَا اللَّهُ إِنَّ اللَّهَ لَطِيفٌ خَبِيرٌ (16)"));
        loqmanExes.add(new LoqmanEx("يا بنيَّ اعلم أن السيئة أو الحسنة إن كانت قَدْر حبة خردل -وهي المتناهية في الصغر- في باطن جبل، أو في أي مكان في السموات أو في الأرض، فإن الله يأتي بها يوم القيامة، ويحاسِب عليها. إن الله لطيف بعباده خبير بأعمالهم."));
        loqmanExes.add(new LoqmanEx("يَابُنَيَّ أَقِمِ الصَّلَاةَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنْكَرِ وَاصْبِرْ عَلَى مَا أَصَابَكَ إِنَّ ذَلِكَ مِنْ عَزْمِ الْأُمُورِ (17)"));
        loqmanExes.add(new LoqmanEx("يا بنيَّ أقم الصلاة تامة بأركانها وشروطها وواجباتها، وأْمر بالمعروف، وانْه عن المنكر بلطفٍ ولينٍ وحكمة بحسب جهدك، وتحمَّل ما يصيبك من الأذى مقابل أمرك بالمعروف ونهيك عن المنكر، واعلم أن هذه الوصايا مما أمر الله به من الأمور التي ينبغي الحرص عليها."));
        loqmanExes.add(new LoqmanEx("وَلَا تُصَعِّرْ خَدَّكَ لِلنَّاسِ وَلَا تَمْشِ فِي الْأَرْضِ مَرَحًا إِنَّ اللَّهَ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ (18)"));
        loqmanExes.add(new LoqmanEx("ولا تُمِلْ وجهك عن الناس إذا كلَّمتهم أو كلموك؛ احتقارًا منك لهم واستكبارًا عليهم، ولا تمش في الأرض بين الناس مختالا متبخترًا، إن الله لا يحب كل متكبر متباه في نفسه وهيئته وقوله."));
        loqmanExes.add(new LoqmanEx("وَاقْصِدْ فِي مَشْيِكَ وَاغْضُضْ مِنْ صَوْتِكَ إِنَّ أَنْكَرَ الْأَصْوَاتِ لَصَوْتُ الْحَمِيرِ (19)"));
        loqmanExes.add(new LoqmanEx("وتواضع في مشيك، واخفض من صوتك فلا ترفعه، إن أقبح الأصوات وأبغضها لصوت الحمير المعروفة ببلادتها وأصواتها المرتفعة."));
        loqmanExes.add(new LoqmanEx("أَلَمْ تَرَوْا أَنَّ اللَّهَ سَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَأَسْبَغَ عَلَيْكُمْ نِعَمَهُ ظَاهِرَةً وَبَاطِنَةً وَمِنَ النَّاسِ مَنْ يُجَادِلُ فِي اللَّهِ بِغَيْرِ عِلْمٍ وَلَا هُدًى وَلَا كِتَابٍ مُنِيرٍ (20)"));
        loqmanExes.add(new LoqmanEx("ألم تروا -أيها الناس- أن الله ذلَّل لكم ما في السموات من الشمس والقمر والسحاب وغير ذلك، وما في الأرض من الدوابِّ والشجر والماء، وغير ذلك مما لا يحصى، وعمَّكم بنعمه الظاهرة على الأبدان والجوارح، والباطنة في العقول والقلوب، وما ادَّخره لكم مما لا تعلمونه؟ ومن الناس مَن يجادل في توحيد الله وإخلاص العبادة له بغير حجة ولا بيان، ولا كتاب مبين يبيِّن حقيقة دعواه."));
        loqmanExes.add(new LoqmanEx("وَإِذَا قِيلَ لَهُمُ اتَّبِعُوا مَا أَنْزَلَ اللَّهُ قَالُوا بَلْ نَتَّبِعُ مَا وَجَدْنَا عَلَيْهِ آبَاءَنَا أَوَلَوْ كَانَ الشَّيْطَانُ يَدْعُوهُمْ إِلَى عَذَابِ السَّعِيرِ (21)"));
        loqmanExes.add(new LoqmanEx("وإذا قيل لهؤلاء المجادلين في توحيد الله وإفراده بالعبادة: اتبعوا ما أنزل الله على نبيه محمد صلى الله عليه وسلم قالوا: بل نتبع ما كان عليه آباؤنا من الشرك وعبادة الأصنام، أيفعلون ذلك، ولو كان الشيطان يدعوهم؛ بتزيينه لهم سوء أعمالهم، وكفرهم بالله إلى عذاب النار المستعرة؟"));
        loqmanExes.add(new LoqmanEx("وَمَنْ يُسْلِمْ وَجْهَهُ إِلَى اللَّهِ وَهُوَ مُحْسِنٌ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَى وَإِلَى اللَّهِ عَاقِبَةُ الْأُمُورِ (22)"));
        loqmanExes.add(new LoqmanEx("ومن يُخْلص عبادته لله وقصده إلى ربه تعالى، وهو محسن في أقواله، متقن لأعماله، فقد أخذ بأوثق سبب موصل إلى رضوان الله وجنته. وإلى الله وحده تصير كل الأمور، فيجازي المحسن على إحسانه، والمسيء على إساءته."));
        loqmanExes.add(new LoqmanEx("وَمَنْ كَفَرَ فَلَا يَحْزُنْكَ كُفْرُهُ إِلَيْنَا مَرْجِعُهُمْ فَنُنَبِّئُهُمْ بِمَا عَمِلُوا إِنَّ اللَّهَ عَلِيمٌ بِذَاتِ الصُّدُورِ (23)"));
        loqmanExes.add(new LoqmanEx("ومن كفر فلا تأسَ عليه -أيها الرسول- ولا تحزن؛ لأنك أدَّيت ما عليك من الدعوة والبلاغ، إلينا مرجعهم ومصيرهم يوم القيامة، فنخبرهم بأعمالهم الخبيثة التي عملوها في الدنيا، ثم نجازيهم عليها، إن الله عليم بما تُكِنُّه صدورهم من الكفر بالله وإيثار طاعة الشيطان."));
        loqmanExes.add(new LoqmanEx("نُمَتِّعُهُمْ قَلِيلًا ثُمَّ نَضْطَرُّهُمْ إِلَى عَذَابٍ غَلِيظٍ (24)"));
        loqmanExes.add(new LoqmanEx("نمتعهم في هذه الدنيا الفانية مدة قليلة، ثم يوم القيامة نُلجئهم ونسوقهم إلى عذاب فظيع، وهو عذاب جهنم."));
        loqmanExes.add(new LoqmanEx("وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ قُلِ الْحَمْدُ لِلَّهِ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ (25)"));
        loqmanExes.add(new LoqmanEx("ولئن سألت -أيها الرسول- هؤلاء المشركين بالله: مَن خلق السموات والأرض؟ ليقولُنَّ الله، فإذا قالوا ذلك فقل لهم: الحمد لله الذي أظهر الاستدلال عليكم من أنفسكم، بل أكثر هؤلاء المشركين لا ينظرون ولا يتدبرون مَن الذي له الحمد والشكر، فلذلك أشركوا معه غيره."));
        loqmanExes.add(new LoqmanEx("لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ إِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ (26)"));
        loqmanExes.add(new LoqmanEx("لله -سبحانه- كل ما في السموات والأرض ملكًا وعبيدًا وإيجادًا وتقديرًا، فلا يستحق العبادة أحد غيره. إن الله هو الغني عن خلقه، له الحمد والثناء على كل حال."));
        loqmanExes.add(new LoqmanEx("وَلَوْ أَنَّمَا فِي الْأَرْضِ مِنْ شَجَرَةٍ أَقْلَامٌ وَالْبَحْرُ يَمُدُّهُ مِنْ بَعْدِهِ سَبْعَةُ أَبْحُرٍ مَا نَفِدَتْ كَلِمَاتُ اللَّهِ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ (27)"));
        loqmanExes.add(new LoqmanEx("ولو أن أشجار الأرض كلها بُريت أقلامًا والبحر مداد لها، ويُمَد بسبعة أبحر أخرى، وكُتِب بتلك الأقلام وذلك المداد كلمات الله من علمه وحكمه، وما أوحاه إلى ملائكته ورسله؛ لتكسرت تلك الأقلام، ولنفِد ذلك المداد، ولم تنفد كلمات الله التامة التي لا يحيط بها أحد. إن الله عزيز في انتقامه ممن أشرك به، حكيم في تدبير خلقه. وفي الآية إثبات صفة الكلام لله -تعالى- حقيقة كما يليق بجلاله وكماله سبحانه."));
        loqmanExes.add(new LoqmanEx("مَا خَلْقُكُمْ وَلَا بَعْثُكُمْ إِلَّا كَنَفْسٍ وَاحِدَةٍ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ (28)"));
        loqmanExes.add(new LoqmanEx("ما خَلْقُكم -أيها الناس- ولا بَعْثُكم يوم القيامة في السهولة واليسر إلا كخَلْق نفس واحدة وبَعْثها، إن الله سميع لأقوالكم، بصير بأعمالكم، وسيجازيكم عليها."));
        loqmanExes.add(new LoqmanEx("أَلَمْ تَرَ أَنَّ اللَّهَ يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِي إِلَى أَجَلٍ مُسَمًّى وَأَنَّ اللَّهَ بِمَا تَعْمَلُونَ خَبِيرٌ (29)"));
        loqmanExes.add(new LoqmanEx("ألم تر أن الله يأخذ من ساعات الليل، فيطول النهار، ويقصر الليل، ويأخذ من ساعات النهار، فيطول الليل، ويقصر النهار، وذلَّل لكم الشمس والقمر، يجري كل منهما في مداره إلى أجل معلوم محدد، وأن الله مُطَّلع على كل أعمال الخلق مِن خير أو شر، لا يخفى عليه منها شيء؟"));
        loqmanExes.add(new LoqmanEx("ذَلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّ مَا يَدْعُونَ مِنْ دُونِهِ الْبَاطِلُ وَأَنَّ اللَّهَ هُوَ الْعَلِيُّ الْكَبِيرُ (30)"));
        loqmanExes.add(new LoqmanEx("ذلك كله من عظيم قدرة الله ; لتعلموا وتقروا أن الله هو الحق في ذاته وصفاته، وأفعاله، وأن ما يدعون من دونه الباطل، وأن الله هو العلي بذاته وقَدْره وقهره فوق جميع مخلوقاته، الكبير على كل شيء، وكل ما عداه خاضع له، فهو وحده المستحق أن يُعبد دون مَن سواه."));
        loqmanExes.add(new LoqmanEx("أَلَمْ تَرَ أَنَّ الْفُلْكَ تَجْرِي فِي الْبَحْرِ بِنِعْمَتِ اللَّهِ لِيُرِيَكُمْ مِنْ آيَاتِهِ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ (31)"));
        loqmanExes.add(new LoqmanEx("ألم تر -أيها المشاهد- أن السفن تجري في البحر بأمر الله نعمة منه على خلقه؛ ليريكم من عبره وحججه عليكم ما تعتبرون به؟ إن في جرْي السفن في البحر لَدلالات لكل صبَّار عن محارم الله، شكور لنعمه."));
        loqmanExes.add(new LoqmanEx("وَإِذَا غَشِيَهُمْ مَوْجٌ كَالظُّلَلِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ فَلَمَّا نَجَّاهُمْ إِلَى الْبَرِّ فَمِنْهُمْ مُقْتَصِدٌ وَمَا يَجْحَدُ بِآيَاتِنَا إِلَّا كُلُّ خَتَّارٍ كَفُورٍ (32)"));
        loqmanExes.add(new LoqmanEx("وإذا ركب المشركون السفن وعَلَتْهم الأمواج مِن حولهم كالسحب والجبال، أصابهم الخوف والذعر من الغرق ففزعوا إلى الله، وأخلصوا دعاءهم له، فلما نجاهم إلى البر فمنهم متوسط لم يقم بشكر الله على وجه الكمال، ومنهم كافر بنعمة الله جاحد لها، وما يكفر بآياتنا وحججنا الدالة على كمال قدرتنا ووحدانيتنا إلا كل غدَّار ناقض للعهد، جحود لنعم الله عليه."));
        loqmanExes.add(new LoqmanEx("يَاأَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ وَاخْشَوْا يَوْمًا لَا يَجْزِي وَالِدٌ عَنْ وَلَدِهِ وَلَا مَوْلُودٌ هُوَ جَازٍ عَنْ وَالِدِهِ شَيْئًا إِنَّ وَعْدَ اللَّهِ حَقٌّ فَلَا تَغُرَّنَّكُمُ الْحَيَاةُ الدُّنْيَا وَلَا يَغُرَّنَّكُمْ بِاللَّهِ الْغَرُورُ (33)"));
        loqmanExes.add(new LoqmanEx("يا أيها الناس اتقوا ربكم، وأطيعوه بامتثال أوامره واجتناب نواهيه، واحذروا يوم القيامة الذي لا يغني فيه والد عن ولده ولا مولود عن أبيه شيئًا، إن وعد الله حق لا ريب فيه، فلا تنخدعوا بالحياة الدنيا وزخرفها فتنسيكم الأخرى، ولا يخدعنكم بالله خادع من شياطين الجن والإنس."));
        loqmanExes.add(new LoqmanEx("إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الْأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ (34)"));
        loqmanExes.add(new LoqmanEx("إن الله -وحده لا غيره- يعلم متى تقوم الساعة؛ وهو الذي ينزل المطر من السحاب، لا يقدر على ذلك أحد غيره، ويعلم ما في أرحام الإناث، ويعلم ما تكسبه كل نفس في غدها، وما تعلم نفس بأيِّ أرض تموت. بل الله تعالى هو المختص بعلم ذلك جميعه. إن الله عليم خبير محيط بالظواهر والبواطن، لا يخفى عليه شيء منها."));


        quran_explanation_31_adapter = new quran_explanation_31_adapter(loqmanExes ,QuranExplanation_31Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_31);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_31Activity.this));
        recyclerView.setAdapter(quran_explanation_31_adapter);


    }

}