package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_45Activity extends AppCompatActivity {

    ArrayList<AlgathyaEx> algathyaExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_45_adapter quran_explanation_45_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_45);

        algathyaExes.add(new AlgathyaEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم"));
        algathyaExes.add(new AlgathyaEx("حم (1)"));
        algathyaExes.add(new AlgathyaEx("{حم} سبق الكلام على الحروف المقطَّعة في أول سورة البقرة."));
        algathyaExes.add(new AlgathyaEx("تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ (2)"));
        algathyaExes.add(new AlgathyaEx("هذا القرآن منزل من الله العزيز في انتقامه من أعدائه، الحكيم في تدبير أمور خلقه."));
        algathyaExes.add(new AlgathyaEx("إِنَّ فِي السَّمَاوَاتِ وَالْأَرْضِ لَآيَاتٍ لِلْمُؤْمِنِينَ (3)"));
        algathyaExes.add(new AlgathyaEx("إن في السموات السبع، والأرض التي منها خروج الخلق، وما فيهما من المخلوقات المختلفة الأجناس والأنواع، لأدلة وحججًا للمؤمنين بها."));
        algathyaExes.add(new AlgathyaEx("وَفِي خَلْقِكُمْ وَمَا يَبُثُّ مِنْ دَابَّةٍ آيَاتٌ لِقَوْمٍ يُوقِنُونَ (4)"));
        algathyaExes.add(new AlgathyaEx("وفي خَلْقكم -أيها الناس- وخلق ما تفرق في الأرض من دابة تَدِبُّ عليها، حجج وأدلة لقوم يوقنون بالله وشرعه."));
        algathyaExes.add(new AlgathyaEx("وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَمَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ رِزْقٍ فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا وَتَصْرِيفِ الرِّيَاحِ آيَاتٌ لِقَوْمٍ يَعْقِلُونَ (5)"));
        algathyaExes.add(new AlgathyaEx("وفي اختلاف الليل والنار وتعاقبهما عليكم وما أنزل الله من السماء من مطر، فأحيا به الأرض بعد يُبْسها، فاهتزت بالنبات والزرع، وفي تصريف الرياح لكم من جميع الجهات وتصريفها لمنافعكم، أدلةٌ وحججٌ لقوم يعقلون عن الله حججه وأدلته."));
        algathyaExes.add(new AlgathyaEx("تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ فَبِأَيِّ حَدِيثٍ بَعْدَ اللَّهِ وَآيَاتِهِ يُؤْمِنُونَ (6)"));
        algathyaExes.add(new AlgathyaEx("هذه الآيات والحجج نتلوها عليك -أيها الرسول- بالحق، فبأي حديث بعد الله وآياته وأدلته على أنه الإله الحق وحده لا شريك له يؤمنون ويصدقون ويعملون؟"));
        algathyaExes.add(new AlgathyaEx("وَيْلٌ لِكُلِّ أَفَّاكٍ أَثِيمٍ (7)"));
        algathyaExes.add(new AlgathyaEx("هلاك شديد ودمار لكل كذاب كثير الآثام."));
        algathyaExes.add(new AlgathyaEx("يَسْمَعُ آيَاتِ اللَّهِ تُتْلَى عَلَيْهِ ثُمَّ يُصِرُّ مُسْتَكْبِرًا كَأَنْ لَمْ يَسْمَعْهَا فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ (8)"));
        algathyaExes.add(new AlgathyaEx("يسمع آيات كتاب الله تُقْرأ عليه، ثم يتمادى في كفره متعاليًا في نفسه عن الانقياد لله ورسوله، كأنه لم يسمع ما تُلي عليه من آيات الله، فبشر -أيها الرسول- هذا الأفاك الأثيم بعذاب مؤلم موجع في نار جهنم يوم القيامة."));
        algathyaExes.add(new AlgathyaEx("وَإِذَا عَلِمَ مِنْ آيَاتِنَا شَيْئًا اتَّخَذَهَا هُزُوًا أُولَئِكَ لَهُمْ عَذَابٌ مُهِينٌ (9)"));
        algathyaExes.add(new AlgathyaEx("وإذا علم هذا الأفاك الأثيم من آياتا شيئًا اتخذها هزوًا وسُخْرية، أولئك لهم عذاب يهينهم، ويخزيهم يوم القيامة؛ جزاء استهزائهم بالقرآن."));
        algathyaExes.add(new AlgathyaEx("مِنْ وَرَائِهِمْ جَهَنَّمُ وَلَا يُغْنِي عَنْهُمْ مَا كَسَبُوا شَيْئًا وَلَا مَا اتَّخَذُوا مِنْ دُونِ اللَّهِ أَوْلِيَاءَ وَلَهُمْ عَذَابٌ عَظِيمٌ (10)"));
        algathyaExes.add(new AlgathyaEx("مِن أمام هؤلاء المستهزئين بآيات الله جهنم، ولا يغني عنهم ما كسبوا شيئًا من المال والولد، ولا آلهتُهم التي عبدوها مِن دون الله، ولهم عذاب عظيم مؤلم."));
        algathyaExes.add(new AlgathyaEx("هَذَا هُدًى وَالَّذِينَ كَفَرُوا بِآيَاتِ رَبِّهِمْ لَهُمْ عَذَابٌ مِنْ رِجْزٍ أَلِيمٌ (11)"));
        algathyaExes.add(new AlgathyaEx("هذا القرآن الذي أنزلناه عليك -أيها الرسول- هدى من الضلالة، ودليل على الحق، يهدي إلى طريق مستقيم مَن اتبعه وعمل به، والذين جحدوا بما في القرآن من الآيات الدالة على الحق ولم يُصَدِّقوا بها، لهم عذابٌ مؤلم موجع مِن أسوأ أنواع العذاب يوم القيامة."));
        algathyaExes.add(new AlgathyaEx("اللَّهُ الَّذِي سَخَّرَ لَكُمُ الْبَحْرَ لِتَجْرِيَ الْفُلْكُ فِيهِ بِأَمْرِهِ وَلِتَبْتَغُوا مِنْ فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ (12)"));
        algathyaExes.add(new AlgathyaEx("الله سبحانه وتعالى هو الذي سخَّر لكم البحر; لتجري السفن فيه بأمره، ولتبتغوا من فضله بأنواع التجارات والمكاسب، ولعلكم تشكرون ربكم على تسخيره ذلك لكم، فتعبدوه وحده، وتطيعوه فيما يأمركم به، وينهاكم عنه."));
        algathyaExes.add(new AlgathyaEx("وَسَخَّرَ لَكُمْ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِنْهُ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ (13)"));
        algathyaExes.add(new AlgathyaEx("وسخَّر لكم كل ما في السموات من شمس وقمر ونجوم، وكل ما في الأرض من دابة وشجر وسفن وغير ذلك لمنافعكم، جميع هذه النعم منة من الله وحده أنعم بها عليكم، وفضل منه تَفضَّل به، فإياه فاعبدوا، ولا تجعلوا له شريكًا. إنَّ فيما سخره الله لكم لعلامات ودلالات على وحدانية الله لقوم يتفكرون في آيات الله وحججه وأدلته، فيعتبرون بها."));
        algathyaExes.add(new AlgathyaEx("قُلْ لِلَّذِينَ آمَنُوا يَغْفِرُوا لِلَّذِينَ لَا يَرْجُونَ أَيَّامَ اللَّهِ لِيَجْزِيَ قَوْمًا بِمَا كَانُوا يَكْسِبُونَ (14)"));
        algathyaExes.add(new AlgathyaEx("قل -أيها الرسول- للذين صدَّقوا بالله واتَّبَعوا رسله يعفوا، ويتجاوزوا عن الذين لا يرجون ثواب الله، ولا يخافون بأسه إذا هم نالوا الذين آمنوا بالأذى والمكروه; ليجزي الله هؤلاء المشركين بما كانوا يكسبون في الدنيا من الآثام وإيذاء المؤمنين."));
        algathyaExes.add(new AlgathyaEx("مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ وَمَنْ أَسَاءَ فَعَلَيْهَا ثُمَّ إِلَى رَبِّكُمْ تُرْجَعُونَ (15)"));
        algathyaExes.add(new AlgathyaEx("من عمل مِن عباد الله بطاعته فلنفسه عمل، ومن أساء عمله في الدنيا بمعصية الله فعلى نفسه جنى، ثم إنكم -أيها الناس- إلى ربكم تصيرون بعد موتكم، فيجازي المحسن بإحسانه، والمسيء بإساءته."));
        algathyaExes.add(new AlgathyaEx("وَلَقَدْ آتَيْنَا بَنِي إِسْرَائِيلَ الْكِتَابَ وَالْحُكْمَ وَالنُّبُوَّةَ وَرَزَقْنَاهُمْ مِنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَى الْعَالَمِينَ (16)"));
        algathyaExes.add(new AlgathyaEx("ولقد آتينا بني إسرائيل التوراة والإنجيل والحكم بما فيهما، وجعلنا أكثر الأنبياء من ذرية إبراهيم عليه السلام فيهم، ورزقناهم من الطيبات من الأقوات والثمار والأطعمة، وفضَّلناهم على عالمي زمانهم."));
        algathyaExes.add(new AlgathyaEx("وَآتَيْنَاهُمْ بَيِّنَاتٍ مِنَ الْأَمْرِ فَمَا اخْتَلَفُوا إِلَّا مِنْ بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ إِنَّ رَبَّكَ يَقْضِي بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ (17)"));
        algathyaExes.add(new AlgathyaEx("وآتينا بني إسرائيل شرائع واضحات في الحلال والحرام، ودلالات تبين الحق من الباطل، فما اختلفوا إلا من بعد ما جاءهم العلم، وقامت الحجة عليهم، وإنما حَمَلهم على ذلك بَغْيُ بعضهم على بعض؛ طلبًا للرفعة والرئاسة، إن ربك -أيها الرسول- يحكم بين المختلفين من بني إسرائيل يوم القيامة فيما كانوا فيه يختلفون في الدنيا. وفي هذا تحذير لهذه الأمة أن تسلك مسلكهم."));
        algathyaExes.add(new AlgathyaEx("ثُمَّ جَعَلْنَاكَ عَلَى شَرِيعَةٍ مِنَ الْأَمْرِ فَاتَّبِعْهَا وَلَا تَتَّبِعْ أَهْوَاءَ الَّذِينَ لَا يَعْلَمُونَ (18)"));
        algathyaExes.add(new AlgathyaEx("ثم جعلناك -أيها الرسول- على منهاج واضح من أمر الدين، فاتبع الشريعة التي جعلناك عليها، ولا تتبع أهواء الجاهلين بشرع الله الذين لا يعلمون الحق. وفي الآية دلالة عظيمة على كمال هذا الدين وشرفه، ووجوب الانقياد لحكمه، وعدم الميل إلى أهواء الكفرة والملحدين."));
        algathyaExes.add(new AlgathyaEx("إِنَّهُمْ لَنْ يُغْنُوا عَنْكَ مِنَ اللَّهِ شَيْئًا وَإِنَّ الظَّالِمِينَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ وَاللَّهُ وَلِيُّ الْمُتَّقِينَ (19)"));
        algathyaExes.add(new AlgathyaEx("إن هؤلاء المشركين بربهم الذين يدعونك إلى اتباع أهوائهم لن يغنوا عنك -أيها الرسول- من عقاب الله شيئًا إن اتبعت أهواءهم، وإن الظالمين المتجاوزين حدود الله من المنافقين واليهود وغيرهم بعضهم أنصار بعض على المؤمنين بالله وأهل طاعته، والله ناصر المتقين ربَّهم بأداء فرائضه واجتناب نواهيه."));
        algathyaExes.add(new AlgathyaEx("هَذَا بَصَائِرُ لِلنَّاسِ وَهُدًى وَرَحْمَةٌ لِقَوْمٍ يُوقِنُونَ (20)"));
        algathyaExes.add(new AlgathyaEx("هذا القرآن الذي أنزلناه إليك -أيها الرسول- بصائر يبصر به الناس الحق من الباطل، ويعرفون به سبيل الرشاد، وهدى ورحمةٌ لقوم يوقنون بحقيقة صحته، وأنه تنزيل من الله العزيز الحكيم."));
        algathyaExes.add(new AlgathyaEx("أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا السَّيِّئَاتِ أَنْ نَجْعَلَهُمْ كَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَوَاءً مَحْيَاهُمْ وَمَمَاتُهُمْ سَاءَ مَا يَحْكُمُونَ (21)"));
        algathyaExes.add(new AlgathyaEx("بل أظنَّ الذين اكتسبوا السيئات، وكذَّبوا رسل الله، وخالفوا أمر ربهم، وعبدوا غيره، أن نجعلهم كالذين آمنوا بالله، وصدقوا رسله وعملوا الصالحات، وأخلصوا له العبادة دون سواه، ونساويَهم بهم في الدنيا والآخرة؟ ساء حكمهم بالمساواة بين الفجار والأبرار في الآخرة."));
        algathyaExes.add(new AlgathyaEx("وَخَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَلِتُجْزَى كُلُّ نَفْسٍ بِمَا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ (22)"));
        algathyaExes.add(new AlgathyaEx("وخَلَق الله السموات والأرض بالحق والعدل والحكمة; ولكي تجزى كل نفس في الآخرة بما كسبت مِن خير أو شر، وهم لا يُظْلمون جزاء أعمالهم."));
        algathyaExes.add(new AlgathyaEx("أَفَرَأَيْتَ مَنِ اتَّخَذَ إِلَهَهُ هَوَاهُ وَأَضَلَّهُ اللَّهُ عَلَى عِلْمٍ وَخَتَمَ عَلَى سَمْعِهِ وَقَلْبِهِ وَجَعَلَ عَلَى بَصَرِهِ غِشَاوَةً فَمَنْ يَهْدِيهِ مِنْ بَعْدِ اللَّهِ أَفَلَا تَذَكَّرُونَ (23)"));
        algathyaExes.add(new AlgathyaEx("أفرأيت -أيها الرسول- من اتخذ هواه إلهًا له، فلا يهوى شيئًا إلا فَعَله، وأضلَّه الله بعد بلوغ العلم إليه وقيام الحجة عليه، فلا يسمع مواعظ الله، ولا يعتبر بها، وطبع على قلبه، فلا يعقل به شيئًا، وجعل على بصره غطاء، فلا يبصر به حجج الله؟ فمن يوفقه لإصابة الحق والرشد بعد إضلال الله إياه؟ أفلا تذكرون -أيها الناس- فتعلموا أنَّ مَن فَعَل الله به ذلك فلن يهتدي أبدًا، ولن يجد لنفسه وليًا مرشدًا؟\n" +
                "والآية أصل في التحذير من أن يكون الهوى هو الباعث للمؤمنين على أعمالهم.\n"));
        algathyaExes.add(new AlgathyaEx("وَقَالُوا مَا هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ وَمَا لَهُمْ بِذَلِكَ مِنْ عِلْمٍ إِنْ هُمْ إِلَّا يَظُنُّونَ (24)"));
        algathyaExes.add(new AlgathyaEx("وقال هؤلاء المشركون: ما الحياة إلا حياتنا الدنيا التي نحن فيها، لا حياة سواها; تكذيبا منهم بالبعث بعد الممات، وما يهلكنا إلا مرُّ الليالي والأيام وطول العمر؛ إنكارًا منهم أن يكون لهم رب يفنيهم ويهلكهم، وما لهؤلاء المشركين من علم بذلك، ما هم إلا يتكلمون بالظن والوهم والخيال."));
        algathyaExes.add(new AlgathyaEx("وَإِذَا تُتْلَى عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ مَا كَانَ حُجَّتَهُمْ إِلَّا أَنْ قَالُوا ائْتُوا بِآبَائِنَا إِنْ كُنْتُمْ صَادِقِينَ (25)"));
        algathyaExes.add(new AlgathyaEx("إذا تتلى على هؤلاء المشركين المكذبين بالبعث آياتنا واضحات، لم يكن لهم حجة إلا قولهم للرسول محمد صلى الله عليه وسلم: أحْي أنت والمؤمنون معك آباءنا الذين قد هلكوا، إن كنتم صادقين فيما تقولون."));
        algathyaExes.add(new AlgathyaEx("قُلِ اللَّهُ يُحْيِيكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يَجْمَعُكُمْ إِلَى يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ وَلَكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ (26)"));
        algathyaExes.add(new AlgathyaEx("قل -أيها الرسول- لهؤلاء المشركين المكذبين بالبعث: الله سبحانه وتعالى يحييكم في الدنيا ما شاء لكم الحياة، ثم يميتكم فيها، ثم يجمعكم جميعا أحياء إلى يوم القيامة لا شك فيه، ولكن أكثر الناس لا يعلمون قدرة الله على إماتتهم، ثم بعثهم يوم القيامة."));
        algathyaExes.add(new AlgathyaEx("وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَخْسَرُ الْمُبْطِلُونَ (27)"));
        algathyaExes.add(new AlgathyaEx("ولله سبحانه سلطان السموات السبع والأرض خَلْقًا ومُلْكًا وعبودية. ويوم تجيء الساعة التي يبعث فيها الموتى من قبورهم ويحاسبون، يخسر الكافرون بالله الجاحدون بما أنزله على رسوله من الآيات البينات والدلائل الواضحات."));
        algathyaExes.add(new AlgathyaEx("وَتَرَى كُلَّ أُمَّةٍ جَاثِيَةً كُلُّ أُمَّةٍ تُدْعَى إِلَى كِتَابِهَا الْيَوْمَ تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُونَ (28)"));
        algathyaExes.add(new AlgathyaEx("وترى -أيها الرسول- يوم تقوم الساعة أهل كل ملة ودين جاثمين على رُكَبهم، كل أمة تُدْعى إلى كتاب أعمالها، ويقال لهم: اليوم تُجزون ما كنتم تعملون من خير أو شر."));
        algathyaExes.add(new AlgathyaEx("هَذَا كِتَابُنَا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ إِنَّا كُنَّا نَسْتَنْسِخُ مَا كُنْتُمْ تَعْمَلُونَ (29)"));
        algathyaExes.add(new AlgathyaEx("هذا كتابنا ينطق عليكم بجميع أعمالكم من غير زيادة ولا نقص، إنَّا كنا نأمر الحفظة أن تكتب أعمالكم عليكم."));
        algathyaExes.add(new AlgathyaEx("فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُدْخِلُهُمْ رَبُّهُمْ فِي رَحْمَتِهِ ذَلِكَ هُوَ الْفَوْزُ الْمُبِينُ (30)"));
        algathyaExes.add(new AlgathyaEx("فأما الذين آمنوا بالله ورسوله في الدنيا، وامتثلوا أوامره واجتنبوا نواهيه، فيدخلهم ربهم في جنته برحمته، ذلك الدخول هو الفوز المبين الذي لا فوز بعده."));
        algathyaExes.add(new AlgathyaEx("وَأَمَّا الَّذِينَ كَفَرُوا أَفَلَمْ تَكُنْ آيَاتِي تُتْلَى عَلَيْكُمْ فَاسْتَكْبَرْتُمْ وَكُنْتُمْ قَوْمًا مُجْرِمِينَ (31)"));
        algathyaExes.add(new AlgathyaEx("وأما الذين جحدوا أن الله هو الإله الحق وكذَّبوا رسله ولم يعملوا بشرعه، فيقال لهم -تقريعًا وتوبيخًا-: أفلم تكن آياتي في الدنيا تتلى عليكم، فاستكبرتم عن استماعها والإيمان بها، وكنتم قومًا مشركين تكسِبون المعاصي ولا تؤمنون بثواب ولا عقاب؟"));
        algathyaExes.add(new AlgathyaEx("وَإِذَا قِيلَ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَالسَّاعَةُ لَا رَيْبَ فِيهَا قُلْتُمْ مَا نَدْرِي مَا السَّاعَةُ إِنْ نَظُنُّ إِلَّا ظَنًّا وَمَا نَحْنُ بِمُسْتَيْقِنِينَ (32)"));
        algathyaExes.add(new AlgathyaEx("وإذا قيل لكم: إن وعد الله ببعث الناس من قبورهم حق، والساعة لا شك فيها، قلتم: ما ندري ما الساعة؟ وما نتوقع وقوعها إلا توهمًا، وما نحن بمتحققين أن الساعة آتية."));
        algathyaExes.add(new AlgathyaEx("وَبَدَا لَهُمْ سَيِّئَاتُ مَا عَمِلُوا وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ (33)"));
        algathyaExes.add(new AlgathyaEx("وظهر لهؤلاء الذين كانوا يكذِّبون بآيات الله ما عملوا في الدنيا من الأعمال القبيحة، ونزل بهم من عذاب الله جزاء ما كانوا به يستهزئون."));
        algathyaExes.add(new AlgathyaEx("وَقِيلَ الْيَوْمَ نَنْسَاكُمْ كَمَا نَسِيتُمْ لِقَاءَ يَوْمِكُمْ هَذَا وَمَأْوَاكُمُ النَّارُ وَمَا لَكُمْ مِنْ نَاصِرِينَ (34)"));
        algathyaExes.add(new AlgathyaEx("وقيل لهؤلاء الكفرة: اليوم نترككم في عذاب جهنم، كما تركتم الإيمان بربكم والعمل للقاء يومكم هذا، ومسكنكم نار جهنم، وما لكم من ناصرين ينصرونكم من عذاب الله."));
        algathyaExes.add(new AlgathyaEx("ذَلِكُمْ بِأَنَّكُمُ اتَّخَذْتُمْ آيَاتِ اللَّهِ هُزُوًا وَغَرَّتْكُمُ الْحَيَاةُ الدُّنْيَا فَالْيَوْمَ لَا يُخْرَجُونَ مِنْهَا وَلَا هُمْ يُسْتَعْتَبُونَ (35)"));
        algathyaExes.add(new AlgathyaEx("هذا الذي حلَّ بكم مِن عذاب الله ; بسبب أنكم اتخذتم آيات الله وحججه هزوًا ولعبًا، وخدعتكم زينة الحياة الدنيا، فاليوم لا يُخرجون من النار، ولا هم يُرَدُّون إلى الدنيا؛ ليتوبوا ويعملوا صالحًا."));
        algathyaExes.add(new AlgathyaEx("فَلِلَّهِ الْحَمْدُ رَبِّ السَّمَاوَاتِ وَرَبِّ الْأَرْضِ رَبِّ الْعَالَمِينَ (36)"));
        algathyaExes.add(new AlgathyaEx("فلله سبحانه وتعالى وحده الحمد على نعمه التي لا تحصى على خلقه، رب السموات والأرض وخالقهما ومدبرهما، رب الخلائق أجمعين."));
        algathyaExes.add(new AlgathyaEx("وَلَهُ الْكِبْرِيَاءُ فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ (37)"));
        algathyaExes.add(new AlgathyaEx("وله وحده سبحانه العظمة والجلال والكبرياء والسُّلْطان والقدرة والكمال في السموات والأرض، وهو العزيز الذي لا يغالَب، الحكيم في أقواله وأفعاله وقدره وشرعه، تعالى وتقدَّس، لا إله إلا هو."));


        quran_explanation_45_adapter = new quran_explanation_45_adapter(algathyaExes ,QuranExplanation_45Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_45);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_45Activity.this));
        recyclerView.setAdapter(quran_explanation_45_adapter);


    }

}