package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_14Activity extends AppCompatActivity {

    ArrayList<EbrahimEx> ebrahimExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_14_adapter quran_explanation_14_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_14);

        ebrahimExes.add(new EbrahimEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"));
        ebrahimExes.add(new EbrahimEx("الر كِتَابٌ أَنْزَلْنَاهُ إِلَيْكَ لِتُخْرِجَ النَّاسَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ بِإِذْنِ رَبِّهِمْ إِلَى صِرَاطِ الْعَزِيزِ الْحَمِيدِ (1)"));
        ebrahimExes.add(new EbrahimEx("الر) سبق الكلام على الحروف المقطَّعة في أول سورة البقرة.\n" +
                "هذا القرآن كتاب أوحيناه إليك -أيها الرسول- لتُخرج به البشر من الضلال والغيِّ إلى الهدى والنور -بإذن ربهم وتوفيقه إياهم- إلى الإسلام الذي هو طريق الله الغالب المحمود في كل حال."));
        ebrahimExes.add(new EbrahimEx("اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ وَوَيْلٌ لِلْكَافِرِينَ مِنْ عَذَابٍ شَدِيدٍ (2)"));
        ebrahimExes.add(new EbrahimEx("الله الذي له ما في السموات وما في الأرض، خلقًا وملكًا وتصرُّفًا، فهو الذي يجب أن تكون العبادة له وحده. وسوف يصيب الذين لم يؤمنوا بالله ولم يتبعوا رسله يوم القيامة هلاك وعذاب شديد."));
        ebrahimExes.add(new EbrahimEx("الَّذِينَ يَسْتَحِبُّونَ الْحَيَاةَ الدُّنْيَا عَلَى الْآخِرَةِ وَيَصُدُّونَ عَنْ سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا أُولَئِكَ فِي ضَلَالٍ بَعِيدٍ (3)"));
        ebrahimExes.add(new EbrahimEx("وهؤلاء الذين أعرضوا ولم يؤمنوا بالله ويتبعوا رسله هم الذين يختارون الحياة الدنيا الفانية، ويتركون الآخرة الباقية، ويمنعون الناس عن اتباع دين الله، ويريدونه طريقًا معوجًا ليوافق أهواءهم، أولئك الموصوفون بهذه الصفات في ضلال عن الحق بعيد عن كل أسباب الهداية."));
        ebrahimExes.add(new EbrahimEx("وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ فَيُضِلُّ اللَّهُ مَنْ يَشَاءُ وَيَهْدِي مَنْ يَشَاءُ وَهُوَ الْعَزِيزُ الْحَكِيمُ (4)"));
        ebrahimExes.add(new EbrahimEx("وما أرسلنا مِن رسولٍ قبلك -أيها النبي- إلا بلُغة قومه; ليوضِّح لهم شريعة الله، فيضل الله من يشاء عن الهدى، ويهدي من يشاء إلى الحق، وهو العزيز في ملكه، الحكيم الذي يضع الأمور في مواضعها وَفْق الحكمة."));
        ebrahimExes.add(new EbrahimEx("وَلَقَدْ أَرْسَلْنَا مُوسَى بِآيَاتِنَا أَنْ أَخْرِجْ قَوْمَكَ مِنَ الظُّلُمَاتِ إِلَى النُّورِ وَذَكِّرْهُمْ بِأَيَّامِ اللَّهِ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِكُلِّ صَبَّارٍ شَكُورٍ (5)"));
        ebrahimExes.add(new EbrahimEx("ولقد أرسلنا موسى إلى بني إسرائيل وأيدناه بالمعجزات الدالة على صدقه، وأمرناه بأن يدعوهم إلى الإيمان؛ ليخرجهم من الضلال إلى الهدى، ويذكِّرهم بنعم الله ونقمه في أيامه، إن في هذا التذكير بها لَدلالات لكل صبَّار على طاعة الله، وعن محارمه، وعلى أقداره، شكور قائم بحقوق الله، يشكر الله على نعمه، وخصَّهم بذلك؛ لأنهم هم الذين يعتبرون بها، ولا يَغْفُلون عنها."));
        ebrahimExes.add(new EbrahimEx("وَإِذْ قَالَ مُوسَى لِقَوْمِهِ اذْكُرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ إِذْ أَنْجَاكُمْ مِنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ وَيُذَبِّحُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءَكُمْ وَفِي ذَلِكُمْ بَلَاءٌ مِنْ رَبِّكُمْ عَظِيمٌ (6)"));
        ebrahimExes.add(new EbrahimEx("واذكر -أيها الرسول- لقومك قصة موسى حين قال لبني إسرائيل: اذكروا نعمة الله عليكم حين أنجاكم من فرعون وأتباعه يذيقونكم أشد العذاب، ويذبِّحون أبناءكم الذكور، حتى لا يأتي منهم من يستولي على مُلْك فرعون، ويستبقون نساءكم للخدمة والامتهان، وفي ذلكم البلاء والإنجاء اختبار لكم من ربكم عظيم."));
        ebrahimExes.add(new EbrahimEx("وَإِذْ تَأَذَّنَ رَبُّكُمْ لَئِنْ شَكَرْتُمْ لَأَزِيدَنَّكُمْ وَلَئِنْ كَفَرْتُمْ إِنَّ عَذَابِي لَشَدِيدٌ (7)"));
        ebrahimExes.add(new EbrahimEx("وقال لهم موسى: واذكروا حين أعلم ربكم إعلامًا مؤكَّدًا: لئن شكرتموه على نعمه ليزيدنكم من فضله، ولئن جحدتم نعمة الله ليعذبنَّكم عذابًا شديدًا."));
        ebrahimExes.add(new EbrahimEx("وَقَالَ مُوسَى إِنْ تَكْفُرُوا أَنْتُمْ وَمَنْ فِي الْأَرْضِ جَمِيعًا فَإِنَّ اللَّهَ لَغَنِيٌّ حَمِيدٌ (8)"));
        ebrahimExes.add(new EbrahimEx("وقال لهم: إن تكفروا بالله أنتم وجميع أهل الأرض فلن تضروا الله شيئًا; فإن الله لغني عن خلقه، مستحق للحمد والثناء، محمود في كل حال."));
        ebrahimExes.add(new EbrahimEx("أَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ مِنْ قَبْلِكُمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَالَّذِينَ مِنْ بَعْدِهِمْ لَا يَعْلَمُهُمْ إِلَّا اللَّهُ جَاءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنَاتِ فَرَدُّوا أَيْدِيَهُمْ فِي أَفْوَاهِهِمْ وَقَالُوا إِنَّا كَفَرْنَا بِمَا أُرْسِلْتُمْ بِهِ وَإِنَّا لَفِي شَكٍّ مِمَّا تَدْعُونَنَا إِلَيْهِ مُرِيبٍ (9)"));
        ebrahimExes.add(new EbrahimEx("ألم يأتكم -يا أمَّة محمد- خبر الأمم التي سبقتكم، قوم نوح وقوم هود وقوم صالح، والأمم التي بعدهم، لا يحصي عددهم إلا الله، جاءتهم رسلهم بالبراهين الواضحات، فعضُّوا أيديهم غيظًا واستنكافًا عن قَبول الإيمان، وقالوا لرسلهم: إنا لا نصدِّق بما جئتمونا به، وإنا لفي شكٍّ مما تدعوننا إليه من الإيمان والتوحيد موجب للريبة."));
        ebrahimExes.add(new EbrahimEx("قَالَتْ رُسُلُهُمْ أَفِي اللَّهِ شَكٌّ فَاطِرِ السَّمَاوَاتِ وَالْأَرْضِ يَدْعُوكُمْ لِيَغْفِرَ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرَكُمْ إِلَى أَجَلٍ مُسَمًّى قَالُوا إِنْ أَنْتُمْ إِلَّا بَشَرٌ مِثْلُنَا تُرِيدُونَ أَنْ تَصُدُّونَا عَمَّا كَانَ يَعْبُدُ آبَاؤُنَا فَأْتُونَا بِسُلْطَانٍ مُبِينٍ (10)"));
        ebrahimExes.add(new EbrahimEx("قالت لهم رسلهم: أفي الله وعبادته -وحده- ريب، وهو خالق السموات والأرض، ومنشئهما من العدم على غير مثال سابق، وهو يدعوكم إلى الإيمان; ليغفر لكم ما أسلفتم من الشرك، ويدفع عنكم عذاب الاستئصال، فيؤخر بقاءكم في الدنيا إلى أجل قدَّره، وهو نهاية آجالكم، فلا يعذبكم في الدنيا؟ فقالوا لرسلهم: ما نراكم إلا بشرًا صفاتكم كصفاتنا، لا فضل لكم علينا يؤهلكم أن تكونوا رسلا. تريدون أن تمنعونا من عبادة ما كان يعبده آباونا من الأصنام والأوثان، فأتونا بحجة ظاهرة تشهد على صحة ما تقولون."));
        ebrahimExes.add(new EbrahimEx("قَالَتْ لَهُمْ رُسُلُهُمْ إِنْ نَحْنُ إِلَّا بَشَرٌ مِثْلُكُمْ وَلَكِنَّ اللَّهَ يَمُنُّ عَلَى مَنْ يَشَاءُ مِنْ عِبَادِهِ وَمَا كَانَ لَنَا أَنْ نَأْتِيَكُمْ بِسُلْطَانٍ إِلَّا بِإِذْنِ اللَّهِ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ (11)"));
        ebrahimExes.add(new EbrahimEx("ولما سمع الرسل ما قاله أقوامهم قالوا لهم: حقًا ما نحن إلا بشر مثلكم كما قلتم، ولكن الله يتفضل بإنعامه على مَن يشاء من عباده فيصطفيهم لرسالته، وما طلبتم من البرهان المبين، فلا يمكن لنا ولا نستطيع أن نأتيكم به إلا بإذن الله وتوفيقه، وعلى الله وحده يعتمد المؤمنون في كل أمورهم."));
        ebrahimExes.add(new EbrahimEx("وَمَا لَنَا أَلَّا نَتَوَكَّلَ عَلَى اللَّهِ وَقَدْ هَدَانَا سُبُلَنَا وَلَنَصْبِرَنَّ عَلَى مَا آذَيْتُمُونَا وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ (12)"));
        ebrahimExes.add(new EbrahimEx("وكيف لا نعتمد على الله، وهو الذي أرشدنا إلى طريق النجاة من عذابه باتباع أحكام دينه؟ ولنصبرنَّ على إيذائكم لنا بالكلام السيئ وغيره، وعلى الله وحده يجب أن يعتمد المؤمنون في نصرهم، وهزيمة أعدائهم."));
        ebrahimExes.add(new EbrahimEx("وَقَالَ الَّذِينَ كَفَرُوا لِرُسُلِهِمْ لَنُخْرِجَنَّكُمْ مِنْ أَرْضِنَا أَوْ لَتَعُودُنَّ فِي مِلَّتِنَا فَأَوْحَى إِلَيْهِمْ رَبُّهُمْ لَنُهْلِكَنَّ الظَّالِمِينَ (13)"));
        ebrahimExes.add(new EbrahimEx("وضاقت صدور الكفار مما قاله الرسل فقالوا لهم: لنطردنكم من بلادنا حتى تعودوا إلى ديننا، فأوحى الله إلى رسله أنه سيهلك الجاحدين الذين كفروا به وبرسله."));
        ebrahimExes.add(new EbrahimEx("وَلَنُسْكِنَنَّكُمُ الْأَرْضَ مِنْ بَعْدِهِمْ ذَلِكَ لِمَنْ خَافَ مَقَامِي وَخَافَ وَعِيدِ (14)"));
        ebrahimExes.add(new EbrahimEx("ولنجعلن العاقبة الحسنة للرسل وأتباعهم بإسكانهم أرض الكافرين بعد إهلاكهم، ذلك الإهلاك للكفار، وإسكان المؤمنين أرضهم أمر مؤكد لمن خاف مقامه بين يديَّ يوم القيامة، وخشي وعيدي وعذابي."));
        ebrahimExes.add(new EbrahimEx("وَاسْتَفْتَحُوا وَخَابَ كُلُّ جَبَّارٍ عَنِيدٍ (15)"));
        ebrahimExes.add(new EbrahimEx("ولجأ الرسل إلى ربهم وسألوه النصر على أعدائهم والحكم بينهم، فاستجاب لهم، وهلك كل متكبر لا يقبل الحق ولا يُذْعن له، ولا يقر بتوحيد الله وإخلاص العبادة له."));
        ebrahimExes.add(new EbrahimEx("مِنْ وَرَائِهِ جَهَنَّمُ وَيُسْقَى مِنْ مَاءٍ صَدِيدٍ (16)"));
        ebrahimExes.add(new EbrahimEx("ومِن أمام هذا الكافر جهنم يَلْقى عذابها; ويُسقى فيها من القيح والدم الذي يَخْرج من أجسام أهل النار."));
        ebrahimExes.add(new EbrahimEx("يَتَجَرَّعُهُ وَلَا يَكَادُ يُسِيغُهُ وَيَأْتِيهِ الْمَوْتُ مِنْ كُلِّ مَكَانٍ وَمَا هُوَ بِمَيِّتٍ وَمِنْ وَرَائِهِ عَذَابٌ غَلِيظٌ (17)"));
        ebrahimExes.add(new EbrahimEx("يحاول المتكبر ابتلاع القيح والدم وغير ذلك مما يسيل من أهل النار مرة بعد مرة، فلا يستطيع أن يبتلعه; لقذارته وحرارته، ومرارته، ويأتيه العذاب الشديد من كل نوع ومن كل عضو من جسده، وما هو بميت فيستريح، وله من بعد هذا العذاب عذاب آخر مؤلم."));
        ebrahimExes.add(new EbrahimEx("مَثَلُ الَّذِينَ كَفَرُوا بِرَبِّهِمْ أَعْمَالُهُمْ كَرَمَادٍ اشْتَدَّتْ بِهِ الرِّيحُ فِي يَوْمٍ عَاصِفٍ لَا يَقْدِرُونَ مِمَّا كَسَبُوا عَلَى شَيْءٍ ذَلِكَ هُوَ الضَّلَالُ الْبَعِيدُ (18)"));
        ebrahimExes.add(new EbrahimEx("صفة أعمال الكفار في الدنيا كالبر وصلة الأرحام كصفة رماد اشتدت به الريح في يوم ذي ريح شديدة، فلم تترك له أثرًا، فكذلك أعمالهم لا يجدون منها ما ينفعهم عند الله، فقد أذهبها الكفر كما أذهبت الريح الرماد، ذلك السعي والعمل على غير أساس، هو الضلال البعيد عن الطريق المستقيم."));
        ebrahimExes.add(new EbrahimEx("أَلَمْ تَرَ أَنَّ اللَّهَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ إِنْ يَشَأْ يُذْهِبْكُمْ وَيَأْتِ بِخَلْقٍ جَدِيدٍ (19)"));
        ebrahimExes.add(new EbrahimEx("ألم تعلم أيها المخاطب -والمراد عموم الناس- أن الله أوجد السموات والأرض على الوجه الصحيح الدال على حكمته، وأنه لم يخلقهما عبثًا، بل للاستدلال بهما على وحدانيته، وكمال قدرته، فيعبدوه وحده، ولا يشركوا به شيئًا؟ إن يشأ يذهبكم ويأت بقوم غيركم يطيعون الله."));
        ebrahimExes.add(new EbrahimEx("وَمَا ذَلِكَ عَلَى اللَّهِ بِعَزِيزٍ (20)"));
        ebrahimExes.add(new EbrahimEx("وما إهلاككم والإتيان بغيركم بممتنع على الله، بل هو سهل يسير."));
        ebrahimExes.add(new EbrahimEx("وَبَرَزُوا لِلَّهِ جَمِيعًا فَقَالَ الضُّعَفَاءُ لِلَّذِينَ اسْتَكْبَرُوا إِنَّا كُنَّا لَكُمْ تَبَعًا فَهَلْ أَنْتُمْ مُغْنُونَ عَنَّا مِنْ عَذَابِ اللَّهِ مِنْ شَيْءٍ قَالُوا لَوْ هَدَانَا اللَّهُ لَهَدَيْنَاكُمْ سَوَاءٌ عَلَيْنَا أَجَزِعْنَا أَمْ صَبَرْنَا مَا لَنَا مِنْ مَحِيصٍ (21)"));
        ebrahimExes.add(new EbrahimEx("وخرجت الخلائق من قبورهم، وظهروا كلهم يوم القيامة لله الواحد القهار; ليحكم بينهم، فيقول الأتباع لقادتهم: إنَّا كنَّا لكم في الدنيا أتباعًا، نأتمر بأمركم، فهل أنتم -اليوم- دافعون عنا من عذاب الله شيئًا كما كنتم تَعِدوننا؟\n" +
                "فيقول الرؤساء: لو هدانا الله إلى الإيمان لأرشدناكم إليه، ولكنه لم يوفقنا، فضللنا وأضللناكم، يستوي علينا وعليكم الجَزَع والصبر عليه، فليس لنا مهرب من العذاب ولا منجى.\n"));
        ebrahimExes.add(new EbrahimEx("وَقَالَ الشَّيْطَانُ لَمَّا قُضِيَ الْأَمْرُ إِنَّ اللَّهَ وَعَدَكُمْ وَعْدَ الْحَقِّ وَوَعَدْتُكُمْ فَأَخْلَفْتُكُمْ وَمَا كَانَ لِيَ عَلَيْكُمْ مِنْ سُلْطَانٍ إِلَّا أَنْ دَعَوْتُكُمْ فَاسْتَجَبْتُمْ لِي فَلَا تَلُومُونِي وَلُومُوا أَنْفُسَكُمْ مَا أَنَا بِمُصْرِخِكُمْ وَمَا أَنْتُمْ بِمُصْرِخِيَّ إِنِّي كَفَرْتُ بِمَا أَشْرَكْتُمُونِ مِنْ قَبْلُ إِنَّ الظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ (22)"));
        ebrahimExes.add(new EbrahimEx("وقال الشيطان -بعد أن قضى الله الأمر وحاسب خَلْقه، ودخل أهلُ الجنة الجنةَ وأهلُ النارِ النارَ-: إن الله وعدكم وعدًا حقًا بالبعث والجزاء، ووعدتكم وعدًا باطلا أنه لا بَعْثَ ولا جزاء، فأخلفتكم وعدي، وما كان لي عليكم من قوة أقهركم بها على اتباعي، ولا كانت معي حجة، ولكن دعوتكم إلى الكفر والضلال فاتبعتموني، فلا تلوموني ولوموا أنفسكم، فالذنب ذنبكم، ما أنا بمغيثكم ولا أنتم بمغيثيَّ من عذاب الله، إني تبرَّأت مِن جَعْلِكم لي شريكًا مع الله في طاعته في الدنيا. إن الظالمين -في إعراضهم عن الحق واتباعهم الباطل- لهم عذاب مؤلم موجع."));
        ebrahimExes.add(new EbrahimEx("وَأُدْخِلَ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا بِإِذْنِ رَبِّهِمْ تَحِيَّتُهُمْ فِيهَا سَلَامٌ (23)"));
        ebrahimExes.add(new EbrahimEx("وأُدخل الذين صدَّقوا الله ورسوله وعملوا الصالحات جنات تجري من تحت أشجارها وقصورها الأنهار، لا يخرجون منها أبدًا -بإذن ربهم وحوله وقوته- يُحَيَّوْن فيها بسلام من الله وملائكته والمؤمنين."));
        ebrahimExes.add(new EbrahimEx("أَلَمْ تَرَ كَيْفَ ضَرَبَ اللَّهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَفَرْعُهَا فِي السَّمَاءِ (24)"));
        ebrahimExes.add(new EbrahimEx("ألم تعلم -أيها الرسول- كيف ضرب الله مثلا لكلمة التوحيد (لا إله إلا الله) بشجرة عظيمة، وهي النخلة، أصلها متمكن في الأرض، وأعلاها مرتفع علوًّا نحو السماء؟"));
        ebrahimExes.add(new EbrahimEx("تُؤْتِي أُكُلَهَا كُلَّ حِينٍ بِإِذْنِ رَبِّهَا وَيَضْرِبُ اللَّهُ الْأَمْثَالَ لِلنَّاسِ لَعَلَّهُمْ يَتَذَكَّرُونَ (25)"));
        ebrahimExes.add(new EbrahimEx("تعطي ثمارها كل وقت بإذن ربها، وكذلك شجرة الإيمان أصلها ثابت في قلب المؤمن علمًا واعتقادًا، وفرعها من الأعمال الصالحة والأخلاق المرضية يُرفع إلى الله وينال ثوابه في كل وقت. ويضرب الله الأمثال للناس; ليتذكروا ويتعظوا، فيعتبروا."));
        ebrahimExes.add(new EbrahimEx("وَمَثَلُ كَلِمَةٍ خَبِيثَةٍ كَشَجَرَةٍ خَبِيثَةٍ اجْتُثَّتْ مِنْ فَوْقِ الْأَرْضِ مَا لَهَا مِنْ قَرَارٍ (26)"));
        ebrahimExes.add(new EbrahimEx("ومثل كلمة خبيثة -وهي كلمة الكفر- كشجرة خبيثة المأكل والمطعم، وهي شجرة الحنظل، اقتلعت من أعلى الأرض؛ لأن عروقها قريبة من سطح الأرض ما لها أصل ثابت، ولا فرع صاعد، وكذلك الكافر لا ثبات له ولا خير فيه، ولا يُرْفَع له عمل صالح إلى الله."));
        ebrahimExes.add(new EbrahimEx("يُثَبِّتُ اللَّهُ الَّذِينَ آمَنُوا بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ وَيُضِلُّ اللَّهُ الظَّالِمِينَ وَيَفْعَلُ اللَّهُ مَا يَشَاءُ (27)"));
        ebrahimExes.add(new EbrahimEx("يثبِّت الله الذين آمنوا بالقول الحق الراسخ، وهو شهادة أن لا إله إلا الله وأن محمدًا رسول الله، وما جاء به من الدين الحق يثبتهم الله به في الحياة الدنيا، وعند مماتهم بالخاتمة الحسنة، وفي القبر عند سؤال المَلَكين بهدايتهم إلى الجواب الصحيح، ويضل الله الظالمين عن الصواب في الدنيا والآخرة، ويفعل الله ما يشاء من توفيق أهل الإيمان وخِذْلان أهل الكفر والطغيان."));
        ebrahimExes.add(new EbrahimEx("أَلَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا نِعْمَتَ اللَّهِ كُفْرًا وَأَحَلُّوا قَوْمَهُمْ دَارَ الْبَوَارِ (28)"));
        ebrahimExes.add(new EbrahimEx("ألم تنظر أيها المخاطب -والمراد العموم- إلى حال المكذبين من كفار قريش الذين استبدلوا الكفر بالله بدلا عن شكره على نعمة الأمن بالحرم وبعثة النبي محمد صلى الله عليه وسلم فيهم؟ وقد أنزلوا أتباعهم دار الهلاك حين تَسببوا بإخراجهم إلى «بدر» فقُتِلوا وصار مصيرهم دار البوار."));
        ebrahimExes.add(new EbrahimEx("جَهَنَّمَ يَصْلَوْنَهَا وَبِئْسَ الْقَرَارُ (29)"));
        ebrahimExes.add(new EbrahimEx("وهي جهنم، يدخلونها ويقاسون حرها، وقَبُحَ المستقر مستقرهم."));
        ebrahimExes.add(new EbrahimEx("وَجَعَلُوا لِلَّهِ أَنْدَادًا لِيُضِلُّوا عَنْ سَبِيلِهِ قُلْ تَمَتَّعُوا فَإِنَّ مَصِيرَكُمْ إِلَى النَّارِ (30)"));
        ebrahimExes.add(new EbrahimEx("وجعل هؤلاء الكفار لله شركاء عبدوهم معه; ليُبْعدوا الناس عن دينه. قل لهم -أيها الرسول-: استمتعوا في الحياة الدنيا; فإنها سريعة الزوال، وإن مردَّكم ومرجعكم إلى عذاب جهنم."));
        ebrahimExes.add(new EbrahimEx("قُلْ لِعِبَادِيَ الَّذِينَ آمَنُوا يُقِيمُوا الصَّلَاةَ وَيُنْفِقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً مِنْ قَبْلِ أَنْ يَأْتِيَ يَوْمٌ لَا بَيْعٌ فِيهِ وَلَا خِلَالٌ (31)"));
        ebrahimExes.add(new EbrahimEx("قل -أيها الرسول- لعبادي الذين آمنوا: يؤدوا الصلاة بحدودها، ويخرجوا بعض ما أعطيناهم من المال في وجوه الخير الواجبة والمستحبة مسرِّين ذلك ومعلنين، من قبل أن يأتي يوم القيامة الذي لا ينفع فيه فداء ولا صداقة."));
        ebrahimExes.add(new EbrahimEx("اللَّهُ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَكُمْ وَسَخَّرَ لَكُمُ الْفُلْكَ لِتَجْرِيَ فِي الْبَحْرِ بِأَمْرِهِ وَسَخَّرَ لَكُمُ الْأَنْهَارَ (32)"));
        ebrahimExes.add(new EbrahimEx("الله تعالى الذي خلق السموات والأرض وأوجدهما من العدم، وأنزل المطر من السحاب فأحيا به الأرض بعد موتها، وأخرج لكم منها أرزاقكم، وذلَّل لكم السفن; لتسير في البحر بأمره لمنافعكم، وذلَّل لكم الأنهار لسقياكم وسقيا دوابكم وزروعكم وسائر منافعكم."));
        ebrahimExes.add(new EbrahimEx("وَسَخَّرَ لَكُمُ الشَّمْسَ وَالْقَمَرَ دَائِبَيْنِ وَسَخَّرَ لَكُمُ اللَّيْلَ وَالنَّهَارَ (33)"));
        ebrahimExes.add(new EbrahimEx("وذلَّل الله لكم الشمس والقمر لا يَفْتُران عن حركتهما; لتتحقق المصالح بهما، وذلَّل لكم الليل; لتسكنوا فيه وتستريحوا، والنهار; لتبتغوا من فضله، وتدبِّروا معايشكم."));
        ebrahimExes.add(new EbrahimEx("وَآتَاكُمْ مِنْ كُلِّ مَا سَأَلْتُمُوهُ وَإِنْ تَعُدُّوا نِعْمَتَ اللَّهِ لَا تُحْصُوهَا إِنَّ الْإِنْسَانَ لَظَلُومٌ كَفَّارٌ (34)"));
        ebrahimExes.add(new EbrahimEx("وأعطاكم من كل ما طلبتموه، وإن تعدُّوا نِعَم الله عليكم لا تطيقوا عدها ولا إحصاءها ولا القيام بشكرها; لكثرتها وتنوُّعها. إن الإنسان لَكثير الظلم لنفسه، كثير الجحود لنعم ربه."));
        ebrahimExes.add(new EbrahimEx("وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ (35)"));
        ebrahimExes.add(new EbrahimEx("واذكر -أيها الرسول- حين قال إبراهيم داعيًا ربه -بعد أن أسكن ابنه إسماعيل وأمه «هاجَر» وادي «مكة» -: رب اجعل «مكة» بلدَ أمنٍ يأمن كل مَن فيها، وأبعِدني وأبنائي عن عبادة الأصنام."));
        ebrahimExes.add(new EbrahimEx("رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِنَ النَّاسِ فَمَنْ تَبِعَنِي فَإِنَّهُ مِنِّي وَمَنْ عَصَانِي فَإِنَّكَ غَفُورٌ رَحِيمٌ (36)"));
        ebrahimExes.add(new EbrahimEx("ربِّ إن الأصنام تسبَّبتْ في إبعاد كثير من الناس عن طريق الحق، فمن اقتدى بي في التوحيد فهو على ديني وسُنَّتي، ومَن خالفني فيما دون الشرك، فإنك غفور لذنوب المذنبين -بفضلك- رحيم بهم، تعفو عمن تشاء منهم."));
        ebrahimExes.add(new EbrahimEx("رَبَّنَا إِنِّي أَسْكَنْتُ مِنْ ذُرِّيَّتِي بِوَادٍ غَيْرِ ذِي زَرْعٍ عِنْدَ بَيْتِكَ الْمُحَرَّمِ رَبَّنَا لِيُقِيمُوا الصَّلَاةَ فَاجْعَلْ أَفْئِدَةً مِنَ النَّاسِ تَهْوِي إِلَيْهِمْ وَارْزُقْهُمْ مِنَ الثَّمَرَاتِ لَعَلَّهُمْ يَشْكُرُونَ (37)"));
        ebrahimExes.add(new EbrahimEx("ربنا إني أسكنت من ذريتي بوادٍ ليس فيه زرع ولا ماء بجوار بيتك المحرم، ربنا إنني فعلت ذلك بأمرك; لكي يؤدوا الصلاة بحدودها، فاجعل قلوب بعض خلقك تَنزع إليهم وتحنُّ، وارزقهم في هذا المكان من أنواع الثمار; لكي يشكروا لك على عظيم نعمك. فاستجاب الله دعاءه."));
        ebrahimExes.add(new EbrahimEx("رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ وَمَا يَخْفَى عَلَى اللَّهِ مِنْ شَيْءٍ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ (38)"));
        ebrahimExes.add(new EbrahimEx("ربنا إنك تعلم كل ما نخفيه وما نظهره. وما يغيب عن علم الله شيء من الكائنات في الأرض ولا في السماء."));
        ebrahimExes.add(new EbrahimEx("الْحَمْدُ لِلَّهِ الَّذِي وَهَبَ لِي عَلَى الْكِبَرِ إِسْمَاعِيلَ وَإِسْحَاقَ إِنَّ رَبِّي لَسَمِيعُ الدُّعَاءِ (39)"));
        ebrahimExes.add(new EbrahimEx("يُثْني إبراهيم على الله تعالى، فيقول: الحمد لله الذي رزقني على كِبَر سني ولديَّ إسماعيل وإسحاق بعد دعائي أن يهب لي من الصالحين، إن ربي لسميع الدعاء ممن دعاه، وقد دعوته ولم يخيِّب رجائي."));
        ebrahimExes.add(new EbrahimEx("رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ (40)"));
        ebrahimExes.add(new EbrahimEx("رب اجعلني مداومًا على أداء الصلاة على أتم وجوهها، واجعل من ذريتي مَن يحافظ عليها، ربنا واستجب دعائي وتقبَّل عبادتي."));
        ebrahimExes.add(new EbrahimEx("رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ (41)"));
        ebrahimExes.add(new EbrahimEx("ربنا اغفر لي ما وقع مني مما لا يسلم منه البشر واغفر لوالديَّ، (وهذا قبل أن يتبيَّن له أن والده عدو لله) واغفر للمؤمنين جميعًا يوم يقوم الناس للحساب والجزاء."));
        ebrahimExes.add(new EbrahimEx("وَلَا تَحْسَبَنَّ اللَّهَ غَافِلًا عَمَّا يَعْمَلُ الظَّالِمُونَ إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الْأَبْصَارُ (42)"));
        ebrahimExes.add(new EbrahimEx("ولا تحسبن -أيها الرسول- أن الله غافل عما يعمله الظالمون: من التكذيب بك وبغيرك من الرسل، وإيذاء المؤمنين وغير ذلك من المعاصي، إنما يؤخِّرُ عقابهم ليوم شديد ترتفع فيه عيونهم ولا تَغْمَض; مِن هول ما تراه. وفي هذا تسلية لرسول الله محمد صلى الله عليه وسلم."));
        ebrahimExes.add(new EbrahimEx("مُهْطِعِينَ مُقْنِعِي رُءُوسِهِمْ لَا يَرْتَدُّ إِلَيْهِمْ طَرْفُهُمْ وَأَفْئِدَتُهُمْ هَوَاءٌ (43)"));
        ebrahimExes.add(new EbrahimEx("يوم يقوم الظالمون من قبورهم مسرعين لإجابة الداعي رافعي رؤوسهم لا يبصرون شيئًا لهول الموقف، وقلوبهم خالية ليس فيها شيء; لكثرة الخوف والوجل من هول ما ترى."));
        ebrahimExes.add(new EbrahimEx("وَأَنْذِرِ النَّاسَ يَوْمَ يَأْتِيهِمُ الْعَذَابُ فَيَقُولُ الَّذِينَ ظَلَمُوا رَبَّنَا أَخِّرْنَا إِلَى أَجَلٍ قَرِيبٍ نُجِبْ دَعْوَتَكَ وَنَتَّبِعِ الرُّسُلَ أَوَلَمْ تَكُونُوا أَقْسَمْتُمْ مِنْ قَبْلُ مَا لَكُمْ مِنْ زَوَالٍ (44)"));
        ebrahimExes.add(new EbrahimEx("وأنذر -أيها الرسول- الناس الذين أرسلتُكَ إليهم عذاب الله يوم القيامة، وعند ذلك يقول الذين ظلموا أنفسهم بالكفر: ربنا أَمْهِلْنا إلى وقت قريب نؤمن بك ونصدق رسلك. فيقال لهم توبيخًا: ألم تقسموا في حياتكم أنه لا زوال لكم عن الحياة الدنيا إلى الآخرة، فلم تصدِّقوا بهذا البعث؟"));
        ebrahimExes.add(new EbrahimEx("وَسَكَنْتُمْ فِي مَسَاكِنِ الَّذِينَ ظَلَمُوا أَنْفُسَهُمْ وَتَبَيَّنَ لَكُمْ كَيْفَ فَعَلْنَا بِهِمْ وَضَرَبْنَا لَكُمُ الْأَمْثَالَ (45)"));
        ebrahimExes.add(new EbrahimEx("وحللتم في مساكن الكافرين السابقين الذين ظلموا أنفسهم كقوم هود وصالح، وعلمتم -بما رأيتم وأُخبرتم- ما أنزلناه بهم من الهلاك، وضربنا لكم الأمثال في القرآن، فلم تعتبروا؟"));
        ebrahimExes.add(new EbrahimEx("وَقَدْ مَكَرُوا مَكْرَهُمْ وَعِنْدَ اللَّهِ مَكْرُهُمْ وَإِنْ كَانَ مَكْرُهُمْ لِتَزُولَ مِنْهُ الْجِبَالُ (46)"));
        ebrahimExes.add(new EbrahimEx("وقد دبَّر المشركون الشرَّ للرسول صلى الله عليه وسلم بقتله، وعند الله مكرهم فهو محيط به، وقد عاد مكرهم عليهم، وما كان مكرهم لتزول منه الجبال ولا غيرها لضعفه ووَهَنه، ولم يضرُّوا الله شيئًا، وإنما ضرُّوا أنفسهم."));
        ebrahimExes.add(new EbrahimEx("فَلَا تَحْسَبَنَّ اللَّهَ مُخْلِفَ وَعْدِهِ رُسُلَهُ إِنَّ اللَّهَ عَزِيزٌ ذُو انْتِقَامٍ (47)"));
        ebrahimExes.add(new EbrahimEx("فلا تحسبن -أيها الرسول- أن الله يخلف رسله ما وعدهم به من النصر وإهلاك مكذبيهم. إن الله عزيز لا يمتنع عليه شيء، منتقم من أعدائه أشد انتقام. والخطاب وإن كان خاصًّا بالنبي صلى الله عليه وسلم، فهو موجَّه لعموم الأمة."));
        ebrahimExes.add(new EbrahimEx("يَوْمَ تُبَدَّلُ الْأَرْضُ غَيْرَ الْأَرْضِ وَالسَّمَاوَاتُ وَبَرَزُوا لِلَّهِ الْوَاحِدِ الْقَهَّارِ (48)"));
        ebrahimExes.add(new EbrahimEx("وانتقام الله تعالى مِن أعدائه في يوم القيامة يوم تُبَدَّل هذه الأرض بأرض أخرى بيضاء نقيَّة كالفضة، وكذلك تُبَدَّل السموات بغيرها، وتخرج الخلائق من قبورها أحياء ظاهرين للقاء الله الواحد القهار، المتفرد بعظمته وأسمائه وصفاته وأفعاله وقهره لكل شيء."));
        ebrahimExes.add(new EbrahimEx("وَتَرَى الْمُجْرِمِينَ يَوْمَئِذٍ مُقَرَّنِينَ فِي الْأَصْفَادِ (49)"));
        ebrahimExes.add(new EbrahimEx("وتُبْصِرُ -أيها الرسول- المجرمين يوم القيامة مقيدين بالقيود، قد قُرِنت أيديهم وأرجلهم بالسلاسل، وهم في ذُلٍّ وهوان."));
        ebrahimExes.add(new EbrahimEx("سَرَابِيلُهُمْ مِنْ قَطِرَانٍ وَتَغْشَى وُجُوهَهُمُ النَّارُ (50)"));
        ebrahimExes.add(new EbrahimEx("ثيابهم من القَطِران الشديد الاشتعال، وتلفح وجوههم النار فتحرقها."));
        ebrahimExes.add(new EbrahimEx("لِيَجْزِيَ اللَّهُ كُلَّ نَفْسٍ مَا كَسَبَتْ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ (51)"));
        ebrahimExes.add(new EbrahimEx("فَعَل الله ذلك بهم; جزاء لهم بما كسبوا من الآثام في الدنيا، والله يجازي كل إنسان بما عمل مِن خير أو شر، إن الله سريع الحساب."));
        ebrahimExes.add(new EbrahimEx("هَذَا بَلَاغٌ لِلنَّاسِ وَلِيُنْذَرُوا بِهِ وَلِيَعْلَمُوا أَنَّمَا هُوَ إِلَهٌ وَاحِدٌ وَلِيَذَّكَّرَ أُولُو الْأَلْبَابِ (52)"));
        ebrahimExes.add(new EbrahimEx("هذا القرآن الذي أنزلناه إليك -أيها الرسول- بلاغ وإعلام للناس; لنصحهم وتخويفهم، ولكي يوقنوا أن الله هو الإله الواحد، فيعبدوه وحده لا شريك له، وليتعظ به أصحاب العقول السليمة."));


        quran_explanation_14_adapter = new quran_explanation_14_adapter(ebrahimExes ,QuranExplanation_14Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_14);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_14Activity.this));
        recyclerView.setAdapter(quran_explanation_14_adapter);


    }

}