package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_41Activity extends AppCompatActivity {

    ArrayList<FoselatEx> foselatExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_41_adapter quran_explanation_41_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_41);

        foselatExes.add(new FoselatEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيم"));
        foselatExes.add(new FoselatEx("حم (1)"));
        foselatExes.add(new FoselatEx("{حم} سبق الكلام على الحروف المقطَّعة في أول سورة البقرة."));
        foselatExes.add(new FoselatEx("تَنْزِيلٌ مِنَ الرَّحْمَنِ الرَّحِيمِ (2)"));
        foselatExes.add(new FoselatEx("هذا القرآن الكريم تنزيل من الرحمن الرحيم، نزَّله على نبيه محمد صلى الله عليه وسلم."));
        foselatExes.add(new FoselatEx("كِتَابٌ فُصِّلَتْ آيَاتُهُ قُرْآنًا عَرَبِيًّا لِقَوْمٍ يَعْلَمُونَ (3)"));
        foselatExes.add(new FoselatEx("كتاب بُيِّنت آياته تمام البيان، وَوُضِّحت معانيه وأحكامه، قرآنًا عربيًا ميسَّرًا فهمه لقوم يعلمون اللسان العربي."));
        foselatExes.add(new FoselatEx("بَشِيرًا وَنَذِيرًا فَأَعْرَضَ أَكْثَرُهُمْ فَهُمْ لَا يَسْمَعُونَ (4)"));
        foselatExes.add(new FoselatEx("بشيرًا بالثواب العاجل والآجل لمن آمن به وعمل بمقتضاه، ونذيرًا بالعقاب العاجل والآجل لمن كفر به، فأعرض عنه أكثر الناس، فهم لا يسمعون له سماع قَبول وإجابة."));
        foselatExes.add(new FoselatEx("وَقَالُوا قُلُوبُنَا فِي أَكِنَّةٍ مِمَّا تَدْعُونَا إِلَيْهِ وَفِي آذَانِنَا وَقْرٌ وَمِنْ بَيْنِنَا وَبَيْنِكَ حِجَابٌ فَاعْمَلْ إِنَّنَا عَامِلُونَ (5)"));
        foselatExes.add(new FoselatEx("وقال هؤلاء المعرضون الكافرون للنبي محمد صلى الله عليه وسلم: قلوبنا في أغطية مانعة لنا من فهم ما تدعونا إليه، وفي آذاننا صمم فلا نسمع، ومن بيننا وبينك -يا محمد- ساتر يحجبنا عن إجابة دعوتك، فاعمل على وَفْق دينك، كما أننا عاملون على وَفْق ديننا."));
        foselatExes.add(new FoselatEx("قُلْ إِنَّمَا أَنَا بَشَرٌ مِثْلُكُمْ يُوحَى إِلَيَّ أَنَّمَا إِلَهُكُمْ إِلَهٌ وَاحِدٌ فَاسْتَقِيمُوا إِلَيْهِ وَاسْتَغْفِرُوهُ وَوَيْلٌ لِلْمُشْرِكِينَ (6)"));
        foselatExes.add(new FoselatEx("قل لهم -أيها الرسول-: إنما أنا بشر مثلكم يوحي الله إليَّ أنما إلهكم الذي يستحق العبادة، إله واحد لا شريك له، فاسلكوا الطريق الموصل إليه، واطلبوا مغفرته. وعذاب للمشركين الذين عبدوا من دون الله أوثانًا لا تنفع ولا تضر، والذين لم يطهروا أنفسهم بتوحيد ربهم، والإخلاص له."));
        foselatExes.add(new FoselatEx("الَّذِينَ لَا يُؤْتُونَ الزَّكَاةَ وَهُمْ بِالْآخِرَةِ هُمْ كَافِرُونَ (7)"));
        foselatExes.add(new FoselatEx("ولا يؤدون الصدقة إلى مستحقيها، فلا إخلاص منهم للخالق ولا نفع فيهم للخلق، وهم لا يؤمنون بالبعث، ولا بالجنة والنار."));
        foselatExes.add(new FoselatEx("إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ (8)"));
        foselatExes.add(new FoselatEx("إن الذين آمنوا بالله ورسوله وكتابه وعملوا الأعمال الصالحة مخلصين لله فيها، لهم ثواب عظيم غير مقطوع ولا ممنوع."));
        foselatExes.add(new FoselatEx("قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ بِالَّذِي خَلَقَ الْأَرْضَ فِي يَوْمَيْنِ وَتَجْعَلُونَ لَهُ أَنْدَادًا ذَلِكَ رَبُّ الْعَالَمِينَ (9)"));
        foselatExes.add(new FoselatEx("قل -أيها الرسول- لهؤلاء المشركين موبخًا لهم ومتعجبًا من فعلهم: أإنكم لتكفرون بالله الذي خلق الأرض في يومين اثنين، وتجعلون له نظراء وشركاء تعبدونهم معه؟ ذلك الخالق هو رب العالمين كلهم."));
        foselatExes.add(new FoselatEx("وَجَعَلَ فِيهَا رَوَاسِيَ مِنْ فَوْقِهَا وَبَارَكَ فِيهَا وَقَدَّرَ فِيهَا أَقْوَاتَهَا فِي أَرْبَعَةِ أَيَّامٍ سَوَاءً لِلسَّائِلِينَ (10)"));
        foselatExes.add(new FoselatEx("وجعل سبحانه في الأرض جبالا ثوابت من فوقها، وبارك فيها فجعلها دائمة الخير لأهلها، وقدَّر فيها أرزاق أهلها من الغذاء، وما يصلحهم من المعاش في تمام أربعة أيام: يومان خلق فيهما الأرض، ويومان جعل فيها رواسي وقدر فيها أقواتها، سواء للسائلين أي: لمن أراد السؤال عن ذلك؛ ليعلمه."));
        foselatExes.add(new FoselatEx("ثُمَّ اسْتَوَى إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ (11)"));
        foselatExes.add(new FoselatEx("ثم استوى سبحانه وتعالى، أي قصد إلى السماء وكانت دخانًا من قبلُ، فقال للسماء وللأرض: انقادا لأمري مختارتين أو مجبرتين. قالتا: أتينا مذعنين لك، ليس لنا إرادة تخالف إرادتك."));
        foselatExes.add(new FoselatEx("فَقَضَاهُنَّ سَبْعَ سَمَاوَاتٍ فِي يَوْمَيْنِ وَأَوْحَى فِي كُلِّ سَمَاءٍ أَمْرَهَا وَزَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَحِفْظًا ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ (12)"));
        foselatExes.add(new FoselatEx("فقضى الله خلق السماوات السبع وتسويتهن في يومين، فتم بذلك خلق السماوات والأرض في ستة أيام، لحكمة يعلمها الله، مع قدرته سبحانه على خلقهما في لحظة واحدة، وأوحى في كل سماء ما أراده وما أمر به فيها، وزيَّنا السماء الدنيا بالنجوم المضيئة، وحفظًا لها من الشياطين الذين يسترقون السمع، ذلك الخلق البديع تقدير العزيز في ملكه، العليم الذي أحاط علمه بكل شيء."));
        foselatExes.add(new FoselatEx("فَإِنْ أَعْرَضُوا فَقُلْ أَنْذَرْتُكُمْ صَاعِقَةً مِثْلَ صَاعِقَةِ عَادٍ وَثَمُودَ (13)"));
        foselatExes.add(new FoselatEx("فإن أعرض هؤلاء المكذبون بعدما بُيَّن لهم من أوصاف القرآن الحميدة، ومن صفات الإله العظيم، فقل لهم: قد أنذرتكم عذابًا يستأصلكم مثل عذاب عاد وثمود حين كفروا بربهم وعصوا رسله."));
        foselatExes.add(new FoselatEx("إِذْ جَاءَتْهُمُ الرُّسُلُ مِنْ بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ قَالُوا لَوْ شَاءَ رَبُّنَا لَأَنْزَلَ مَلَائِكَةً فَإِنَّا بِمَا أُرْسِلْتُمْ بِهِ كَافِرُونَ (14)"));
        foselatExes.add(new FoselatEx("حين جاءت الرسل عادًا وثمود، يتبع بعضهم بعضًا متوالين، يأمرونهم بعبادة الله وحده لا شريك له، قالوا لرسلهم: لو شاء ربنا أن نوحده ولا نعبد من دونه شيئًا غيره، لأنزل إلينا ملائكة من السماء رسلا بما تدعوننا إليه، ولم يرسلكم وأنتم بشر مثلنا، فإنا بما أرسلكم الله به إلينا من الإيمان بالله وحده جاحدون."));
        foselatExes.add(new FoselatEx("فَأَمَّا عَادٌ فَاسْتَكْبَرُوا فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَقَالُوا مَنْ أَشَدُّ مِنَّا قُوَّةً أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ (15)"));
        foselatExes.add(new FoselatEx("فأما عاد قوم هود فقد استعلَوا في الأرض على العباد بغير حق، وقالوا في غرور: مَن أشد منا قوة؟ أو لم يروا أن الله تعالى الذي خلقهم هو أشدُّ منهم قوة وبطشًا؟ وكانوا بأدلتنا وحججنا يجحدون."));
        foselatExes.add(new FoselatEx("فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي أَيَّامٍ نَحِسَاتٍ لِنُذِيقَهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا وَلَعَذَابُ الْآخِرَةِ أَخْزَى وَهُمْ لَا يُنْصَرُونَ (16)"));
        foselatExes.add(new FoselatEx("فأرسلنا عليهم ريحًا شديدة البرودة عالية الصوت في أيام مشؤومات عليهم؛ لنذيقهم عذاب الذل والهوان في الحياة الدنيا، ولَعذاب الآخرة أشد ذلا وهوانًا، وهم لا يُنْصَرون بمنع العذاب عنهم."));
        foselatExes.add(new FoselatEx("وَأَمَّا ثَمُودُ فَهَدَيْنَاهُمْ فَاسْتَحَبُّوا الْعَمَى عَلَى الْهُدَى فَأَخَذَتْهُمْ صَاعِقَةُ الْعَذَابِ الْهُونِ بِمَا كَانُوا يَكْسِبُونَ (17)"));
        foselatExes.add(new FoselatEx("وأما ثمود قوم صالح فقد بينَّا لهم سبيل الحق وطريق الرشد، فاختاروا العمى على الهدى، فأهلكتهم صاعقة العذاب المهين؛ بسبب ما كانوا يقترفون من الآثام بكفرهم بالله وتكذيبهم رسله."));
        foselatExes.add(new FoselatEx("وَنَجَّيْنَا الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ (18)"));
        foselatExes.add(new FoselatEx("ونجَّينا الذين آمنوا من العذاب الذي أخذ عادًا وثمود، وكان هؤلاء الناجون يخافون الله ويتقونه."));
        foselatExes.add(new FoselatEx("وَيَوْمَ يُحْشَرُ أَعْدَاءُ اللَّهِ إِلَى النَّارِ فَهُمْ يُوزَعُونَ (19)"));
        foselatExes.add(new FoselatEx("ويوم يُحشر أعداء الله إلى نار جهنم، تَرُدُّ زبانية العذاب أولَهم على آخرهم."));
        foselatExes.add(new FoselatEx("حَتَّى إِذَا مَا جَاءُوهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَارُهُمْ وَجُلُودُهُمْ بِمَا كَانُوا يَعْمَلُونَ (20)"));
        foselatExes.add(new FoselatEx("حتى إذا ما جاؤوا النار، وأنكروا جرائمهم شهد عليهم سمعهم وأبصارهم وجلودهم بما كانوا يعملون في الدنيا من الذنوب والآثام."));
        foselatExes.add(new FoselatEx("وَقَالُوا لِجُلُودِهِمْ لِمَ شَهِدْتُمْ عَلَيْنَا قَالُوا أَنْطَقَنَا اللَّهُ الَّذِي أَنْطَقَ كُلَّ شَيْءٍ وَهُوَ خَلَقَكُمْ أَوَّلَ مَرَّةٍ وَإِلَيْهِ تُرْجَعُونَ (21)"));
        foselatExes.add(new FoselatEx("وقال هؤلاء الذين يُحْشرون إلى النار من أعداء الله لجلودهم معاتبين: لِمَ شهدتم علينا؟ فأجابتهم جلودهم: أنطقنا الله الذي أنطق كل شيء، وهو الذي خلقكم أول مرة ولم تكونوا شيئًا، وإليه مصيركم بعد الموت للحساب والجزاء."));
        foselatExes.add(new FoselatEx("وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ وَلَكِنْ ظَنَنْتُمْ أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِمَّا تَعْمَلُونَ (22)"));
        foselatExes.add(new FoselatEx("وما كنتم تَسْتَخْفون عند ارتكابكم المعاصي؛ خوفًا من أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم يوم القيامة، ولكن ظننتم بارتكابكم المعاصي أن الله لا يعلم كثيرًا من أعمالكم التي تعصون الله بها."));
        foselatExes.add(new FoselatEx("وَذَلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنْتُمْ بِرَبِّكُمْ أَرْدَاكُمْ فَأَصْبَحْتُمْ مِنَ الْخَاسِرِينَ (23)"));
        foselatExes.add(new FoselatEx("وذلكم ظنكم السيِّئ الذي ظننتموه بربكم أهلككم، فأوردكم النار، فأصبحتم اليوم من الخاسرين الذين خسروا أنفسهم وأهليهم."));
        foselatExes.add(new FoselatEx("فَإِنْ يَصْبِرُوا فَالنَّارُ مَثْوًى لَهُمْ وَإِنْ يَسْتَعْتِبُوا فَمَا هُمْ مِنَ الْمُعْتَبِينَ (24)"));
        foselatExes.add(new FoselatEx("فإن يصبروا على العذاب فالنار مأواهم، وإن يسألوا الرجوع إلى الدنيا؛ ليستأنفوا العمل الصالح لا يُجابوا إلى ذلك، ولا تُقبل لهم أعذار."));
        foselatExes.add(new FoselatEx("وَقَيَّضْنَا لَهُمْ قُرَنَاءَ فَزَيَّنُوا لَهُمْ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَحَقَّ عَلَيْهِمُ الْقَوْلُ فِي أُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِنَ الْجِنِّ وَالْإِنْسِ إِنَّهُمْ كَانُوا خَاسِرِينَ (25)"));
        foselatExes.add(new FoselatEx("وهيأنا لهؤلاء الظالمين الجاحدين قرناء فاسدين من شياطين الإنس والجن، فزينوا لهم قبائح أعمالهم في الدنيا، ودعَوهم إلى لذاتها وشهواتها المحرمة، وزَيَّنوا لهم ما خَلْفهم من أمور الآخرة، فأنسوهم ذِكرها، ودعَوهم إلى التكذيب بالمعاد، وبذلك استحقوا دخول النار في جملة أمم سابقة من كفرة الجن والإنس، إنهم كانوا خاسرين أعمالهم في الدنيا وأنفسهم وأهليهم يوم القيامة."));
        foselatExes.add(new FoselatEx("وَقَالَ الَّذِينَ كَفَرُوا لَا تَسْمَعُوا لِهَذَا الْقُرْآنِ وَالْغَوْا فِيهِ لَعَلَّكُمْ تَغْلِبُونَ (26)"));
        foselatExes.add(new FoselatEx("وقال الكافرون بعضهم لبعض متواصين فيما بينهم: لا تسمعوا لهذا القرآن، ولا تطيعوه، ولا تنقادوا لأوامره، وارفعوا أصواتكم بالصياح والصفير والتخليط على محمد إذا قرأ القرآن؛ لعلكم تغلبونه، فيترك القراءة، وننتصر عليه."));
        foselatExes.add(new FoselatEx("فَلَنُذِيقَنَّ الَّذِينَ كَفَرُوا عَذَابًا شَدِيدًا وَلَنَجْزِيَنَّهُمْ أَسْوَأَ الَّذِي كَانُوا يَعْمَلُونَ (27)"));
        foselatExes.add(new FoselatEx("فلنذيقن الذين قالوا هذا القول عذابًا شديدًا في الدنيا والآخرة، ولنجزينهم أسوأ ما كانوا يعملون من السيئات."));
        foselatExes.add(new FoselatEx("ذَلِكَ جَزَاءُ أَعْدَاءِ اللَّهِ النَّارُ لَهُمْ فِيهَا دَارُ الْخُلْدِ جَزَاءً بِمَا كَانُوا بِآيَاتِنَا يَجْحَدُونَ (28)"));
        foselatExes.add(new FoselatEx("هذا الجزاء الذي يُجزى به هؤلاء الذين كفروا جزاء أعداء الله النار، لهم فيها دار الخلود الدائم؛ جزاء بما كانوا بحججنا وأدلتنا يجحدون في الدنيا. والآية دالة على عظم جريمة من صرف الناس عن القرآن العظيم، وصدهم عن تدبره وهدايته بأيِّ وسيلة كانت."));
        foselatExes.add(new FoselatEx("وَقَالَ الَّذِينَ كَفَرُوا رَبَّنَا أَرِنَا اللَّذَيْنِ أَضَلَّانَا مِنَ الْجِنِّ وَالْإِنْسِ نَجْعَلْهُمَا تَحْتَ أَقْدَامِنَا لِيَكُونَا مِنَ الْأَسْفَلِينَ (29)"));
        foselatExes.add(new FoselatEx("وقال الذين كفروا بالله ورسوله، وهم في النار: ربنا أرنا اللذَين أضلانا من خلقك من الجن والإنس نجعلهما تحت أقدامنا؛ ليكونا في الدرك الأسفل من النار."));
        foselatExes.add(new FoselatEx("إِنَّ الَّذِينَ قَالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقَامُوا تَتَنَزَّلُ عَلَيْهِمُ الْمَلَائِكَةُ أَلَّا تَخَافُوا وَلَا تَحْزَنُوا وَأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنْتُمْ تُوعَدُونَ (30)"));
        foselatExes.add(new FoselatEx("إن الذين قالوا ربنا الله تعالى وحده لا شريك له، ثم استقاموا على شريعته، تتنزل عليهم الملائكة عند الموت قائلين لهم: لا تخافوا من الموت وما بعده، ولا تحزنوا على ما تخلفونه وراءكم من أمور الدنيا، وأبشروا بالجنة التي كنتم توعدون بها."));
        foselatExes.add(new FoselatEx("نَحْنُ أَوْلِيَاؤُكُمْ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ وَلَكُمْ فِيهَا مَا تَشْتَهِي أَنْفُسُكُمْ وَلَكُمْ فِيهَا مَا تَدَّعُونَ (31)"));
        foselatExes.add(new FoselatEx("وتقول لهم الملائكة: نحن أنصاركم في الحياة الدنيا، نسددكم ونحفظكم بأمر الله، وكذلك نكون معكم في الآخرة، ولكم في الجنة كل ما تشتهيه أنفسكم مما تختارونه، وتَقَرُّ به أعينكم، ومهما طلبتم من شيء وجدتموه بين أيديكم ضيافة وإنعامًا."));
        foselatExes.add(new FoselatEx("نُزُلًا مِنْ غَفُورٍ رَحِيمٍ (32)"));
        foselatExes.add(new FoselatEx("لكم مِن غفور لذنوبكم، رحيم بكم."));
        foselatExes.add(new FoselatEx("وَمَنْ أَحْسَنُ قَوْلًا مِمَّنْ دَعَا إِلَى اللَّهِ وَعَمِلَ صَالِحًا وَقَالَ إِنَّنِي مِنَ الْمُسْلِمِينَ (33)"));
        foselatExes.add(new FoselatEx("لا أحد أحسن قولا ممن دعا إلى توحيد الله وعبادته وحده وعمل صالحًا وقال: إنني من المسلمين المنقادين لأمر الله وشرعه. وفي الآية حث على الدعوة إلى الله سبحانه، وبيان فضل العلماء الداعين إليه على بصيرة، وَفْق ما جاء عن رسول الله محمد صلى الله عليه وسلم."));
        foselatExes.add(new FoselatEx("وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ (34)"));
        foselatExes.add(new FoselatEx("ولا تستوي حسنة الذين آمنوا بالله، واستقاموا على شرعه، وأحسنوا إلى خلقه، وسيئة الذين كفروا به وخالفوا أمره، وأساؤوا إلى خلقه. ادفع -أيها الرسول- بعفوك وحلمك وإحسانك مَن أساء إليك، وقابل إساءته لك بالإحسان إليه، فبذلك يصير المسيء إليك الذي بينك وبينه عداوة كأنه قريب لك شفيق عليك."));
        foselatExes.add(new FoselatEx("وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ (35)"));
        foselatExes.add(new FoselatEx("وما يُوفَّق لهذه الخصلة الحميدة إلا الذين صبروا على المكاره والأذى، وحملوا أنفسهم على ما يحبه الله، وما يُوفَّق لها إلا ذو نصيب وافر من السعادة في الدنيا والآخرة."));
        foselatExes.add(new FoselatEx("وَإِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ (36)"));
        foselatExes.add(new FoselatEx("وإما يلقينَّ الشيطان في نفسك وسوسة من حديث النفس لحملك على مجازاة المسيء بالإساءة، فاستجر بالله واعتصم به، إن الله هو السميع لاستعاذتك به، العليم بأمور خلقه جميعها."));
        foselatExes.add(new FoselatEx("وَمِنْ آيَاتِهِ اللَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُ لَا تَسْجُدُوا لِلشَّمْسِ وَلَا لِلْقَمَرِ وَاسْجُدُوا لِلَّهِ الَّذِي خَلَقَهُنَّ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ (37)"));
        foselatExes.add(new FoselatEx("ومِن حجج الله على خلقه، ودلائله على وحدانيته وكمال قدرته اختلاف الليل والنهار، وتعاقبهما، واختلاف الشمس والقمر وتعاقبهما، كل ذلك تحت تسخيره وقهره. لا تسجدوا للشمس ولا للقمر- فإنهما مدَبَّران مخلوقان- واسجدوا لله الذي خلقهن، إن كنتم حقًّا منقادين لأمره سامعين مطيعين له، تعبدونه وحده لا شريك له."));
        foselatExes.add(new FoselatEx("فَإِنِ اسْتَكْبَرُوا فَالَّذِينَ عِنْدَ رَبِّكَ يُسَبِّحُونَ لَهُ بِاللَّيْلِ وَالنَّهَارِ وَهُمْ لَا يَسْأَمُونَ (38)"));
        foselatExes.add(new FoselatEx("فإن استكبر هؤلاء المشركون عن السجود لله، فإن الملائكة الذين عند ربك لا يستكبرون عن ذلك، بل يسبحون له، وينزِّهونه عن كل نقص بالليل والنهار، وهم لا يَفْتُرون عن ذلك، ولا يملون."));
        foselatExes.add(new FoselatEx("وَمِنْ آيَاتِهِ أَنَّكَ تَرَى الْأَرْضَ خَاشِعَةً فَإِذَا أَنْزَلْنَا عَلَيْهَا الْمَاءَ اهْتَزَّتْ وَرَبَتْ إِنَّ الَّذِي أَحْيَاهَا لَمُحْيِ الْمَوْتَى إِنَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (39)"));
        foselatExes.add(new FoselatEx("ومن علامات وحدانية الله وقدرته: أنك ترى الأرض يابسة لا نبات فيها، فإذا أنزلنا عليها المطر دبَّت فيها الحياة، وتحركت بالنبات، وانتفخت وعلت، إن الذي أحيا هذه الأرض بعد همودها، قادر على إحياء الخلق بعد موتهم، إنه على كل شيء قدير، فكما لا تعجز قدرته عن إحياء الأرض بعد موتها، فكذلك لا تعجز عن إحياء الموتى."));
        foselatExes.add(new FoselatEx("إِنَّ الَّذِينَ يُلْحِدُونَ فِي آيَاتِنَا لَا يَخْفَوْنَ عَلَيْنَا أَفَمَنْ يُلْقَى فِي النَّارِ خَيْرٌ أَمْ مَنْ يَأْتِي آمِنًا يَوْمَ الْقِيَامَةِ اعْمَلُوا مَا شِئْتُمْ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ (40)"));
        foselatExes.add(new FoselatEx("إن الذين يميلون عن الحق، فيكفرون بالقرآن ويحرفونه، لا يَخْفَون علينا، بل نحن مُطَّلعون عليهم. أفهذا الملحد في آيات الله الذي يُلقى في النار خير، أم الذي يأتي يوم القيامة آمنًا من عذاب الله، مستحقًا لثوابه; لإيمانه به وتصديقه بآياته؟ اعملوا -أيها الملحدون- ما شئتم، فإن الله تعالى بأعمالكم بصير، لا يخفى عليه شيء منها، وسيجازيكم على ذلك. وفي هذا وعيد وتهديد لهم."));
        foselatExes.add(new FoselatEx("إِنَّ الَّذِينَ كَفَرُوا بِالذِّكْرِ لَمَّا جَاءَهُمْ وَإِنَّهُ لَكِتَابٌ عَزِيزٌ (41)"));
        foselatExes.add(new FoselatEx("إن الذين جحدوا بهذا القرآن وكذَّبوا به حين جاءهم هالكون ومعذَّبون، وإن هذا القرآن لكتاب عزيز بإعزاز الله إياه وحفظه له من كل تغيير أو تبديل."));
        foselatExes.add(new FoselatEx("لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ (42)"));
        foselatExes.add(new FoselatEx("لا يأتيه الباطل من أي ناحية من نواحيه ولا يبطله شيء، فهو محفوظ من أن يُنقص منه، أو يزاد فيه، تنزيل من حكيم بتدبير أمور عباده، محمود على ما له من صفات الكمال."));
        foselatExes.add(new FoselatEx("مَا يُقَالُ لَكَ إِلَّا مَا قَدْ قِيلَ لِلرُّسُلِ مِنْ قَبْلِكَ إِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ وَذُو عِقَابٍ أَلِيمٍ (43)"));
        foselatExes.add(new FoselatEx("ما يقول لك هؤلاء المشركون -أيها الرسول- إلا ما قد قاله مَن قبلهم مِنَ الأمم لرسلهم، فاصبر على ما ينالك في سبيل الدعوة إلى الله. إن ربك لذو مغفرة لذنوب التائبين، وذو عقاب لمن أصرَّ على كفره وتكذيبه."));
        foselatExes.add(new FoselatEx("وَلَوْ جَعَلْنَاهُ قُرْآنًا أَعْجَمِيًّا لَقَالُوا لَوْلَا فُصِّلَتْ آيَاتُهُ أَأَعْجَمِيٌّ وَعَرَبِيٌّ قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ وَالَّذِينَ لَا يُؤْمِنُونَ فِي آذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى أُولَئِكَ يُنَادَوْنَ مِنْ مَكَانٍ بَعِيدٍ (44)"));
        foselatExes.add(new FoselatEx("ولو جعلنا هذا القرآن الذي أنزلناه عليك -أيها الرسول- أعجميًا، لقال المشركون: هلا بُيِّنتْ آياته، فنفقهه ونعلمه، أأعجمي هذا القرآن، ولسان الذي أنزل عليه عربي؟ هذا لا يكون. قل لهم -أيها الرسول-: هذا القرآن للذين آمنوا بالله ورسوله هدى من الضلالة، وشفاء لما في الصدور من الشكوك والأمراض، والذين لا يؤمنون بالقرآن في آذانهم صمم من سماعه وتدبره، وهو على قلوبهم عَمًى، فلا يهتدون به، أولئك المشركون كمن يُنادى، وهو في مكان بعيد لا يسمع داعيًا، ولا يجيب مناديًا."));
        foselatExes.add(new FoselatEx("وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ فَاخْتُلِفَ فِيهِ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَبِّكَ لَقُضِيَ بَيْنَهُمْ وَإِنَّهُمْ لَفِي شَكٍّ مِنْهُ مُرِيبٍ (45)"));
        foselatExes.add(new FoselatEx("ولقد آتينا موسى التوراة كما آتيناك -أيها الرسول- القرآن فاختلف فيها قومه: فمنهم مَن آمن، ومنهم مَن كذَّب. ولولا كلمة سبقت من ربك بتأجيل العذاب عن قومك لفُصِل بينهم بإهلاك الكافرين في الحال، وإن المشركين لفي شك من القرآن شديد الريبة."));
        foselatExes.add(new FoselatEx("مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ وَمَنْ أَسَاءَ فَعَلَيْهَا وَمَا رَبُّكَ بِظَلَّامٍ لِلْعَبِيدِ (46)"));
        foselatExes.add(new FoselatEx("من عمل صالحًا فأطاع الله ورسوله فلنفسه ثواب عمله، ومن أساء فعصى الله ورسوله فعلى نفسه وزر عمله. وما ربك بظلام للعبيد، بنقص حسنة أو زيادة سيِّئة."));
        foselatExes.add(new FoselatEx("إِلَيْهِ يُرَدُّ عِلْمُ السَّاعَةِ وَمَا تَخْرُجُ مِنْ ثَمَرَاتٍ مِنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنْثَى وَلَا تَضَعُ إِلَّا بِعِلْمِهِ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَائِي قَالُوا آذَنَّاكَ مَا مِنَّا مِنْ شَهِيدٍ (47)"));
        foselatExes.add(new FoselatEx("إلى الله تعالى وحده لا شريك له يُرْجَع علم الساعة، فإنه لا يعلم أحد متى قيامها غيره، وما تخرج من ثمرات من أوعيتها، وما تحمل مِن أنثى ولا تضع حَمْلها إلا بعلم من الله، لا يخفى عليه شيء من ذلك. ويوم ينادي الله تعالى المشركين يوم القيامة توبيخًا لهم وإظهارًا لكذبهم: أين شركائي الذين كنتم تشركونهم في عبادتي؟ قالوا: أعلمناك الآن ما منا من أحد يشهد اليوم أن معك شريكًا."));
        foselatExes.add(new FoselatEx("وَضَلَّ عَنْهُمْ مَا كَانُوا يَدْعُونَ مِنْ قَبْلُ وَظَنُّوا مَا لَهُمْ مِنْ مَحِيصٍ (48)"));
        foselatExes.add(new FoselatEx("وذهب عن هؤلاء المشركين شركاؤهم الذين كانوا يعبدونهم من دون الله، فلم ينفعوهم، وأيقنوا أن لا ملجأ لهم من عذاب الله، ولا محيد عنه."));
        foselatExes.add(new FoselatEx("لَا يَسْأَمُ الْإِنْسَانُ مِنْ دُعَاءِ الْخَيْرِ وَإِنْ مَسَّهُ الشَّرُّ فَيَئُوسٌ قَنُوطٌ (49)"));
        foselatExes.add(new FoselatEx("لا يملُّ الإنسان من دعاء ربه طالبًا الخير الدنيوي، وإن أصابه فقر وشدة فهو يؤوس من رحمة الله، قنوط بسوء الظن بربه."));
        foselatExes.add(new FoselatEx("وَلَئِنْ أَذَقْنَاهُ رَحْمَةً مِنَّا مِنْ بَعْدِ ضَرَّاءَ مَسَّتْهُ لَيَقُولَنَّ هَذَا لِي وَمَا أَظُنُّ السَّاعَةَ قَائِمَةً وَلَئِنْ رُجِعْتُ إِلَى رَبِّي إِنَّ لِي عِنْدَهُ لَلْحُسْنَى فَلَنُنَبِّئَنَّ الَّذِينَ كَفَرُوا بِمَا عَمِلُوا وَلَنُذِيقَنَّهُمْ مِنْ عَذَابٍ غَلِيظٍ (50)"));
        foselatExes.add(new FoselatEx("ولئن أذقنا الإنسان نعمة منا من بعد شدة وبلاء لم يشكر الله تعالى، بل يطغى ويقول: أتاني هذا؛ لأني مستحق له، وما أعتقد أن الساعة آتية، وذلك إنكار منه للبعث، وعلى تقدير إتيان الساعة وأني سأرجع إلى ربي، فإن لي عنده الجنة، فلنخبرن الذين كفروا يوم القيامة بما عملوا من سيئات، ولنذيقنهم من العذاب الشديد."));
        foselatExes.add(new FoselatEx("وَإِذَا أَنْعَمْنَا عَلَى الْإِنْسَانِ أَعْرَضَ وَنَأَى بِجَانِبِهِ وَإِذَا مَسَّهُ الشَّرُّ فَذُو دُعَاءٍ عَرِيضٍ (51)"));
        foselatExes.add(new FoselatEx("وإذا أنعمنا على الإنسان بصحة أو رزق أو غيرهما أعرض وترفَّع عن الانقياد إلى الحق، وإن أصابه ضر فهو ذو دعاء كثير بأن يكشف الله ضرَّه، فهو يعرف ربه في الشدة، ولا يعرفه في الرخاء."));
        foselatExes.add(new FoselatEx("قُلْ أَرَأَيْتُمْ إِنْ كَانَ مِنْ عِنْدِ اللَّهِ ثُمَّ كَفَرْتُمْ بِهِ مَنْ أَضَلُّ مِمَّنْ هُوَ فِي شِقَاقٍ بَعِيدٍ (52)"));
        foselatExes.add(new FoselatEx("قل -أيها الرسول- لهؤلاء المكذبين: أخبروني إن كان هذا القرآن من عند الله ثم جحدتم وكذَّبتم به، لا أحد أضل منكم؛ لأنكم في خلاف بعيد عن الحق بكفركم بالقرآن وتكذيبكم به."));
        foselatExes.add(new FoselatEx("سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنْفُسِهِمْ حَتَّى يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلَى كُلِّ شَيْءٍ شَهِيدٌ (53)"));
        foselatExes.add(new FoselatEx("سَنُري هؤلاء المكذبين آياتنا من الفتوحات وظهور الإسلام على الأقاليم وسائر الأديان، وفي أقطار السموات والأرض، وما يحدثه الله فيهما من الحوادث العظيمة، وفي أنفسهم وما اشتملت عليه من بديع آيات الله وعجائب صنعه، حتى يتبين لهم من تلك الآيات بيان لا يقبل الشك أن القرآن الكريم هو الحق الموحَى به من رب العالمين. أو لم يكفهم دليلا على أن القرآن حق، ومَن جاء به صادق، شهادة الله تعالى؟ فإنه قد شهد له بالتصديق، وهو على كل شيء شهيد، ولا شيء أكبر شهادة من شهادته سبحانه وتعالى."));
        foselatExes.add(new FoselatEx("أَلَا إِنَّهُمْ فِي مِرْيَةٍ مِنْ لِقَاءِ رَبِّهِمْ أَلَا إِنَّهُ بِكُلِّ شَيْءٍ مُحِيطٌ (54)"));
        foselatExes.add(new FoselatEx("ألا إن هؤلاء الكافرين في شك عظيم من البعث بعد الممات. ألا إن الله -جلَّ وعلا- بكل شيء محيط علمًا وقدرة وعزةً، لا يخفى عليه شيء في الأرض ولا في السماء."));




        quran_explanation_41_adapter = new quran_explanation_41_adapter(foselatExes ,QuranExplanation_41Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_41);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_41Activity.this));
        recyclerView.setAdapter(quran_explanation_41_adapter);


    }

}