package com.example.muslim;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class QuranExplanation_39Activity extends AppCompatActivity {

    ArrayList<AlzomrEx> alzomrExes = new ArrayList<>();
    RecyclerView recyclerView;
    quran_explanation_39_adapter quran_explanation_39_adapter;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_quran_explanation_39);

        alzomrExes.add(new AlzomrEx("بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ"));
        alzomrExes.add(new AlzomrEx("تَنْزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ (1)"));
        alzomrExes.add(new AlzomrEx("تنزيل القرآن إنما هو من الله العزيز في قدرته وانتقامه، الحكيم في تدبيره وأحكامه."));
        alzomrExes.add(new AlzomrEx("إِنَّا أَنْزَلْنَا إِلَيْكَ الْكِتَابَ بِالْحَقِّ فَاعْبُدِ اللَّهَ مُخْلِصًا لَهُ الدِّينَ (2)"));
        alzomrExes.add(new AlzomrEx("إنا أنزلنا إليك -أيها الرسول- القرآن يأمر بالحق والعدل، فاعبد الله وحده، وأخلص له جميع دينك."));
        alzomrExes.add(new AlzomrEx("أَلَا لِلَّهِ الدِّينُ الْخَالِصُ وَالَّذِينَ اتَّخَذُوا مِنْ دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَا إِلَى اللَّهِ زُلْفَى إِنَّ اللَّهَ يَحْكُمُ بَيْنَهُمْ فِي مَا هُمْ فِيهِ يَخْتَلِفُونَ إِنَّ اللَّهَ لَا يَهْدِي مَنْ هُوَ كَاذِبٌ كَفَّارٌ (3)"));
        alzomrExes.add(new AlzomrEx("ألا لله وحده الطاعة التامة السالمة من الشرك، والذين أشركوا مع الله غيره واتخذوا من دونه أولياء، قالوا: ما نعبد تلك الآلهة مع الله إلا لتشفع لنا عند الله، وتقربنا عنده منزلة، فكفروا بذلك؛ لأن العبادة والشفاعة لله وحده، إن الله يفصل بين المؤمنين المخلصين والمشركين مع الله غيره يوم القيامة فيما يختلفون فيه من عبادتهم، فيجازي كلا بما يستحق. إن الله لا يوفق للهداية إلى الصراط المستقيم من هو مفترٍ على الله، كَفَّار بآياته وحججه."));
        alzomrExes.add(new AlzomrEx("لَوْ أَرَادَ اللَّهُ أَنْ يَتَّخِذَ وَلَدًا لَاصْطَفَى مِمَّا يَخْلُقُ مَا يَشَاءُ سُبْحَانَهُ هُوَ اللَّهُ الْوَاحِدُ الْقَهَّارُ (4)"));
        alzomrExes.add(new AlzomrEx("لو أراد الله أن يتخذ ولدًا لاختار من مخلوقاته ما يشاء، تنزَّه الله وتقدَّس عن أن يكون له ولد، فإنه الواحد الأحد، الفرد الصمد، القهَّار الذي قهر خلقه بقدرته، فكل شيء له متذلل خاضع."));
        alzomrExes.add(new AlzomrEx("خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ يُكَوِّرُ اللَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى اللَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ كُلٌّ يَجْرِي لِأَجَلٍ مُسَمًّى أَلَا هُوَ الْعَزِيزُ الْغَفَّارُ (5)"));
        alzomrExes.add(new AlzomrEx("خلق الله السموات والأرض وما فيهما بالحق، يجيء بالليل ويذهب بالنهار، ويجيء بالنهار ويذهب بالليل، وذلَّل الشمس والقمر بانتظام لمنافع العباد، كل منهما يجري في مداره إلى حين قيام الساعة. ألا إن الله الذي فعل هذه الأفعال، وأنعم على خلقه بهذه النعم هو العزيز على خلقه، الغفار لذنوب عباده التائبين."));
        alzomrExes.add(new AlzomrEx("خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَأَنْزَلَ لَكُمْ مِنَ الْأَنْعَامِ ثَمَانِيَةَ أَزْوَاجٍ يَخْلُقُكُمْ فِي بُطُونِ أُمَّهَاتِكُمْ خَلْقًا مِنْ بَعْدِ خَلْقٍ فِي ظُلُمَاتٍ ثَلَاثٍ ذَلِكُمُ اللَّهُ رَبُّكُمْ لَهُ الْمُلْكُ لَا إِلَهَ إِلَّا هُوَ فَأَنَّى تُصْرَفُونَ (6)"));
        alzomrExes.add(new AlzomrEx("خلقكم ربكم -أيها الناس- من آدم، وخلق منه زوجه، وخلق لكم من الأنعام ثمانية أنواع ذكرًا وأنثى من الإبل والبقر والضأن والمعز، يخلقكم في بطون أمهاتكم طورًا بعد طور من الخلق في ظلمات البطن، والرحم، والمَشِيمَة، ذلكم الله الذي خلق هذه الأشياء، ربكم المتفرد بالملك المتوحد بالألوهية المستحق للعبادة وحده، فكيف تعدلون عن عبادته إلى عبادة غيره مِن خلقه؟"));
        alzomrExes.add(new AlzomrEx("إِنْ تَكْفُرُوا فَإِنَّ اللَّهَ غَنِيٌّ عَنْكُمْ وَلَا يَرْضَى لِعِبَادِهِ الْكُفْرَ وَإِنْ تَشْكُرُوا يَرْضَهُ لَكُمْ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى ثُمَّ إِلَى رَبِّكُمْ مَرْجِعُكُمْ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ (7)"));
        alzomrExes.add(new AlzomrEx("إن تكفروا -أيها الناس- بربكم ولم تؤمنوا به، ولم تتبعوا رسله، فإنه غنيٌّ عنكم، ليس بحاجة إليكم، وأنتم الفقراء إليه، ولا يرضى لعباده الكفر، ولا يأمرهم به، وإنما يرضى لهم شكر نعمه عليهم. ولا تحمل نفس إثم نفس أخرى، ثم إلى ربكم مصيركم، فيخبركم بعملكم، ويحاسبكم عليه. إنه عليم بأسرار النفوس وما تخفي الصدور."));
        alzomrExes.add(new AlzomrEx("وَإِذَا مَسَّ الْإِنْسَانَ ضُرٌّ دَعَا رَبَّهُ مُنِيبًا إِلَيْهِ ثُمَّ إِذَا خَوَّلَهُ نِعْمَةً مِنْهُ نَسِيَ مَا كَانَ يَدْعُو إِلَيْهِ مِنْ قَبْلُ وَجَعَلَ لِلَّهِ أَنْدَادًا لِيُضِلَّ عَنْ سَبِيلِهِ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا إِنَّكَ مِنْ أَصْحَابِ النَّارِ (8)"));
        alzomrExes.add(new AlzomrEx("وإذا أصاب الإنسانَ بلاءٌ وشدة ومرض تَذكَّر ربه، فاستغاث به ودعاه، ثم إذا أجابه وكشف عنه ضرَّه، ومنحه نِعَمه، نسي دعاءه لربه عند حاجته إليه، وأشرك معه غيره؛ ليُضل غيره عن الإيمان بالله وطاعته، قل له -أيها الرسول- متوعدًا: تمتع بكفرك قليلا حتى موتك وانتهاء أجلك، إنك من أهل النار المخلَّدين فيها."));
        alzomrExes.add(new AlzomrEx("أَمَّنْ هُوَ قَانِتٌ آنَاءَ اللَّيْلِ سَاجِدًا وَقَائِمًا يَحْذَرُ الْآخِرَةَ وَيَرْجُو رَحْمَةَ رَبِّهِ قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ (9)"));
        alzomrExes.add(new AlzomrEx("أهذا الكافر المتمتع بكفره خير، أم من هو عابد لربه طائع له، يقضي ساعات الليل في القيام والسجود لله، يخاف عذاب الآخرة، ويأمُل رحمة ربه؟ قل -أيها الرسول-: هل يستوي الذين يعلمون ربهم ودينهم الحق والذين لا يعلمون شيئًا من ذلك؟ لا يستوون. إنما يتذكر ويعرف الفرق أصحاب العقول السليمة."));
        alzomrExes.add(new AlzomrEx("قُلْ يَاعِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ لِلَّذِينَ أَحْسَنُوا فِي هَذِهِ الدُّنْيَا حَسَنَةٌ وَأَرْضُ اللَّهِ وَاسِعَةٌ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ (10)"));
        alzomrExes.add(new AlzomrEx("قل -أيها النبي- لعبادي المؤمنين بالله ورسوله: اتقوا ربكم بطاعته واجتناب معصيته. للذين أحسنوا في هذه الدينا بعبادة ربهم وطاعته حسنة في الآخرة، وهي الجنة، وحسنة في الدنيا من صحة ورزق ونصر وغير ذلك. وأرض الله واسعة، فهاجِروا فيها إلى حيث تعبدون ربكم، وتتمكنون من إقامة دينكم. إنما يُعطَى الصابرون ثوابهم في الآخرة بغير حدّ ولا عدّ ولا مقدار، وهذا تعظيم لجزاء الصابرين وثوابهم."));
        alzomrExes.add(new AlzomrEx("قُلْ إِنِّي أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ مُخْلِصًا لَهُ الدِّينَ (11)"));
        alzomrExes.add(new AlzomrEx("قل -أيها الرسول- للناس: إن الله أمرني ومن تبعني بإخلاص العبادة له وحده دون سواه."));
        alzomrExes.add(new AlzomrEx("وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ الْمُسْلِمِينَ (12)"));
        alzomrExes.add(new AlzomrEx("وأمرني بأن أكون أول من أسلم من أمتي، فخضع له بالتوحيد، وأخلص له العبادة، وبرئ مِن كل ما دونه من الآلهة."));
        alzomrExes.add(new AlzomrEx("قُلْ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ (13)"));
        alzomrExes.add(new AlzomrEx("قل -أيها الرسول- للناس: إني أخاف إن عصيت ربي فيما أمرني به من عبادته والإخلاص في طاعته عذاب يوم القيامة، ذلك اليوم الذي يعظم هوله."));
        alzomrExes.add(new AlzomrEx("قُلِ اللَّهَ أَعْبُدُ مُخْلِصًا لَهُ دِينِي (14)"));
        alzomrExes.add(new AlzomrEx("قل -أيها الرسول-: إني أعبد الله وحده لا شريك له مخلصًا له عبادتي وطاعتي."));
        alzomrExes.add(new AlzomrEx("فَاعْبُدُوا مَا شِئْتُمْ مِنْ دُونِهِ قُلْ إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنْفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ أَلَا ذَلِكَ هُوَ الْخُسْرَانُ الْمُبِينُ (15)"));
        alzomrExes.add(new AlzomrEx("فاعبدوا أنتم -أيها المشركون- ما شئتم من دون الله من الأوثان والأصنام وغير ذلك من مخلوقاته، فلا يضرني ذلك شيئًا. وهذا تهديد ووعيد لمن عبد غير الله، وأشرك معه غيره. قل -أيها الرسول-: إن الخاسرين- حقًا- هم الذين خسروا أنفسهم وأهليهم يوم القيامة، وذلك بإغوائهم في الدنيا وإضلالهم عن الإيمان. ألا إن خسران هؤلاء المشركين أنفسهم وأهليهم يوم القيامة هو الخسران البيِّن الواضح."));
        alzomrExes.add(new AlzomrEx("لَهُمْ مِنْ فَوْقِهِمْ ظُلَلٌ مِنَ النَّارِ وَمِنْ تَحْتِهِمْ ظُلَلٌ ذَلِكَ يُخَوِّفُ اللَّهُ بِهِ عِبَادَهُ يَاعِبَادِ فَاتَّقُونِ (16)"));
        alzomrExes.add(new AlzomrEx("أولئك الخاسرون لهم يوم القيامة في جهنم مِن فوقهم قطع عذاب من النار كهيئة الظُّلل المبنية، ومن تحتهم كذلك. ذلك العذاب الموصوف يخوِّف الله به عباده; ليحْذَروه. يا عباد فاتقوني بامتثال أوامري واجتناب معاصيَّ."));
        alzomrExes.add(new AlzomrEx("وَالَّذِينَ اجْتَنَبُوا الطَّاغُوتَ أَنْ يَعْبُدُوهَا وَأَنَابُوا إِلَى اللَّهِ لَهُمُ الْبُشْرَى فَبَشِّرْ عِبَادِ (17)"));
        alzomrExes.add(new AlzomrEx("والذين اجتنبوا طاعة الشيطان وعبادة غير الله، وتابوا إلى الله بعبادته وإخلاص الدين له، لهم البشرى في الحياة الدنيا بالثناء الحسن والتوفيق من الله، وفي الآخرة رضوان الله والنعيم الدائم في الجنة. فبشِّر -أيها النبي- عبادي."));
        alzomrExes.add(new AlzomrEx("الَّذِينَ يَسْتَمِعُونَ الْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُ أُولَئِكَ الَّذِينَ هَدَاهُمُ اللَّهُ وَأُولَئِكَ هُمْ أُولُو الْأَلْبَابِ (18)"));
        alzomrExes.add(new AlzomrEx("الذين يستمعون القول فيتبعون أرشده. وأحسن الكلام وأرشده كلام الله ثم كلام رسوله. أولئك هم الذين وفقهم الله للرشاد والسداد، وهداهم لأحسن الأخلاق والأعمال، وأولئك هم أصحاب العقول السليمة."));
        alzomrExes.add(new AlzomrEx("أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِ أَفَأَنْتَ تُنْقِذُ مَنْ فِي النَّارِ (19)"));
        alzomrExes.add(new AlzomrEx("أفمن وجبت عليه كلمة العذاب؛ باستمراره على غيِّه وعناده، فإنه لا حيلة لك -أيها الرسول- في هدايته، أفتقدر أن تنقذ مَن في النار؟ لست بقادر على ذلك."));
        alzomrExes.add(new AlzomrEx("لَكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ مِنْ فَوْقِهَا غُرَفٌ مَبْنِيَّةٌ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ وَعْدَ اللَّهِ لَا يُخْلِفُ اللَّهُ الْمِيعَادَ (20)"));
        alzomrExes.add(new AlzomrEx("لكن الذين اتقوا ربهم -بطاعته وإخلاص عبادته- لهم في الجنة غرف مبنية بعضها فوق بعض، تجري مِن تحت غرفهم ومنازلهم الأنهار، وعدها الله عباده المتقين وعدًا متحققًا، لا يخلف الله الميعاد."));
        alzomrExes.add(new AlzomrEx("أَلَمْ تَرَ أَنَّ اللَّهَ أَنْزَلَ مِنَ السَّمَاءِ مَاءً فَسَلَكَهُ يَنَابِيعَ فِي الْأَرْضِ ثُمَّ يُخْرِجُ بِهِ زَرْعًا مُخْتَلِفًا أَلْوَانُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَجْعَلُهُ حُطَامًا إِنَّ فِي ذَلِكَ لَذِكْرَى لِأُولِي الْأَلْبَابِ (21)"));
        alzomrExes.add(new AlzomrEx("ألم تر -أيها الرسول- أن الله أنزل من السحاب مطرًا فأدخله في الأرض، وجعله عيونًا نابعة ومياهًا جارية، ثم يُخْرج بهذا الماء زرعًا مختلفًا ألوانه وأنواعه، ثم ييبس بعد خضرته ونضارته، فتراه مصفرًا لونه، ثم يجعله حطامًا متكسِّرًا متفتتًا؟ إن في فِعْل الله ذلك لَذكرى وموعظة لأصحاب العقول السليمة."));
        alzomrExes.add(new AlzomrEx("أَفَمَنْ شَرَحَ اللَّهُ صَدْرَهُ لِلْإِسْلَامِ فَهُوَ عَلَى نُورٍ مِنْ رَبِّهِ فَوَيْلٌ لِلْقَاسِيَةِ قُلُوبُهُمْ مِنْ ذِكْرِ اللَّهِ أُولَئِكَ فِي ضَلَالٍ مُبِينٍ (22)"));
        alzomrExes.add(new AlzomrEx("أفمن وسَّع الله صدره، فسعد بقبول الإسلام والانقياد له والإيمان به، فهو على بصيرة من أمره وهدى من ربه، كمن ليس كذلك؟ لا يستوون. فويل وهلاك للذين قَسَتْ قلوبهم، وأعرضت عن ذكر الله، أولئك في ضلال بيِّن عن الحق."));
        alzomrExes.add(new AlzomrEx("اللَّهُ نَزَّلَ أَحْسَنَ الْحَدِيثِ كِتَابًا مُتَشَابِهًا مَثَانِيَ تَقْشَعِرُّ مِنْهُ جُلُودُ الَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَى ذِكْرِ اللَّهِ ذَلِكَ هُدَى اللَّهِ يَهْدِي بِهِ مَنْ يَشَاءُ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ (23)"));
        alzomrExes.add(new AlzomrEx("الله تعالى هو الذي نزل أحسن الحديث، وهو القرآن العظيم، متشابهًا في حسنه وإحكامه وعدم اختلافه، تُكَرَّرُ فيه القصص والأحكام، والحجج والبينات، وتعاد تلاوته فلا يمل على كثرة الترداد، تقشعر من سماعه، وتضطرب جلود الذين يخافون ربهم؛ تأثرًا بما فيه مِن ترهيب ووعيد، ثم تلين جلودهم وقلوبهم; استبشارًا بما فيه من وعد وترغيب، ذلك التأثر بالقرآن هداية من الله لعباده. والله يهدي بالقرآن من يشاء مِن عباده. ومن يضلله الله عن الإيمان بهذا القرآن؛ لكفره وعناده، فما له مِن هاد يهديه ويوفقه."));
        alzomrExes.add(new AlzomrEx("أَفَمَنْ يَتَّقِي بِوَجْهِهِ سُوءَ الْعَذَابِ يَوْمَ الْقِيَامَةِ وَقِيلَ لِلظَّالِمِينَ ذُوقُوا مَا كُنْتُمْ تَكْسِبُونَ (24)"));
        alzomrExes.add(new AlzomrEx("أفمن يُلْقى في النار مغلولا -فلا يتهيأ له أن يتقي النار إلا بوجهه؛ لكفره وضلاله- خير أم من ينعم في الجنة؛ لأن الله هداه؟ وقيل يومئذ للظالمين: ذوقوا وبال ما كنتم في الدنيا تكسبون من معاصي الله."));
        alzomrExes.add(new AlzomrEx("كَذَّبَ الَّذِينَ مِنْ قَبْلِهِمْ فَأَتَاهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ (25)"));
        alzomrExes.add(new AlzomrEx("كذَّب الذين مِن قبل قومك -أيها الرسول- رسلهم، فجاءهم العذاب من حيث لا يشعرون بمجيئه."));
        alzomrExes.add(new AlzomrEx("فَأَذَاقَهُمُ اللَّهُ الْخِزْيَ فِي الْحَيَاةِ الدُّنْيَا وَلَعَذَابُ الْآخِرَةِ أَكْبَرُ لَوْ كَانُوا يَعْلَمُونَ (26)"));
        alzomrExes.add(new AlzomrEx("فأذاق الله الأمم المكذبة العذاب والهوان في الدنيا، وأعد لهم عذابًا أشد وأشق في الآخرة، لو كان هؤلاء المشركون يعلمون أن ما حلَّ بهم؛ بسبب كفرهم وتكذيبهم لاتَّعظوا."));
        alzomrExes.add(new AlzomrEx("وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِي هَذَا الْقُرْآنِ مِنْ كُلِّ مَثَلٍ لَعَلَّهُمْ يَتَذَكَّرُونَ (27)"));
        alzomrExes.add(new AlzomrEx("ولقد ضربنا لهؤلاء المشركين بالله في هذا القرآن من كل مثل من أمثال القرون الخالية تخويفًا وتحذيرًا; ليتذكروا فينزجروا عما هم عليه مقيمون من الكفر بالله."));
        alzomrExes.add(new AlzomrEx("قُرْآنًا عَرَبِيًّا غَيْرَ ذِي عِوَجٍ لَعَلَّهُمْ يَتَّقُونَ (28)"));
        alzomrExes.add(new AlzomrEx("وجعلنا هذا القرآن عربيًا واضح الألفاظ سهل المعاني، لا لَبْس فيه ولا انحراف; لعلهم يتقون الله بامتثال أوامره واجتناب نواهيه."));
        alzomrExes.add(new AlzomrEx("ضَرَبَ اللَّهُ مَثَلًا رَجُلًا فِيهِ شُرَكَاءُ مُتَشَاكِسُونَ وَرَجُلًا سَلَمًا لِرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلًا الْحَمْدُ لِلَّهِ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ (29)"));
        alzomrExes.add(new AlzomrEx("ضرب الله مثلا عبدًا مملوكًا لشركاء متنازعين، فهو حيران في إرضائهم، وعبدًا خالصًا لمالك واحد يعرف مراده وما يرضيه، هل يستويان مثلا؟ لا يستويان، كذلك المشرك هو في حَيْرة وشك، والمؤمن في راحة واطمئنان. فالثناء الكامل التام لله وحده، بل المشركون لا يعلمون الحق فيتبعونه."));
        alzomrExes.add(new AlzomrEx("إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ (30)"));
        alzomrExes.add(new AlzomrEx("إنك -أيها الرسول- ميت وإنهم ميتون."));
        alzomrExes.add(new AlzomrEx("ثُمَّ إِنَّكُمْ يَوْمَ الْقِيَامَةِ عِنْدَ رَبِّكُمْ تَخْتَصِمُونَ (31)"));
        alzomrExes.add(new AlzomrEx("ثم إنكم جميعًا -أيها الناس- يوم القيامة عند ربكم تتنازعون، فيحكم بينكم بالعدل والإنصاف."));
        alzomrExes.add(new AlzomrEx("فَمَنْ أَظْلَمُ مِمَّنْ كَذَبَ عَلَى اللَّهِ وَكَذَّبَ بِالصِّدْقِ إِذْ جَاءَهُ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْكَافِرِينَ (32)"));
        alzomrExes.add(new AlzomrEx("لا أحد أظلم ممن افترى على الله الكذب: بأن نسب إليه ما لا يليق به كالشريك والولد، أو قال: أوحي إليَّ، ولم يوحَ إليه شيء، ولا أحد أظلم ممن كذَّب بالحق الذي نزل على محمد صلى الله عليه وسلم. أليس في النار مأوى ومسكن لمن كفر بالله، ولم يصدق محمدًا صلى الله عليه وسلم ولم يعمل بما جاء به؟ بَلَى."));
        alzomrExes.add(new AlzomrEx("وَالَّذِي جَاءَ بِالصِّدْقِ وَصَدَّقَ بِهِ أُولَئِكَ هُمُ الْمُتَّقُونَ (33)"));
        alzomrExes.add(new AlzomrEx("والذي جاء بالصدق في قوله وعمله من الأنبياء وأتباعهم، وصدَّق به إيمانًا وعملا أولئك هم الذين جمعوا خصال التقوى، وفي مقدمة هؤلاء خاتم الأنبياء والمرسلين محمد صلى الله عليه وسلم والمؤمنون به، العاملون بشريعته من الصحابة، رضي الله عنهم، فمَن بعدهم إلى يوم الدين."));
        alzomrExes.add(new AlzomrEx("لَهُمْ مَا يَشَاءُونَ عِنْدَ رَبِّهِمْ ذَلِكَ جَزَاءُ الْمُحْسِنِينَ (34)"));
        alzomrExes.add(new AlzomrEx("لهم ما يشاؤون عند ربهم من أصناف اللذات والمشتهيات؛ ذلك جزاء مَن أطاع ربه حق الطاعة، وعبده حق العبادة."));
        alzomrExes.add(new AlzomrEx("لِيُكَفِّرَ اللَّهُ عَنْهُمْ أَسْوَأَ الَّذِي عَمِلُوا وَيَجْزِيَهُمْ أَجْرَهُمْ بِأَحْسَنِ الَّذِي كَانُوا يَعْمَلُونَ (35)"));
        alzomrExes.add(new AlzomrEx("ليكفِّر الله عنهم أسوأ الذي عملوا في الدنيا من الأعمال؛ بسبب ما كان منهم مِن توبة وإنابة مما اجترحوا من السيئات فيها، ويثيبهم الله على طاعتهم في الدنيا بأحسن ما كانوا يعملون، وهو الجنة."));
        alzomrExes.add(new AlzomrEx("أَلَيْسَ اللَّهُ بِكَافٍ عَبْدَهُ وَيُخَوِّفُونَكَ بِالَّذِينَ مِنْ دُونِهِ وَمَنْ يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ (36)"));
        alzomrExes.add(new AlzomrEx("أليس الله بكاف عبده محمدًا وعيد المشركين وكيدهم من أن ينالوه بسوء؟ بلى إنه سيكفيه في أمر دينه ودنياه، ويدفع عنه مَن أراده بسوء، ويخوِّفونك -أيها الرسول- بآلهتهم التي زعموا أنها ستؤذيك. ومن يخذله الله فيضله عن طريق الحق، فما له مِن هاد يهديه إليه."));
        alzomrExes.add(new AlzomrEx("وَمَنْ يَهْدِ اللَّهُ فَمَا لَهُ مِنْ مُضِلٍّ أَلَيْسَ اللَّهُ بِعَزِيزٍ ذِي انْتِقَامٍ (37)"));
        alzomrExes.add(new AlzomrEx("ومن يوفقه الله للإيمان به والعمل بكتابه واتباع رسوله فما له مِن مضل عن الحق الذي هو عليه. أليس الله بعزيز في انتقامه مِن كفرة خلقه، وممن عصاه؟"));
        alzomrExes.add(new AlzomrEx("وَلَئِنْ سَأَلْتَهُمْ مَنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ اللَّهُ قُلْ أَفَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهِ إِنْ أَرَادَنِيَ اللَّهُ بِضُرٍّ هَلْ هُنَّ كَاشِفَاتُ ضُرِّهِ أَوْ أَرَادَنِي بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَاتُ رَحْمَتِهِ قُلْ حَسْبِيَ اللَّهُ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ (38)"));
        alzomrExes.add(new AlzomrEx("ولئن سألت -أيها الرسول- هؤلاء المشركين الذين يعبدون غير الله: مَن خلق هذه السموات والأرض؟ ليقولُنَّ: خلقهنَّ الله، فهم يُقِرُّون بالخالق. قل لهم: هل تستطيع هذه الآلهة التي تشركونها مع الله أن تُبْعِدَ عني أذى قدَّره الله عليَّ، أو تزيلَ مكروهًا لَحِق بي؟ وهل تستطيع أن تمنع نفعَا يسَّره الله لي، أو تحبس رحمة الله عني؟ إنهم سيقولون: لا تستطيع ذلك. قل لهم: حسبي الله وكافِيَّ، عليه يعتمد المعتمدون في جلب مصالحهم ودفع مضارهم، فالذي بيده وحده الكفاية هو حسبي، وسيكفيني كل ما أهمني."));
        alzomrExes.add(new AlzomrEx("قُلْ يَاقَوْمِ اعْمَلُوا عَلَى مَكَانَتِكُمْ إِنِّي عَامِلٌ فَسَوْفَ تَعْلَمُونَ (39)"));
        alzomrExes.add(new AlzomrEx("قل -أيها الرسول- لقومك المعاندين: اعملوا على حالتكم التي رضيتموها لأنفسكم، حيث عبدتم مَن لا يستحق العبادة، وليس له من الأمر شيء، إني عامل على ما أُمرت به من التوجه لله وحده في أقوالي وأفعالي، فسوف تعلمون."));
        alzomrExes.add(new AlzomrEx("مَنْ يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُقِيمٌ (40)"));
        alzomrExes.add(new AlzomrEx("من يأتيه عذاب يهينه في الحياة الدنيا، ويحل عليه في الآخرة عذاب دائم، لا يحول عنه ولا يزول."));
        alzomrExes.add(new AlzomrEx("إِنَّا أَنْزَلْنَا عَلَيْكَ الْكِتَابَ لِلنَّاسِ بِالْحَقِّ فَمَنِ اهْتَدَى فَلِنَفْسِهِ وَمَنْ ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا وَمَا أَنْتَ عَلَيْهِمْ بِوَكِيلٍ (41)"));
        alzomrExes.add(new AlzomrEx("إنا أنزلنا عليك -أيها الرسول- القرآن بالحق هداية للعالمين، إلى طريق الرشاد، فمن اهتدى بنوره، وعمل بما فيه، واستقام على منهجه، فنفعُ ذلك يعود على نفسه، ومَن ضلَّ بعد ما تبين له الهدى، فإنما يعود ضرره على نفسه، ولن يضرَّ الله شيئا، وما أنت -أيها الرسول- عليهم بوكيل تحفظ أعمالهم، وتحاسبهم عليها، وتجبرهم على ما تشاء، ما عليك إلا البلاغ."));
        alzomrExes.add(new AlzomrEx("اللَّهُ يَتَوَفَّى الْأَنْفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا فَيُمْسِكُ الَّتِي قَضَى عَلَيْهَا الْمَوْتَ وَيُرْسِلُ الْأُخْرَى إِلَى أَجَلٍ مُسَمًّى إِنَّ فِي ذَلِكَ لَآيَاتٍ لِقَوْمٍ يَتَفَكَّرُونَ (42)"));
        alzomrExes.add(new AlzomrEx("الله -سبحانه وتعالى- هو الذي يقبض الأنفس حين موتها، وهذه الوفاة الكبرى، وفاة الموت بانقضاء الأجل، ويقبض التي لم تمت في منامها، وهي الموتة الصغرى، فيحبس من هاتين النفسين النفس التي قضى عليها الموت، وهي نفس مَن مات، ويرسل النفس الأخرى إلى استكمال أجلها ورزقها، وذلك بإعادتها إلى جسم صاحبها، إن في قبض الله نفس الميت والنائم وإرساله نفس النائم، وحبسه نفس الميت لَدلائل واضحة على قدرة الله لمن تفكر وتدبر."));
        alzomrExes.add(new AlzomrEx("أَمِ اتَّخَذُوا مِنْ دُونِ اللَّهِ شُفَعَاءَ قُلْ أَوَلَوْ كَانُوا لَا يَمْلِكُونَ شَيْئًا وَلَا يَعْقِلُونَ (43)"));
        alzomrExes.add(new AlzomrEx("أم اتخذ هؤلاء المشركون بالله من دونه آلهتهم التي يعبدونها شفعاء، تشفع لهم عند الله في حاجاتهم؟ قل -أيها الرسول- لهم: أتتخذونها شفعاء كما تزعمون، ولو كانت الآلهة لا تملك شيئا، ولا تعقل عبادتكم لها؟"));
        alzomrExes.add(new AlzomrEx("قُلْ لِلَّهِ الشَّفَاعَةُ جَمِيعًا لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ثُمَّ إِلَيْهِ تُرْجَعُونَ (44)"));
        alzomrExes.add(new AlzomrEx("قل -أيها الرسول- لهؤلاء المشركين: لله الشفاعة جميعًا، له ملك السموات والأرض وما فيهما، فالأمر كله لله وحده، ولا يشفع أحد عنده إلا بإذنه، فهو الذي يملك السموات والأرض ويتصرف فيهما، فالواجب أن تُطلب الشفاعة ممن يملكها، وأن تُخلص له العبادة، ولا تُطلب من هذه الآلهة التي لا تضر ولا تنفع، ثم إليه تُرجَعون بعد مماتكم للحساب والجزاء."));
        alzomrExes.add(new AlzomrEx("وَإِذَا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ وَإِذَا ذُكِرَ الَّذِينَ مِنْ دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ (45)"));
        alzomrExes.add(new AlzomrEx("وإذا ذُكِر الله وحده نفرت قلوب الذين لا يؤمنون بالمعاد والبعث بعد الممات، وإذا ذُكِر الذين مِن دونه من الأصنام والأوثان والأولياء إذا هم يفرحون؛ لكون الشرك موافقًا لأهوائهم."));
        alzomrExes.add(new AlzomrEx("قُلِ اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِي مَا كَانُوا فِيهِ يَخْتَلِفُونَ (46)"));
        alzomrExes.add(new AlzomrEx("قل: اللهم يا خالق السموات والأرض ومبدعهما على غير مثال سبق، عالم السر والعلانية، أنت تفصل بين عبادك يوم القيامة فيما كانوا فيه يختلفون من القول فيك، وفي عظمتك وسلطانك والإيمان بك وبرسولك، اهدني لما اختُلِف فيه من الحق بإذنك، إنك تهدي مَن تشاء إلى صراط مستقيم. وكان هذا مِن دعائه صلى الله عليه وسلم، وهو تعليم للعباد بالالتجاء إلى الله تعالى، ودعائه بأسمائه الحسنى وصفاته العلى."));
        alzomrExes.add(new AlzomrEx("وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُوا مَا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ مِنْ سُوءِ الْعَذَابِ يَوْمَ الْقِيَامَةِ وَبَدَا لَهُمْ مِنَ اللَّهِ مَا لَمْ يَكُونُوا يَحْتَسِبُونَ (47)"));
        alzomrExes.add(new AlzomrEx("ولو أن لهؤلاء المشركين بالله ما في الأرض جميعا مِن مال وذخائر، ومثله معه مضاعفًا، لَبذلوه يوم القيامة؛ ليفتدوا به من سوء العذاب، ولو بذلوا وافتدوا به ما قُبِل منهم، ولا أغنى عنهم من عذاب الله شيئًا، وظهر لهم يومئذٍ من أمر الله وعذابه ما لم يكونوا يحتسبون في الدنيا أنه نازل بهم."));
        alzomrExes.add(new AlzomrEx("وَبَدَا لَهُمْ سَيِّئَاتُ مَا كَسَبُوا وَحَاقَ بِهِمْ مَا كَانُوا بِهِ يَسْتَهْزِئُونَ (48)"));
        alzomrExes.add(new AlzomrEx("وظهر لهؤلاء المكذبين يوم الحساب جزاء سيئاتهم التي اقترفوها، حيث نسبوا إلى الله ما لا يليق به، وارتكبوا المعاصي في حياتهم، وأحاط بهم من كل جانب عذاب أليم؛ عقابًا لهم على استهزائهم بالإنذار بالعذاب الذي كان الرسول يَعِدُهم به، ولا يأبهون له."));
        alzomrExes.add(new AlzomrEx("فَإِذَا مَسَّ الْإِنْسَانَ ضُرٌّ دَعَانَا ثُمَّ إِذَا خَوَّلْنَاهُ نِعْمَةً مِنَّا قَالَ إِنَّمَا أُوتِيتُهُ عَلَى عِلْمٍ بَلْ هِيَ فِتْنَةٌ وَلَكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ (49)"));
        alzomrExes.add(new AlzomrEx("فإذا أصاب الإنسان شدة وضُرٌّ، طلب من ربه أن يُفرِّج عنه، فإذا كشفنا عنه ما أصابه وأعطيناه نعمة منا عاد بربه كافرًا، ولفضله منكرًا، وقال: إن الذي أوتيتُه إنما هو على علم من الله أني له أهل ومستحق، بل ذلك فتنة يبتلي الله بها عباده؛ لينظر مَن يشكره ممن يكفره، ولكن أكثرهم -لجهلهم وسوء ظنهم- لا يعلمون أن ذلك استدراج لهم من الله، وامتحان لهم على شكر النعم."));
        alzomrExes.add(new AlzomrEx("قَدْ قَالَهَا الَّذِينَ مِنْ قَبْلِهِمْ فَمَا أَغْنَى عَنْهُمْ مَا كَانُوا يَكْسِبُونَ (50)"));
        alzomrExes.add(new AlzomrEx("قد قال مقالتهم هذه مَن قبلهم من الأمم الخالية المكذبة، فما أغنى عنهم حين جاءهم العذاب ما كانوا يكسبونه من الأموال والأولاد."));
        alzomrExes.add(new AlzomrEx("فَأَصَابَهُمْ سَيِّئَاتُ مَا كَسَبُوا وَالَّذِينَ ظَلَمُوا مِنْ هَؤُلَاءِ سَيُصِيبُهُمْ سَيِّئَاتُ مَا كَسَبُوا وَمَا هُمْ بِمُعْجِزِينَ (51)"));
        alzomrExes.add(new AlzomrEx("فأصاب الذين قالوا هذه المقالة من الأمم الخالية وبال سيئات ما كسبوا من الأعمال، فعوجلوا بالخزي في الحياة الدنيا، والذين ظلموا أنفسهم من قومك -أيها الرسول-، وقالوا هذه المقالة، سيصيبهم أيضًا وبال سيئات ما كسبوا، كما أصاب الذين من قبلهم، وما هم بفائتين الله ولا سابقيه."));
        alzomrExes.add(new AlzomrEx("أَوَلَمْ يَعْلَمُوا أَنَّ اللَّهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ وَيَقْدِرُ إِنَّ فِي ذَلِكَ لَآيَاتٍ لِقَوْمٍ يُؤْمِنُونَ (52)"));
        alzomrExes.add(new AlzomrEx("أو لم يعلم هؤلاء أن رزق الله للإنسان لا يدل على حسن حال صاحبه، فإن الله لبالغ حكمته يوسِّع الرزق لمن يشاء مِن عباده، صالحًا كان أو طالحًا، ويضيِّقه على مَن يشاء منهم؟ إن في ذلك التوسيع والتضييق في الرزق لَدلالات واضحات لقوم يُصدِّقون أمر الله ويعملون به."));
        alzomrExes.add(new AlzomrEx("قُلْ يَاعِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ (53)"));
        alzomrExes.add(new AlzomrEx("قل -أيها الرسول- لعبادي الذين تمادَوا في المعاصي، وأسرفوا على أنفسهم بإتيان ما تدعوهم إليه نفوسهم من الذنوب: لا تَيْئسوا من رحمة الله؛ لكثرة ذنوبكم، إن الله يغفر الذنوب جميعًا لمن تاب منها ورجع عنها مهما كانت، إنه هو الغفور لذنوب التائبين من عباده، الرحيم بهم."));
        alzomrExes.add(new AlzomrEx("وَأَنِيبُوا إِلَى رَبِّكُمْ وَأَسْلِمُوا لَهُ مِنْ قَبْلِ أَنْ يَأْتِيَكُمُ الْعَذَابُ ثُمَّ لَا تُنْصَرُونَ (54)"));
        alzomrExes.add(new AlzomrEx("وارجعوا إلى ربكم -أيها الناس- بالطاعة والتوبة، واخضعوا له من قبل أن يقع بكم عقابه، ثم لا ينصركم أحد من دون الله."));
        alzomrExes.add(new AlzomrEx("وَاتَّبِعُوا أَحْسَنَ مَا أُنْزِلَ إِلَيْكُمْ مِنْ رَبِّكُمْ مِنْ قَبْلِ أَنْ يَأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَأَنْتُمْ لَا تَشْعُرُونَ (55)"));
        alzomrExes.add(new AlzomrEx("واتبعوا أحسن ما أُنزل إليكم من ربكم، وهو القرآن العظيم، وكله حسن، فامتثلوا أوامره، واجتنبوا نواهيه من قبل أن يأتيكم العذاب فجأة، وأنتم لا تعلمون به."));
        alzomrExes.add(new AlzomrEx("أَنْ تَقُولَ نَفْسٌ يَاحَسْرَتَا عَلَى مَا فَرَّطْتُ فِي جَنْبِ اللَّهِ وَإِنْ كُنْتُ لَمِنَ السَّاخِرِينَ (56)"));
        alzomrExes.add(new AlzomrEx("وأطيعوا ربكم وتوبوا إليه حتى لا تندم نفس وتقول: يا حسرتا على ما ضيَّعت في الدنيا من العمل بما أمر الله به، وقصَّرت في طاعته وحقه، وإن كنت في الدنيا لمن المستهزئين بأمر الله وكتابه ورسوله والمؤمنين به."));
        alzomrExes.add(new AlzomrEx("أَوْ تَقُولَ لَوْ أَنَّ اللَّهَ هَدَانِي لَكُنْتُ مِنَ الْمُتَّقِينَ (57)"));
        alzomrExes.add(new AlzomrEx("أو تقول: لو أن الله أرشدني إلى دينه لكنت من المتقين الشرك والمعاصي."));
        alzomrExes.add(new AlzomrEx("أَوْ تَقُولَ حِينَ تَرَى الْعَذَابَ لَوْ أَنَّ لِي كَرَّةً فَأَكُونَ مِنَ الْمُحْسِنِينَ (58)"));
        alzomrExes.add(new AlzomrEx("أو تقول حين ترى عقاب الله قد أحاط بها يوم الحساب: ليت لي رجعة إلى الحياة الدنيا، فأكون فيها من الذين أحسنوا بطاعة ربهم، والعمل بما أمَرَتْهم به الرسل."));
        alzomrExes.add(new AlzomrEx("بَلَى قَدْ جَاءَتْكَ آيَاتِي فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنْتَ مِنَ الْكَافِرِينَ (59)"));
        alzomrExes.add(new AlzomrEx("ما القول كما تقول، قد جاءتك آياتي الواضحة الدالة على الحق، فكذَّبت بها، واستكبرت عن قَبولها واتباعها، وكنت من الكافرين بالله ورسله."));
        alzomrExes.add(new AlzomrEx("وَيَوْمَ الْقِيَامَةِ تَرَى الَّذِينَ كَذَبُوا عَلَى اللَّهِ وُجُوهُهُمْ مُسْوَدَّةٌ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْمُتَكَبِّرِينَ (60)"));
        alzomrExes.add(new AlzomrEx("ويوم القيامة ترى هؤلاء المكذبين الذين وصفوا ربهم بما لا يليق به، ونسبوا إليه الشريك والولد وجوههم مسودة. أليس في جهنم مأوى ومسكن لمن تكبر على الله، فامتنع من توحيده وطاعته؟ بلى."));
        alzomrExes.add(new AlzomrEx("وَيُنَجِّي اللَّهُ الَّذِينَ اتَّقَوْا بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ السُّوءُ وَلَا هُمْ يَحْزَنُونَ (61)"));
        alzomrExes.add(new AlzomrEx("وينجي الله من جهنم وعذابها الذين اتقوا ربهم بأداء فرائضه واجتناب نواهيه بفوزهم وتحقق أمنيتهم، وهي الظَّفَر بالجنة، لا يمسهم من عذاب جهنم شيء، ولا هم يحزنون على ما فاتهم من حظوظ الدنيا."));
        alzomrExes.add(new AlzomrEx("اللَّهُ خَالِقُ كُلِّ شَيْءٍ وَهُوَ عَلَى كُلِّ شَيْءٍ وَكِيلٌ (62)"));
        alzomrExes.add(new AlzomrEx("الله تعالى هو خالق الأشياء كلها، وربها ومليكها والمتصرف فيها، وهو على كل شيء حفيظ يدَبِّر جميع شؤون خلقه."));
        alzomrExes.add(new AlzomrEx("لَهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ وَالَّذِينَ كَفَرُوا بِآيَاتِ اللَّهِ أُولَئِكَ هُمُ الْخَاسِرُونَ (63)"));
        alzomrExes.add(new AlzomrEx("لله مفاتيح خزائن السموات والأرض، يعطي منها خَلْقَه كيف يشاء. والذين جحدوا بآيات القرآن وما فيها من الدلائل الواضحة، أولئك هم الخاسرون في الدنيا بخِذْلانهم عن الإيمان، وفي الآخرة بخلودهم في النار."));
        alzomrExes.add(new AlzomrEx("قُلْ أَفَغَيْرَ اللَّهِ تَأْمُرُونِّي أَعْبُدُ أَيُّهَا الْجَاهِلُونَ (64)"));
        alzomrExes.add(new AlzomrEx("قل -أيها الرسول- لمشركي قومك: أفغير الله أيها الجاهلون بالله تأمرونِّي أن أعبد، ولا تصلح العبادة لشيء سواه؟"));
        alzomrExes.add(new AlzomrEx("وَلَقَدْ أُوحِيَ إِلَيْكَ وَإِلَى الَّذِينَ مِنْ قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ الْخَاسِرِينَ (65)"));
        alzomrExes.add(new AlzomrEx("ولقد أوحي إليك -أيها الرسول- وإلى من قبلك من الرسل: لئن أشركت بالله غيره ليبطلنَّ عملك، ولتكوننَّ من الهالكين الخاسرين دينك وآخرتك؛ لأنه لا يُقبل مع الشرك عمل صالح."));
        alzomrExes.add(new AlzomrEx("بَلِ اللَّهَ فَاعْبُدْ وَكُنْ مِنَ الشَّاكِرِينَ (66)"));
        alzomrExes.add(new AlzomrEx("بل الله فاعبد -أيها النبي- مخلصًا له العبادة وحده لا شريك له، وكن من الشاكرين لله نعمه."));
        alzomrExes.add(new AlzomrEx("وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّمَاوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ سُبْحَانَهُ وَتَعَالَى عَمَّا يُشْرِكُونَ (67)"));
        alzomrExes.add(new AlzomrEx("وما عظَّم هؤلاء المشركون اللهَ حق تعظيمه; إذ عبدوا معه غيره مما لا ينفع ولا يضر، فسوَّوا المخلوق مع عجزه بالخالق العظيم، الذي من عظيم قدرته أن جميع الأرض في قبضته يوم القيامة، والسموات مطويات بيمينه، تنزه وتعاظم سبحانه وتعالى عما يشرك به هؤلاء المشركون، وفي الآية دليل على إثبات القبضة، واليمين، والطيِّ، لله كما يليق بجلاله وعظمته، من غير تكييف ولا تشبيه."));
        alzomrExes.add(new AlzomrEx("وَنُفِخَ فِي الصُّورِ فَصَعِقَ مَنْ فِي السَّمَاوَاتِ وَمَنْ فِي الْأَرْضِ إِلَّا مَنْ شَاءَ اللَّهُ ثُمَّ نُفِخَ فِيهِ أُخْرَى فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ (68)"));
        alzomrExes.add(new AlzomrEx("ونُفِخ في «القرن» فمات كلُّ مَن في السموات والأرض، إلا مَن شاء الله عدم موته، ثم نفخ المَلَك فيه نفخة ثانية مؤذنًا بإحياء جميع الخلائق للحساب أمام ربهم، فإذا هم قيام من قبورهم ينظرون ماذا يفعل الله بهم؟"));
        alzomrExes.add(new AlzomrEx("وَأَشْرَقَتِ الْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ الْكِتَابُ وَجِيءَ بِالنَّبِيِّينَ وَالشُّهَدَاءِ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَهُمْ لَا يُظْلَمُونَ (69)"));
        alzomrExes.add(new AlzomrEx("وأضاءت الأرض يوم القيامة إذا تجلى الحق جل وعلا للخلائق لفصل القضاء، ونشرت الملائكة صحيفة كل فرد، وجيء بالنبيين والشهود على الأمم؛ ليسأل الله النبيين عن التبليغ وعما أجابتهم به أممهم، كما تأتي أمة محمد صلى الله عليه وسلم؛ لتشهد بتبليغ الرسل السابقين لأممهم إذا أنكرت هذا التبليغ، فتقوم الحجة على الأمم، وقضى ربُّ العالمين بين العباد بالعدل التام، وهم لا يُظلمون شيئًا بنقص ثواب أو زيادة عقاب."));
        alzomrExes.add(new AlzomrEx("وَوُفِّيَتْ كُلُّ نَفْسٍ مَا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ (70)"));
        alzomrExes.add(new AlzomrEx("ووفَّى الله كلَّ نفس جزاء عملها من خير وشر، وهو سبحانه وتعالى أعلم بما يفعلون في الدنيا من طاعة أو معصية."));
        alzomrExes.add(new AlzomrEx("وَسِيقَ الَّذِينَ كَفَرُوا إِلَى جَهَنَّمَ زُمَرًا حَتَّى إِذَا جَاءُوهَا فُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا أَلَمْ يَأْتِكُمْ رُسُلٌ مِنْكُمْ يَتْلُونَ عَلَيْكُمْ آيَاتِ رَبِّكُمْ وَيُنْذِرُونَكُمْ لِقَاءَ يَوْمِكُمْ هَذَا قَالُوا بَلَى وَلَكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكَافِرِينَ (71)"));
        alzomrExes.add(new AlzomrEx("وسيق الذين كفروا بالله ورسله إلى جهنم جماعات، حتى إذا جاؤوها فتح الخزنة الموكَّلون بها أبوابها السبعة، وزجروهم قائلين: كيف تعصون الله وتجحدون أنه الإله الحق وحده؟ ألم يرسل إليكم رسلا منكم يتلون عليكم آيات ربكم، ويحذِّرونكم أهوال هذا اليوم؟ قالوا مقرين بذنبهم: بلى قد جاءت رسل ربنا بالحق، وحذَّرونا هذا اليوم، ولكن وجبت كلمة الله أن عذابه لأهل الكفر به."));
        alzomrExes.add(new AlzomrEx("قِيلَ ادْخُلُوا أَبْوَابَ جَهَنَّمَ خَالِدِينَ فِيهَا فَبِئْسَ مَثْوَى الْمُتَكَبِّرِينَ (72)"));
        alzomrExes.add(new AlzomrEx("قيل للجاحدين أن الله هو الإله الحق إهانة لهم وإذلالا: ادخلوا أبواب جهنم ماكثين فيها أبدًا، فقَبُح مصير المتعالين على الإيمان بالله والعمل بشرعه."));
        alzomrExes.add(new AlzomrEx("وَسِيقَ الَّذِينَ اتَّقَوْا رَبَّهُمْ إِلَى الْجَنَّةِ زُمَرًا حَتَّى إِذَا جَاءُوهَا وَفُتِحَتْ أَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَامٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوهَا خَالِدِينَ (73)"));
        alzomrExes.add(new AlzomrEx("وسيق الذين اتقوا ربهم بتوحيده والعمل بطاعته إلى الجنة جماعات، حتى إذا جاؤوها وشُفع لهم بدخولها، فتحت أبوابها، فترحِّب بهم الملائكة الموكَّلون بالجنة، ويُحَيُّونهم بالبِشر والسرور; لطهارتهم من آثار المعاصي قائلين لهم: سلام عليكم، وسلمتم من كل آفة، طابت أحوالكم، فادخلوا الجنة خالدين فيها."));
        alzomrExes.add(new AlzomrEx("وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي صَدَقَنَا وَعْدَهُ وَأَوْرَثَنَا الْأَرْضَ نَتَبَوَّأُ مِنَ الْجَنَّةِ حَيْثُ نَشَاءُ فَنِعْمَ أَجْرُ الْعَامِلِينَ (74)"));
        alzomrExes.add(new AlzomrEx("وقال المؤمنون: الحمد لله الذي صدَقنا وعده الذي وعدَنا إياه على ألسنة رسله، وأورثَنا أرض الجنة نَنْزِل منها في أيِّ مكان شئنا، فنِعم ثواب المحسنين الذين اجتهدوا في طاعة ربهم."));
        alzomrExes.add(new AlzomrEx("وَتَرَى الْمَلَائِكَةَ حَافِّينَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَقِيلَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ (75)"));
        alzomrExes.add(new AlzomrEx("وترى -أيها النبي- الملائكة محيطين بعرش الرحمن، ينزهون ربهم عن كل ما لا يليق به، وقضى الله سبحانه وتعالى بين الخلائق بالحق والعدل، فأسكن أهل الإيمان الجنة، وأهل الكفر النار، وقيل: الحمد لله رب العالمين على ما قضى به بين أهل الجنة وأهل النار، حَمْدَ فضل وإحسان، وحَمْدَ عدل وحكمة."));


        quran_explanation_39_adapter = new quran_explanation_39_adapter(alzomrExes ,QuranExplanation_39Activity.this);

        recyclerView = findViewById(R.id.rv_explanation_39);
        recyclerView.setLayoutManager(new LinearLayoutManager(QuranExplanation_39Activity.this));
        recyclerView.setAdapter(quran_explanation_39_adapter);


    }

}